Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_MCFG6 : (MATRIX Offset: 0x18) (R/W 32) Master Configuration Register 6 -------- */
#define MATRIX_MCFG6_ULBT_Pos                 _U_(0)                                               /**< (MATRIX_MCFG6) Undefined Length Burst Type Position */
#define MATRIX_MCFG6_ULBT_Msk                 (_U_(0x7) << MATRIX_MCFG6_ULBT_Pos)                  /**< (MATRIX_MCFG6) Undefined Length Burst Type Mask */
#define MATRIX_MCFG6_ULBT(value)              (MATRIX_MCFG6_ULBT_Msk & ((value) << MATRIX_MCFG6_ULBT_Pos))
#define   MATRIX_MCFG6_ULBT_UNLIMITED_Val     _U_(0x0)                                             /**< (MATRIX_MCFG6) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave.  */
#define   MATRIX_MCFG6_ULBT_SINGLE_Val        _U_(0x1)                                             /**< (MATRIX_MCFG6) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence.  */
#define   MATRIX_MCFG6_ULBT_4_BEAT_Val        _U_(0x2)                                             /**< (MATRIX_MCFG6) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats.  */
#define   MATRIX_MCFG6_ULBT_8_BEAT_Val        _U_(0x3)                                             /**< (MATRIX_MCFG6) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats.  */
#define   MATRIX_MCFG6_ULBT_16_BEAT_Val       _U_(0x4)                                             /**< (MATRIX_MCFG6) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats.  */
#define   MATRIX_MCFG6_ULBT_32_BEAT_Val       _U_(0x5)                                             /**< (MATRIX_MCFG6) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats.  */
#define   MATRIX_MCFG6_ULBT_64_BEAT_Val       _U_(0x6)                                             /**< (MATRIX_MCFG6) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats.  */
#define   MATRIX_MCFG6_ULBT_128_BEAT_Val      _U_(0x7)                                             /**< (MATRIX_MCFG6) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving.  */
#define MATRIX_MCFG6_ULBT_UNLIMITED           (MATRIX_MCFG6_ULBT_UNLIMITED_Val << MATRIX_MCFG6_ULBT_Pos) /**< (MATRIX_MCFG6) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave. Position  */
#define MATRIX_MCFG6_ULBT_SINGLE              (MATRIX_MCFG6_ULBT_SINGLE_Val << MATRIX_MCFG6_ULBT_Pos) /**< (MATRIX_MCFG6) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence. Position  */
#define MATRIX_MCFG6_ULBT_4_BEAT              (MATRIX_MCFG6_ULBT_4_BEAT_Val << MATRIX_MCFG6_ULBT_Pos) /**< (MATRIX_MCFG6) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats. Position  */
#define MATRIX_MCFG6_ULBT_8_BEAT              (MATRIX_MCFG6_ULBT_8_BEAT_Val << MATRIX_MCFG6_ULBT_Pos) /**< (MATRIX_MCFG6) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats. Position  */
#define MATRIX_MCFG6_ULBT_16_BEAT             (MATRIX_MCFG6_ULBT_16_BEAT_Val << MATRIX_MCFG6_ULBT_Pos) /**< (MATRIX_MCFG6) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats. Position  */
#define MATRIX_MCFG6_ULBT_32_BEAT             (MATRIX_MCFG6_ULBT_32_BEAT_Val << MATRIX_MCFG6_ULBT_Pos) /**< (MATRIX_MCFG6) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats. Position  */
#define MATRIX_MCFG6_ULBT_64_BEAT             (MATRIX_MCFG6_ULBT_64_BEAT_Val << MATRIX_MCFG6_ULBT_Pos) /**< (MATRIX_MCFG6) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats. Position  */
#define MATRIX_MCFG6_ULBT_128_BEAT            (MATRIX_MCFG6_ULBT_128_BEAT_Val << MATRIX_MCFG6_ULBT_Pos) /**< (MATRIX_MCFG6) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving. Position  */
#define MATRIX_MCFG6_Msk                      _U_(0x00000007)                                      /**< (MATRIX_MCFG6) Register Mask  */


/* -------- MATRIX_MCFG7 : (MATRIX Offset: 0x1C) (R/W 32) Master Configuration Register 7 -------- */
#define MATRIX_MCFG7_ULBT_Pos                 _U_(0)                                               /**< (MATRIX_MCFG7) Undefined Length Burst Type Position */
#define MATRIX_MCFG7_ULBT_Msk                 (_U_(0x7) << MATRIX_MCFG7_ULBT_Pos)                  /**< (MATRIX_MCFG7) Undefined Length Burst Type Mask */
#define MATRIX_MCFG7_ULBT(value)              (MATRIX_MCFG7_ULBT_Msk & ((value) << MATRIX_MCFG7_ULBT_Pos))
#define   MATRIX_MCFG7_ULBT_UNLIMITED_Val     _U_(0x0)                                             /**< (MATRIX_MCFG7) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave.  */
#define   MATRIX_MCFG7_ULBT_SINGLE_Val        _U_(0x1)                                             /**< (MATRIX_MCFG7) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence.  */
#define   MATRIX_MCFG7_ULBT_4_BEAT_Val        _U_(0x2)                                             /**< (MATRIX_MCFG7) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats.  */
#define   MATRIX_MCFG7_ULBT_8_BEAT_Val        _U_(0x3)                                             /**< (MATRIX_MCFG7) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats.  */
#define   MATRIX_MCFG7_ULBT_16_BEAT_Val       _U_(0x4)                                             /**< (MATRIX_MCFG7) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats.  */
#define   MATRIX_MCFG7_ULBT_32_BEAT_Val       _U_(0x5)                                             /**< (MATRIX_MCFG7) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats.  */
#define   MATRIX_MCFG7_ULBT_64_BEAT_Val       _U_(0x6)                                             /**< (MATRIX_MCFG7) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats.  */
#define   MATRIX_MCFG7_ULBT_128_BEAT_Val      _U_(0x7)                                             /**< (MATRIX_MCFG7) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving.  */
#define MATRIX_MCFG7_ULBT_UNLIMITED           (MATRIX_MCFG7_ULBT_UNLIMITED_Val << MATRIX_MCFG7_ULBT_Pos) /**< (MATRIX_MCFG7) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave. Position  */
#define MATRIX_MCFG7_ULBT_SINGLE              (MATRIX_MCFG7_ULBT_SINGLE_Val << MATRIX_MCFG7_ULBT_Pos) /**< (MATRIX_MCFG7) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence. Position  */
#define MATRIX_MCFG7_ULBT_4_BEAT              (MATRIX_MCFG7_ULBT_4_BEAT_Val << MATRIX_MCFG7_ULBT_Pos) /**< (MATRIX_MCFG7) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats. Position  */
#define MATRIX_MCFG7_ULBT_8_BEAT              (MATRIX_MCFG7_ULBT_8_BEAT_Val << MATRIX_MCFG7_ULBT_Pos) /**< (MATRIX_MCFG7) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats. Position  */
#define MATRIX_MCFG7_ULBT_16_BEAT             (MATRIX_MCFG7_ULBT_16_BEAT_Val << MATRIX_MCFG7_ULBT_Pos) /**< (MATRIX_MCFG7) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats. Position  */
#define MATRIX_MCFG7_ULBT_32_BEAT             (MATRIX_MCFG7_ULBT_32_BEAT_Val << MATRIX_MCFG7_ULBT_Pos) /**< (MATRIX_MCFG7) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats. Position  */
#define MATRIX_MCFG7_ULBT_64_BEAT             (MATRIX_MCFG7_ULBT_64_BEAT_Val << MATRIX_MCFG7_ULBT_Pos) /**< (MATRIX_MCFG7) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats. Position  */
#define MATRIX_MCFG7_ULBT_128_BEAT            (MATRIX_MCFG7_ULBT_128_BEAT_Val << MATRIX_MCFG7_ULBT_Pos) /**< (MATRIX_MCFG7) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving. Position  */
#define MATRIX_MCFG7_Msk                      _U_(0x00000007)                                      /**< (MATRIX_MCFG7) Register Mask  */


/* -------- MATRIX_MCFG8 : (MATRIX Offset: 0x20) (R/W 32) Master Configuration Register 8 -------- */
#define MATRIX_MCFG8_ULBT_Pos                 _U_(0)                                               /**< (MATRIX_MCFG8) Undefined Length Burst Type Position */
#define MATRIX_MCFG8_ULBT_Msk                 (_U_(0x7) << MATRIX_MCFG8_ULBT_Pos)                  /**< (MATRIX_MCFG8) Undefined Length Burst Type Mask */
#define MATRIX_MCFG8_ULBT(value)              (MATRIX_MCFG8_ULBT_Msk & ((value) << MATRIX_MCFG8_ULBT_Pos))
#define   MATRIX_MCFG8_ULBT_UNLIMITED_Val     _U_(0x0)                                             /**< (MATRIX_MCFG8) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave.  */
#define   MATRIX_MCFG8_ULBT_SINGLE_Val        _U_(0x1)                                             /**< (MATRIX_MCFG8) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence.  */
#define   MATRIX_MCFG8_ULBT_4_BEAT_Val        _U_(0x2)                                             /**< (MATRIX_MCFG8) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats.  */
#define   MATRIX_MCFG8_ULBT_8_BEAT_Val        _U_(0x3)                                             /**< (MATRIX_MCFG8) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats.  */
#define   MATRIX_MCFG8_ULBT_16_BEAT_Val       _U_(0x4)                                             /**< (MATRIX_MCFG8) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats.  */
#define   MATRIX_MCFG8_ULBT_32_BEAT_Val       _U_(0x5)                                             /**< (MATRIX_MCFG8) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats.  */
#define   MATRIX_MCFG8_ULBT_64_BEAT_Val       _U_(0x6)                                             /**< (MATRIX_MCFG8) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats.  */
#define   MATRIX_MCFG8_ULBT_128_BEAT_Val      _U_(0x7)                                             /**< (MATRIX_MCFG8) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving.  */
#define MATRIX_MCFG8_ULBT_UNLIMITED           (MATRIX_MCFG8_ULBT_UNLIMITED_Val << MATRIX_MCFG8_ULBT_Pos) /**< (MATRIX_MCFG8) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave. Position  */
#define MATRIX_MCFG8_ULBT_SINGLE              (MATRIX_MCFG8_ULBT_SINGLE_Val << MATRIX_MCFG8_ULBT_Pos) /**< (MATRIX_MCFG8) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence. Position  */
#define MATRIX_MCFG8_ULBT_4_BEAT              (MATRIX_MCFG8_ULBT_4_BEAT_Val << MATRIX_MCFG8_ULBT_Pos) /**< (MATRIX_MCFG8) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats. Position  */
#define MATRIX_MCFG8_ULBT_8_BEAT              (MATRIX_MCFG8_ULBT_8_BEAT_Val << MATRIX_MCFG8_ULBT_Pos) /**< (MATRIX_MCFG8) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats. Position  */
#define MATRIX_MCFG8_ULBT_16_BEAT             (MATRIX_MCFG8_ULBT_16_BEAT_Val << MATRIX_MCFG8_ULBT_Pos) /**< (MATRIX_MCFG8) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats. Position  */
#define MATRIX_MCFG8_ULBT_32_BEAT             (MATRIX_MCFG8_ULBT_32_BEAT_Val << MATRIX_MCFG8_ULBT_Pos) /**< (MATRIX_MCFG8) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats. Position  */
#define MATRIX_MCFG8_ULBT_64_BEAT             (MATRIX_MCFG8_ULBT_64_BEAT_Val << MATRIX_MCFG8_ULBT_Pos) /**< (MATRIX_MCFG8) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats. Position  */
#define MATRIX_MCFG8_ULBT_128_BEAT            (MATRIX_MCFG8_ULBT_128_BEAT_Val << MATRIX_MCFG8_ULBT_Pos) /**< (MATRIX_MCFG8) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving. Position  */
#define MATRIX_MCFG8_Msk                      _U_(0x00000007)                                      /**< (MATRIX_MCFG8) Register Mask  */


