Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_MCFG14 : (MATRIX Offset: 0x38) (R/W 32) Master Configuration Register 14 -------- */
#define MATRIX_MCFG14_ULBT_Pos                _U_(0)                                               /**< (MATRIX_MCFG14) Undefined Length Burst Type Position */
#define MATRIX_MCFG14_ULBT_Msk                (_U_(0x7) << MATRIX_MCFG14_ULBT_Pos)                 /**< (MATRIX_MCFG14) Undefined Length Burst Type Mask */
#define MATRIX_MCFG14_ULBT(value)             (MATRIX_MCFG14_ULBT_Msk & ((value) << MATRIX_MCFG14_ULBT_Pos))
#define   MATRIX_MCFG14_ULBT_UNLIMITED_Val    _U_(0x0)                                             /**< (MATRIX_MCFG14) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave.  */
#define   MATRIX_MCFG14_ULBT_SINGLE_Val       _U_(0x1)                                             /**< (MATRIX_MCFG14) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence.  */
#define   MATRIX_MCFG14_ULBT_4_BEAT_Val       _U_(0x2)                                             /**< (MATRIX_MCFG14) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats.  */
#define   MATRIX_MCFG14_ULBT_8_BEAT_Val       _U_(0x3)                                             /**< (MATRIX_MCFG14) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats.  */
#define   MATRIX_MCFG14_ULBT_16_BEAT_Val      _U_(0x4)                                             /**< (MATRIX_MCFG14) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats.  */
#define   MATRIX_MCFG14_ULBT_32_BEAT_Val      _U_(0x5)                                             /**< (MATRIX_MCFG14) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats.  */
#define   MATRIX_MCFG14_ULBT_64_BEAT_Val      _U_(0x6)                                             /**< (MATRIX_MCFG14) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats.  */
#define   MATRIX_MCFG14_ULBT_128_BEAT_Val     _U_(0x7)                                             /**< (MATRIX_MCFG14) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving.  */
#define MATRIX_MCFG14_ULBT_UNLIMITED          (MATRIX_MCFG14_ULBT_UNLIMITED_Val << MATRIX_MCFG14_ULBT_Pos) /**< (MATRIX_MCFG14) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave. Position  */
#define MATRIX_MCFG14_ULBT_SINGLE             (MATRIX_MCFG14_ULBT_SINGLE_Val << MATRIX_MCFG14_ULBT_Pos) /**< (MATRIX_MCFG14) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence. Position  */
#define MATRIX_MCFG14_ULBT_4_BEAT             (MATRIX_MCFG14_ULBT_4_BEAT_Val << MATRIX_MCFG14_ULBT_Pos) /**< (MATRIX_MCFG14) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats. Position  */
#define MATRIX_MCFG14_ULBT_8_BEAT             (MATRIX_MCFG14_ULBT_8_BEAT_Val << MATRIX_MCFG14_ULBT_Pos) /**< (MATRIX_MCFG14) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats. Position  */
#define MATRIX_MCFG14_ULBT_16_BEAT            (MATRIX_MCFG14_ULBT_16_BEAT_Val << MATRIX_MCFG14_ULBT_Pos) /**< (MATRIX_MCFG14) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats. Position  */
#define MATRIX_MCFG14_ULBT_32_BEAT            (MATRIX_MCFG14_ULBT_32_BEAT_Val << MATRIX_MCFG14_ULBT_Pos) /**< (MATRIX_MCFG14) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats. Position  */
#define MATRIX_MCFG14_ULBT_64_BEAT            (MATRIX_MCFG14_ULBT_64_BEAT_Val << MATRIX_MCFG14_ULBT_Pos) /**< (MATRIX_MCFG14) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats. Position  */
#define MATRIX_MCFG14_ULBT_128_BEAT           (MATRIX_MCFG14_ULBT_128_BEAT_Val << MATRIX_MCFG14_ULBT_Pos) /**< (MATRIX_MCFG14) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving. Position  */
#define MATRIX_MCFG14_Msk                     _U_(0x00000007)                                      /**< (MATRIX_MCFG14) Register Mask  */


/* -------- MATRIX_MCFG15 : (MATRIX Offset: 0x3C) (R/W 32) Master Configuration Register 15 -------- */
#define MATRIX_MCFG15_ULBT_Pos                _U_(0)                                               /**< (MATRIX_MCFG15) Undefined Length Burst Type Position */
#define MATRIX_MCFG15_ULBT_Msk                (_U_(0x7) << MATRIX_MCFG15_ULBT_Pos)                 /**< (MATRIX_MCFG15) Undefined Length Burst Type Mask */
#define MATRIX_MCFG15_ULBT(value)             (MATRIX_MCFG15_ULBT_Msk & ((value) << MATRIX_MCFG15_ULBT_Pos))
#define   MATRIX_MCFG15_ULBT_UNLIMITED_Val    _U_(0x0)                                             /**< (MATRIX_MCFG15) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave.  */
#define   MATRIX_MCFG15_ULBT_SINGLE_Val       _U_(0x1)                                             /**< (MATRIX_MCFG15) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence.  */
#define   MATRIX_MCFG15_ULBT_4_BEAT_Val       _U_(0x2)                                             /**< (MATRIX_MCFG15) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats.  */
#define   MATRIX_MCFG15_ULBT_8_BEAT_Val       _U_(0x3)                                             /**< (MATRIX_MCFG15) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats.  */
#define   MATRIX_MCFG15_ULBT_16_BEAT_Val      _U_(0x4)                                             /**< (MATRIX_MCFG15) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats.  */
#define   MATRIX_MCFG15_ULBT_32_BEAT_Val      _U_(0x5)                                             /**< (MATRIX_MCFG15) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats.  */
#define   MATRIX_MCFG15_ULBT_64_BEAT_Val      _U_(0x6)                                             /**< (MATRIX_MCFG15) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats.  */
#define   MATRIX_MCFG15_ULBT_128_BEAT_Val     _U_(0x7)                                             /**< (MATRIX_MCFG15) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving.  */
#define MATRIX_MCFG15_ULBT_UNLIMITED          (MATRIX_MCFG15_ULBT_UNLIMITED_Val << MATRIX_MCFG15_ULBT_Pos) /**< (MATRIX_MCFG15) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave. Position  */
#define MATRIX_MCFG15_ULBT_SINGLE             (MATRIX_MCFG15_ULBT_SINGLE_Val << MATRIX_MCFG15_ULBT_Pos) /**< (MATRIX_MCFG15) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence. Position  */
#define MATRIX_MCFG15_ULBT_4_BEAT             (MATRIX_MCFG15_ULBT_4_BEAT_Val << MATRIX_MCFG15_ULBT_Pos) /**< (MATRIX_MCFG15) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats. Position  */
#define MATRIX_MCFG15_ULBT_8_BEAT             (MATRIX_MCFG15_ULBT_8_BEAT_Val << MATRIX_MCFG15_ULBT_Pos) /**< (MATRIX_MCFG15) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats. Position  */
#define MATRIX_MCFG15_ULBT_16_BEAT            (MATRIX_MCFG15_ULBT_16_BEAT_Val << MATRIX_MCFG15_ULBT_Pos) /**< (MATRIX_MCFG15) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats. Position  */
#define MATRIX_MCFG15_ULBT_32_BEAT            (MATRIX_MCFG15_ULBT_32_BEAT_Val << MATRIX_MCFG15_ULBT_Pos) /**< (MATRIX_MCFG15) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats. Position  */
#define MATRIX_MCFG15_ULBT_64_BEAT            (MATRIX_MCFG15_ULBT_64_BEAT_Val << MATRIX_MCFG15_ULBT_Pos) /**< (MATRIX_MCFG15) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats. Position  */
#define MATRIX_MCFG15_ULBT_128_BEAT           (MATRIX_MCFG15_ULBT_128_BEAT_Val << MATRIX_MCFG15_ULBT_Pos) /**< (MATRIX_MCFG15) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving. Position  */
#define MATRIX_MCFG15_Msk                     _U_(0x00000007)                                      /**< (MATRIX_MCFG15) Register Mask  */


/* -------- MATRIX_SCFG0 : (MATRIX Offset: 0x40) (R/W 32) Slave Configuration Register 0 -------- */
#define MATRIX_SCFG0_SLOT_CYCLE_Pos           _U_(0)                                               /**< (MATRIX_SCFG0) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG0_SLOT_CYCLE_Msk           (_U_(0x1FF) << MATRIX_SCFG0_SLOT_CYCLE_Pos)          /**< (MATRIX_SCFG0) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG0_SLOT_CYCLE(value)        (MATRIX_SCFG0_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG0_SLOT_CYCLE_Pos))
#define MATRIX_SCFG0_DEFMSTR_TYPE_Pos         _U_(16)                                              /**< (MATRIX_SCFG0) Default Master Type Position */
#define MATRIX_SCFG0_DEFMSTR_TYPE_Msk         (_U_(0x3) << MATRIX_SCFG0_DEFMSTR_TYPE_Pos)          /**< (MATRIX_SCFG0) Default Master Type Mask */
#define MATRIX_SCFG0_DEFMSTR_TYPE(value)      (MATRIX_SCFG0_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG0_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG0_DEFMSTR_TYPE_NONE_Val  _U_(0x0)                                             /**< (MATRIX_SCFG0) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG0_DEFMSTR_TYPE_LAST_Val  _U_(0x1)                                             /**< (MATRIX_SCFG0) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG0_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG0) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG0_DEFMSTR_TYPE_NONE        (MATRIX_SCFG0_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG0_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG0) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG0_DEFMSTR_TYPE_LAST        (MATRIX_SCFG0_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG0_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG0) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG0_DEFMSTR_TYPE_FIXED       (MATRIX_SCFG0_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG0_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG0) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG0_FIXED_DEFMSTR_Pos        _U_(18)                                              /**< (MATRIX_SCFG0) Fixed Default Master Position */
#define MATRIX_SCFG0_FIXED_DEFMSTR_Msk        (_U_(0xF) << MATRIX_SCFG0_FIXED_DEFMSTR_Pos)         /**< (MATRIX_SCFG0) Fixed Default Master Mask */
#define MATRIX_SCFG0_FIXED_DEFMSTR(value)     (MATRIX_SCFG0_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG0_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG0_Msk                      _U_(0x003F01FF)                                      /**< (MATRIX_SCFG0) Register Mask  */


/* -------- MATRIX_SCFG1 : (MATRIX Offset: 0x44) (R/W 32) Slave Configuration Register 1 -------- */
#define MATRIX_SCFG1_SLOT_CYCLE_Pos           _U_(0)                                               /**< (MATRIX_SCFG1) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG1_SLOT_CYCLE_Msk           (_U_(0x1FF) << MATRIX_SCFG1_SLOT_CYCLE_Pos)          /**< (MATRIX_SCFG1) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG1_SLOT_CYCLE(value)        (MATRIX_SCFG1_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG1_SLOT_CYCLE_Pos))
#define MATRIX_SCFG1_DEFMSTR_TYPE_Pos         _U_(16)                                              /**< (MATRIX_SCFG1) Default Master Type Position */
#define MATRIX_SCFG1_DEFMSTR_TYPE_Msk         (_U_(0x3) << MATRIX_SCFG1_DEFMSTR_TYPE_Pos)          /**< (MATRIX_SCFG1) Default Master Type Mask */
#define MATRIX_SCFG1_DEFMSTR_TYPE(value)      (MATRIX_SCFG1_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG1_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG1_DEFMSTR_TYPE_NONE_Val  _U_(0x0)                                             /**< (MATRIX_SCFG1) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG1_DEFMSTR_TYPE_LAST_Val  _U_(0x1)                                             /**< (MATRIX_SCFG1) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG1_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG1) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG1_DEFMSTR_TYPE_NONE        (MATRIX_SCFG1_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG1_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG1) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG1_DEFMSTR_TYPE_LAST        (MATRIX_SCFG1_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG1_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG1) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG1_DEFMSTR_TYPE_FIXED       (MATRIX_SCFG1_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG1_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG1) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG1_FIXED_DEFMSTR_Pos        _U_(18)                                              /**< (MATRIX_SCFG1) Fixed Default Master Position */
#define MATRIX_SCFG1_FIXED_DEFMSTR_Msk        (_U_(0xF) << MATRIX_SCFG1_FIXED_DEFMSTR_Pos)         /**< (MATRIX_SCFG1) Fixed Default Master Mask */
#define MATRIX_SCFG1_FIXED_DEFMSTR(value)     (MATRIX_SCFG1_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG1_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG1_Msk                      _U_(0x003F01FF)                                      /**< (MATRIX_SCFG1) Register Mask  */


