Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_SCFG2 : (MATRIX Offset: 0x48) (R/W 32) Slave Configuration Register 2 -------- */
#define MATRIX_SCFG2_SLOT_CYCLE_Pos           _U_(0)                                               /**< (MATRIX_SCFG2) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG2_SLOT_CYCLE_Msk           (_U_(0x1FF) << MATRIX_SCFG2_SLOT_CYCLE_Pos)          /**< (MATRIX_SCFG2) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG2_SLOT_CYCLE(value)        (MATRIX_SCFG2_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG2_SLOT_CYCLE_Pos))
#define MATRIX_SCFG2_DEFMSTR_TYPE_Pos         _U_(16)                                              /**< (MATRIX_SCFG2) Default Master Type Position */
#define MATRIX_SCFG2_DEFMSTR_TYPE_Msk         (_U_(0x3) << MATRIX_SCFG2_DEFMSTR_TYPE_Pos)          /**< (MATRIX_SCFG2) Default Master Type Mask */
#define MATRIX_SCFG2_DEFMSTR_TYPE(value)      (MATRIX_SCFG2_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG2_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG2_DEFMSTR_TYPE_NONE_Val  _U_(0x0)                                             /**< (MATRIX_SCFG2) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG2_DEFMSTR_TYPE_LAST_Val  _U_(0x1)                                             /**< (MATRIX_SCFG2) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG2_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG2) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG2_DEFMSTR_TYPE_NONE        (MATRIX_SCFG2_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG2_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG2) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG2_DEFMSTR_TYPE_LAST        (MATRIX_SCFG2_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG2_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG2) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG2_DEFMSTR_TYPE_FIXED       (MATRIX_SCFG2_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG2_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG2) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG2_FIXED_DEFMSTR_Pos        _U_(18)                                              /**< (MATRIX_SCFG2) Fixed Default Master Position */
#define MATRIX_SCFG2_FIXED_DEFMSTR_Msk        (_U_(0xF) << MATRIX_SCFG2_FIXED_DEFMSTR_Pos)         /**< (MATRIX_SCFG2) Fixed Default Master Mask */
#define MATRIX_SCFG2_FIXED_DEFMSTR(value)     (MATRIX_SCFG2_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG2_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG2_Msk                      _U_(0x003F01FF)                                      /**< (MATRIX_SCFG2) Register Mask  */


/* -------- MATRIX_SCFG3 : (MATRIX Offset: 0x4C) (R/W 32) Slave Configuration Register 3 -------- */
#define MATRIX_SCFG3_SLOT_CYCLE_Pos           _U_(0)                                               /**< (MATRIX_SCFG3) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG3_SLOT_CYCLE_Msk           (_U_(0x1FF) << MATRIX_SCFG3_SLOT_CYCLE_Pos)          /**< (MATRIX_SCFG3) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG3_SLOT_CYCLE(value)        (MATRIX_SCFG3_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG3_SLOT_CYCLE_Pos))
#define MATRIX_SCFG3_DEFMSTR_TYPE_Pos         _U_(16)                                              /**< (MATRIX_SCFG3) Default Master Type Position */
#define MATRIX_SCFG3_DEFMSTR_TYPE_Msk         (_U_(0x3) << MATRIX_SCFG3_DEFMSTR_TYPE_Pos)          /**< (MATRIX_SCFG3) Default Master Type Mask */
#define MATRIX_SCFG3_DEFMSTR_TYPE(value)      (MATRIX_SCFG3_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG3_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG3_DEFMSTR_TYPE_NONE_Val  _U_(0x0)                                             /**< (MATRIX_SCFG3) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG3_DEFMSTR_TYPE_LAST_Val  _U_(0x1)                                             /**< (MATRIX_SCFG3) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG3_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG3) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG3_DEFMSTR_TYPE_NONE        (MATRIX_SCFG3_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG3_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG3) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG3_DEFMSTR_TYPE_LAST        (MATRIX_SCFG3_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG3_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG3) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG3_DEFMSTR_TYPE_FIXED       (MATRIX_SCFG3_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG3_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG3) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG3_FIXED_DEFMSTR_Pos        _U_(18)                                              /**< (MATRIX_SCFG3) Fixed Default Master Position */
#define MATRIX_SCFG3_FIXED_DEFMSTR_Msk        (_U_(0xF) << MATRIX_SCFG3_FIXED_DEFMSTR_Pos)         /**< (MATRIX_SCFG3) Fixed Default Master Mask */
#define MATRIX_SCFG3_FIXED_DEFMSTR(value)     (MATRIX_SCFG3_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG3_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG3_Msk                      _U_(0x003F01FF)                                      /**< (MATRIX_SCFG3) Register Mask  */


/* -------- MATRIX_SCFG4 : (MATRIX Offset: 0x50) (R/W 32) Slave Configuration Register 4 -------- */
#define MATRIX_SCFG4_SLOT_CYCLE_Pos           _U_(0)                                               /**< (MATRIX_SCFG4) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG4_SLOT_CYCLE_Msk           (_U_(0x1FF) << MATRIX_SCFG4_SLOT_CYCLE_Pos)          /**< (MATRIX_SCFG4) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG4_SLOT_CYCLE(value)        (MATRIX_SCFG4_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG4_SLOT_CYCLE_Pos))
#define MATRIX_SCFG4_DEFMSTR_TYPE_Pos         _U_(16)                                              /**< (MATRIX_SCFG4) Default Master Type Position */
#define MATRIX_SCFG4_DEFMSTR_TYPE_Msk         (_U_(0x3) << MATRIX_SCFG4_DEFMSTR_TYPE_Pos)          /**< (MATRIX_SCFG4) Default Master Type Mask */
#define MATRIX_SCFG4_DEFMSTR_TYPE(value)      (MATRIX_SCFG4_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG4_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG4_DEFMSTR_TYPE_NONE_Val  _U_(0x0)                                             /**< (MATRIX_SCFG4) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG4_DEFMSTR_TYPE_LAST_Val  _U_(0x1)                                             /**< (MATRIX_SCFG4) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG4_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG4) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG4_DEFMSTR_TYPE_NONE        (MATRIX_SCFG4_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG4_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG4) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG4_DEFMSTR_TYPE_LAST        (MATRIX_SCFG4_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG4_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG4) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG4_DEFMSTR_TYPE_FIXED       (MATRIX_SCFG4_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG4_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG4) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG4_FIXED_DEFMSTR_Pos        _U_(18)                                              /**< (MATRIX_SCFG4) Fixed Default Master Position */
#define MATRIX_SCFG4_FIXED_DEFMSTR_Msk        (_U_(0xF) << MATRIX_SCFG4_FIXED_DEFMSTR_Pos)         /**< (MATRIX_SCFG4) Fixed Default Master Mask */
#define MATRIX_SCFG4_FIXED_DEFMSTR(value)     (MATRIX_SCFG4_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG4_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG4_Msk                      _U_(0x003F01FF)                                      /**< (MATRIX_SCFG4) Register Mask  */


/* -------- MATRIX_SCFG5 : (MATRIX Offset: 0x54) (R/W 32) Slave Configuration Register 5 -------- */
#define MATRIX_SCFG5_SLOT_CYCLE_Pos           _U_(0)                                               /**< (MATRIX_SCFG5) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG5_SLOT_CYCLE_Msk           (_U_(0x1FF) << MATRIX_SCFG5_SLOT_CYCLE_Pos)          /**< (MATRIX_SCFG5) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG5_SLOT_CYCLE(value)        (MATRIX_SCFG5_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG5_SLOT_CYCLE_Pos))
#define MATRIX_SCFG5_DEFMSTR_TYPE_Pos         _U_(16)                                              /**< (MATRIX_SCFG5) Default Master Type Position */
#define MATRIX_SCFG5_DEFMSTR_TYPE_Msk         (_U_(0x3) << MATRIX_SCFG5_DEFMSTR_TYPE_Pos)          /**< (MATRIX_SCFG5) Default Master Type Mask */
#define MATRIX_SCFG5_DEFMSTR_TYPE(value)      (MATRIX_SCFG5_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG5_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG5_DEFMSTR_TYPE_NONE_Val  _U_(0x0)                                             /**< (MATRIX_SCFG5) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG5_DEFMSTR_TYPE_LAST_Val  _U_(0x1)                                             /**< (MATRIX_SCFG5) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG5_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG5) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG5_DEFMSTR_TYPE_NONE        (MATRIX_SCFG5_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG5_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG5) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG5_DEFMSTR_TYPE_LAST        (MATRIX_SCFG5_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG5_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG5) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG5_DEFMSTR_TYPE_FIXED       (MATRIX_SCFG5_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG5_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG5) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG5_FIXED_DEFMSTR_Pos        _U_(18)                                              /**< (MATRIX_SCFG5) Fixed Default Master Position */
#define MATRIX_SCFG5_FIXED_DEFMSTR_Msk        (_U_(0xF) << MATRIX_SCFG5_FIXED_DEFMSTR_Pos)         /**< (MATRIX_SCFG5) Fixed Default Master Mask */
#define MATRIX_SCFG5_FIXED_DEFMSTR(value)     (MATRIX_SCFG5_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG5_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG5_Msk                      _U_(0x003F01FF)                                      /**< (MATRIX_SCFG5) Register Mask  */


