Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_SCFG11 : (MATRIX Offset: 0x6C) (R/W 32) Slave Configuration Register 11 -------- */
#define MATRIX_SCFG11_SLOT_CYCLE_Pos          _U_(0)                                               /**< (MATRIX_SCFG11) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG11_SLOT_CYCLE_Msk          (_U_(0x1FF) << MATRIX_SCFG11_SLOT_CYCLE_Pos)         /**< (MATRIX_SCFG11) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG11_SLOT_CYCLE(value)       (MATRIX_SCFG11_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG11_SLOT_CYCLE_Pos))
#define MATRIX_SCFG11_DEFMSTR_TYPE_Pos        _U_(16)                                              /**< (MATRIX_SCFG11) Default Master Type Position */
#define MATRIX_SCFG11_DEFMSTR_TYPE_Msk        (_U_(0x3) << MATRIX_SCFG11_DEFMSTR_TYPE_Pos)         /**< (MATRIX_SCFG11) Default Master Type Mask */
#define MATRIX_SCFG11_DEFMSTR_TYPE(value)     (MATRIX_SCFG11_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG11_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG11_DEFMSTR_TYPE_NONE_Val _U_(0x0)                                             /**< (MATRIX_SCFG11) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG11_DEFMSTR_TYPE_LAST_Val _U_(0x1)                                             /**< (MATRIX_SCFG11) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG11_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG11) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG11_DEFMSTR_TYPE_NONE       (MATRIX_SCFG11_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG11_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG11) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG11_DEFMSTR_TYPE_LAST       (MATRIX_SCFG11_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG11_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG11) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG11_DEFMSTR_TYPE_FIXED      (MATRIX_SCFG11_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG11_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG11) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG11_FIXED_DEFMSTR_Pos       _U_(18)                                              /**< (MATRIX_SCFG11) Fixed Default Master Position */
#define MATRIX_SCFG11_FIXED_DEFMSTR_Msk       (_U_(0xF) << MATRIX_SCFG11_FIXED_DEFMSTR_Pos)        /**< (MATRIX_SCFG11) Fixed Default Master Mask */
#define MATRIX_SCFG11_FIXED_DEFMSTR(value)    (MATRIX_SCFG11_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG11_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG11_Msk                     _U_(0x003F01FF)                                      /**< (MATRIX_SCFG11) Register Mask  */


/* -------- MATRIX_SCFG12 : (MATRIX Offset: 0x70) (R/W 32) Slave Configuration Register 12 -------- */
#define MATRIX_SCFG12_SLOT_CYCLE_Pos          _U_(0)                                               /**< (MATRIX_SCFG12) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG12_SLOT_CYCLE_Msk          (_U_(0x1FF) << MATRIX_SCFG12_SLOT_CYCLE_Pos)         /**< (MATRIX_SCFG12) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG12_SLOT_CYCLE(value)       (MATRIX_SCFG12_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG12_SLOT_CYCLE_Pos))
#define MATRIX_SCFG12_DEFMSTR_TYPE_Pos        _U_(16)                                              /**< (MATRIX_SCFG12) Default Master Type Position */
#define MATRIX_SCFG12_DEFMSTR_TYPE_Msk        (_U_(0x3) << MATRIX_SCFG12_DEFMSTR_TYPE_Pos)         /**< (MATRIX_SCFG12) Default Master Type Mask */
#define MATRIX_SCFG12_DEFMSTR_TYPE(value)     (MATRIX_SCFG12_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG12_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG12_DEFMSTR_TYPE_NONE_Val _U_(0x0)                                             /**< (MATRIX_SCFG12) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG12_DEFMSTR_TYPE_LAST_Val _U_(0x1)                                             /**< (MATRIX_SCFG12) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG12_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG12) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG12_DEFMSTR_TYPE_NONE       (MATRIX_SCFG12_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG12_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG12) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG12_DEFMSTR_TYPE_LAST       (MATRIX_SCFG12_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG12_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG12) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG12_DEFMSTR_TYPE_FIXED      (MATRIX_SCFG12_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG12_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG12) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG12_FIXED_DEFMSTR_Pos       _U_(18)                                              /**< (MATRIX_SCFG12) Fixed Default Master Position */
#define MATRIX_SCFG12_FIXED_DEFMSTR_Msk       (_U_(0xF) << MATRIX_SCFG12_FIXED_DEFMSTR_Pos)        /**< (MATRIX_SCFG12) Fixed Default Master Mask */
#define MATRIX_SCFG12_FIXED_DEFMSTR(value)    (MATRIX_SCFG12_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG12_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG12_Msk                     _U_(0x003F01FF)                                      /**< (MATRIX_SCFG12) Register Mask  */


/* -------- MATRIX_SCFG13 : (MATRIX Offset: 0x74) (R/W 32) Slave Configuration Register 13 -------- */
#define MATRIX_SCFG13_SLOT_CYCLE_Pos          _U_(0)                                               /**< (MATRIX_SCFG13) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG13_SLOT_CYCLE_Msk          (_U_(0x1FF) << MATRIX_SCFG13_SLOT_CYCLE_Pos)         /**< (MATRIX_SCFG13) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG13_SLOT_CYCLE(value)       (MATRIX_SCFG13_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG13_SLOT_CYCLE_Pos))
#define MATRIX_SCFG13_DEFMSTR_TYPE_Pos        _U_(16)                                              /**< (MATRIX_SCFG13) Default Master Type Position */
#define MATRIX_SCFG13_DEFMSTR_TYPE_Msk        (_U_(0x3) << MATRIX_SCFG13_DEFMSTR_TYPE_Pos)         /**< (MATRIX_SCFG13) Default Master Type Mask */
#define MATRIX_SCFG13_DEFMSTR_TYPE(value)     (MATRIX_SCFG13_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG13_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG13_DEFMSTR_TYPE_NONE_Val _U_(0x0)                                             /**< (MATRIX_SCFG13) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG13_DEFMSTR_TYPE_LAST_Val _U_(0x1)                                             /**< (MATRIX_SCFG13) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG13_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG13) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG13_DEFMSTR_TYPE_NONE       (MATRIX_SCFG13_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG13_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG13) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG13_DEFMSTR_TYPE_LAST       (MATRIX_SCFG13_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG13_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG13) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG13_DEFMSTR_TYPE_FIXED      (MATRIX_SCFG13_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG13_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG13) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG13_FIXED_DEFMSTR_Pos       _U_(18)                                              /**< (MATRIX_SCFG13) Fixed Default Master Position */
#define MATRIX_SCFG13_FIXED_DEFMSTR_Msk       (_U_(0xF) << MATRIX_SCFG13_FIXED_DEFMSTR_Pos)        /**< (MATRIX_SCFG13) Fixed Default Master Mask */
#define MATRIX_SCFG13_FIXED_DEFMSTR(value)    (MATRIX_SCFG13_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG13_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG13_Msk                     _U_(0x003F01FF)                                      /**< (MATRIX_SCFG13) Register Mask  */


