Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_PRAS0 : (MATRIX Offset: 0x80) (R/W 32) Priority Register A for Slave 0 -------- */
#define MATRIX_PRAS0_M0PR_Pos                 _U_(0)                                               /**< (MATRIX_PRAS0) Master 0 Priority Position */
#define MATRIX_PRAS0_M0PR_Msk                 (_U_(0x3) << MATRIX_PRAS0_M0PR_Pos)                  /**< (MATRIX_PRAS0) Master 0 Priority Mask */
#define MATRIX_PRAS0_M0PR(value)              (MATRIX_PRAS0_M0PR_Msk & ((value) << MATRIX_PRAS0_M0PR_Pos))
#define MATRIX_PRAS0_LQOSEN0_Pos              _U_(2)                                               /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 0 Position */
#define MATRIX_PRAS0_LQOSEN0_Msk              (_U_(0x1) << MATRIX_PRAS0_LQOSEN0_Pos)               /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 0 Mask */
#define MATRIX_PRAS0_LQOSEN0(value)           (MATRIX_PRAS0_LQOSEN0_Msk & ((value) << MATRIX_PRAS0_LQOSEN0_Pos))
#define MATRIX_PRAS0_M1PR_Pos                 _U_(4)                                               /**< (MATRIX_PRAS0) Master 1 Priority Position */
#define MATRIX_PRAS0_M1PR_Msk                 (_U_(0x3) << MATRIX_PRAS0_M1PR_Pos)                  /**< (MATRIX_PRAS0) Master 1 Priority Mask */
#define MATRIX_PRAS0_M1PR(value)              (MATRIX_PRAS0_M1PR_Msk & ((value) << MATRIX_PRAS0_M1PR_Pos))
#define MATRIX_PRAS0_LQOSEN1_Pos              _U_(6)                                               /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 1 Position */
#define MATRIX_PRAS0_LQOSEN1_Msk              (_U_(0x1) << MATRIX_PRAS0_LQOSEN1_Pos)               /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 1 Mask */
#define MATRIX_PRAS0_LQOSEN1(value)           (MATRIX_PRAS0_LQOSEN1_Msk & ((value) << MATRIX_PRAS0_LQOSEN1_Pos))
#define MATRIX_PRAS0_M2PR_Pos                 _U_(8)                                               /**< (MATRIX_PRAS0) Master 2 Priority Position */
#define MATRIX_PRAS0_M2PR_Msk                 (_U_(0x3) << MATRIX_PRAS0_M2PR_Pos)                  /**< (MATRIX_PRAS0) Master 2 Priority Mask */
#define MATRIX_PRAS0_M2PR(value)              (MATRIX_PRAS0_M2PR_Msk & ((value) << MATRIX_PRAS0_M2PR_Pos))
#define MATRIX_PRAS0_LQOSEN2_Pos              _U_(10)                                              /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 2 Position */
#define MATRIX_PRAS0_LQOSEN2_Msk              (_U_(0x1) << MATRIX_PRAS0_LQOSEN2_Pos)               /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 2 Mask */
#define MATRIX_PRAS0_LQOSEN2(value)           (MATRIX_PRAS0_LQOSEN2_Msk & ((value) << MATRIX_PRAS0_LQOSEN2_Pos))
#define MATRIX_PRAS0_M3PR_Pos                 _U_(12)                                              /**< (MATRIX_PRAS0) Master 3 Priority Position */
#define MATRIX_PRAS0_M3PR_Msk                 (_U_(0x3) << MATRIX_PRAS0_M3PR_Pos)                  /**< (MATRIX_PRAS0) Master 3 Priority Mask */
#define MATRIX_PRAS0_M3PR(value)              (MATRIX_PRAS0_M3PR_Msk & ((value) << MATRIX_PRAS0_M3PR_Pos))
#define MATRIX_PRAS0_LQOSEN3_Pos              _U_(14)                                              /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 3 Position */
#define MATRIX_PRAS0_LQOSEN3_Msk              (_U_(0x1) << MATRIX_PRAS0_LQOSEN3_Pos)               /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 3 Mask */
#define MATRIX_PRAS0_LQOSEN3(value)           (MATRIX_PRAS0_LQOSEN3_Msk & ((value) << MATRIX_PRAS0_LQOSEN3_Pos))
#define MATRIX_PRAS0_M4PR_Pos                 _U_(16)                                              /**< (MATRIX_PRAS0) Master 4 Priority Position */
#define MATRIX_PRAS0_M4PR_Msk                 (_U_(0x3) << MATRIX_PRAS0_M4PR_Pos)                  /**< (MATRIX_PRAS0) Master 4 Priority Mask */
#define MATRIX_PRAS0_M4PR(value)              (MATRIX_PRAS0_M4PR_Msk & ((value) << MATRIX_PRAS0_M4PR_Pos))
#define MATRIX_PRAS0_LQOSEN4_Pos              _U_(18)                                              /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 4 Position */
#define MATRIX_PRAS0_LQOSEN4_Msk              (_U_(0x1) << MATRIX_PRAS0_LQOSEN4_Pos)               /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 4 Mask */
#define MATRIX_PRAS0_LQOSEN4(value)           (MATRIX_PRAS0_LQOSEN4_Msk & ((value) << MATRIX_PRAS0_LQOSEN4_Pos))
#define MATRIX_PRAS0_M5PR_Pos                 _U_(20)                                              /**< (MATRIX_PRAS0) Master 5 Priority Position */
#define MATRIX_PRAS0_M5PR_Msk                 (_U_(0x3) << MATRIX_PRAS0_M5PR_Pos)                  /**< (MATRIX_PRAS0) Master 5 Priority Mask */
#define MATRIX_PRAS0_M5PR(value)              (MATRIX_PRAS0_M5PR_Msk & ((value) << MATRIX_PRAS0_M5PR_Pos))
#define MATRIX_PRAS0_LQOSEN5_Pos              _U_(22)                                              /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 5 Position */
#define MATRIX_PRAS0_LQOSEN5_Msk              (_U_(0x1) << MATRIX_PRAS0_LQOSEN5_Pos)               /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 5 Mask */
#define MATRIX_PRAS0_LQOSEN5(value)           (MATRIX_PRAS0_LQOSEN5_Msk & ((value) << MATRIX_PRAS0_LQOSEN5_Pos))
#define MATRIX_PRAS0_M6PR_Pos                 _U_(24)                                              /**< (MATRIX_PRAS0) Master 6 Priority Position */
#define MATRIX_PRAS0_M6PR_Msk                 (_U_(0x3) << MATRIX_PRAS0_M6PR_Pos)                  /**< (MATRIX_PRAS0) Master 6 Priority Mask */
#define MATRIX_PRAS0_M6PR(value)              (MATRIX_PRAS0_M6PR_Msk & ((value) << MATRIX_PRAS0_M6PR_Pos))
#define MATRIX_PRAS0_LQOSEN6_Pos              _U_(26)                                              /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 6 Position */
#define MATRIX_PRAS0_LQOSEN6_Msk              (_U_(0x1) << MATRIX_PRAS0_LQOSEN6_Pos)               /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 6 Mask */
#define MATRIX_PRAS0_LQOSEN6(value)           (MATRIX_PRAS0_LQOSEN6_Msk & ((value) << MATRIX_PRAS0_LQOSEN6_Pos))
#define MATRIX_PRAS0_M7PR_Pos                 _U_(28)                                              /**< (MATRIX_PRAS0) Master 7 Priority Position */
#define MATRIX_PRAS0_M7PR_Msk                 (_U_(0x3) << MATRIX_PRAS0_M7PR_Pos)                  /**< (MATRIX_PRAS0) Master 7 Priority Mask */
#define MATRIX_PRAS0_M7PR(value)              (MATRIX_PRAS0_M7PR_Msk & ((value) << MATRIX_PRAS0_M7PR_Pos))
#define MATRIX_PRAS0_LQOSEN7_Pos              _U_(30)                                              /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 7 Position */
#define MATRIX_PRAS0_LQOSEN7_Msk              (_U_(0x1) << MATRIX_PRAS0_LQOSEN7_Pos)               /**< (MATRIX_PRAS0) Latency Quality of Service Enable for Master 7 Mask */
#define MATRIX_PRAS0_LQOSEN7(value)           (MATRIX_PRAS0_LQOSEN7_Msk & ((value) << MATRIX_PRAS0_LQOSEN7_Pos))
#define MATRIX_PRAS0_Msk                      _U_(0x77777777)                                      /**< (MATRIX_PRAS0) Register Mask  */


