Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_PRBS8 : (MATRIX Offset: 0xC4) (R/W 32) Priority Register B for Slave 8 -------- */
#define MATRIX_PRBS8_M8PR_Pos                 _U_(0)                                               /**< (MATRIX_PRBS8) Master 8 Priority Position */
#define MATRIX_PRBS8_M8PR_Msk                 (_U_(0x3) << MATRIX_PRBS8_M8PR_Pos)                  /**< (MATRIX_PRBS8) Master 8 Priority Mask */
#define MATRIX_PRBS8_M8PR(value)              (MATRIX_PRBS8_M8PR_Msk & ((value) << MATRIX_PRBS8_M8PR_Pos))
#define MATRIX_PRBS8_LQOSEN8_Pos              _U_(2)                                               /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 8 Position */
#define MATRIX_PRBS8_LQOSEN8_Msk              (_U_(0x1) << MATRIX_PRBS8_LQOSEN8_Pos)               /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 8 Mask */
#define MATRIX_PRBS8_LQOSEN8(value)           (MATRIX_PRBS8_LQOSEN8_Msk & ((value) << MATRIX_PRBS8_LQOSEN8_Pos))
#define MATRIX_PRBS8_M9PR_Pos                 _U_(4)                                               /**< (MATRIX_PRBS8) Master 9 Priority Position */
#define MATRIX_PRBS8_M9PR_Msk                 (_U_(0x3) << MATRIX_PRBS8_M9PR_Pos)                  /**< (MATRIX_PRBS8) Master 9 Priority Mask */
#define MATRIX_PRBS8_M9PR(value)              (MATRIX_PRBS8_M9PR_Msk & ((value) << MATRIX_PRBS8_M9PR_Pos))
#define MATRIX_PRBS8_LQOSEN9_Pos              _U_(6)                                               /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 9 Position */
#define MATRIX_PRBS8_LQOSEN9_Msk              (_U_(0x1) << MATRIX_PRBS8_LQOSEN9_Pos)               /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 9 Mask */
#define MATRIX_PRBS8_LQOSEN9(value)           (MATRIX_PRBS8_LQOSEN9_Msk & ((value) << MATRIX_PRBS8_LQOSEN9_Pos))
#define MATRIX_PRBS8_M10PR_Pos                _U_(8)                                               /**< (MATRIX_PRBS8) Master 10 Priority Position */
#define MATRIX_PRBS8_M10PR_Msk                (_U_(0x3) << MATRIX_PRBS8_M10PR_Pos)                 /**< (MATRIX_PRBS8) Master 10 Priority Mask */
#define MATRIX_PRBS8_M10PR(value)             (MATRIX_PRBS8_M10PR_Msk & ((value) << MATRIX_PRBS8_M10PR_Pos))
#define MATRIX_PRBS8_LQOSEN10_Pos             _U_(10)                                              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 10 Position */
#define MATRIX_PRBS8_LQOSEN10_Msk             (_U_(0x1) << MATRIX_PRBS8_LQOSEN10_Pos)              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 10 Mask */
#define MATRIX_PRBS8_LQOSEN10(value)          (MATRIX_PRBS8_LQOSEN10_Msk & ((value) << MATRIX_PRBS8_LQOSEN10_Pos))
#define MATRIX_PRBS8_M11PR_Pos                _U_(12)                                              /**< (MATRIX_PRBS8) Master 11 Priority Position */
#define MATRIX_PRBS8_M11PR_Msk                (_U_(0x3) << MATRIX_PRBS8_M11PR_Pos)                 /**< (MATRIX_PRBS8) Master 11 Priority Mask */
#define MATRIX_PRBS8_M11PR(value)             (MATRIX_PRBS8_M11PR_Msk & ((value) << MATRIX_PRBS8_M11PR_Pos))
#define MATRIX_PRBS8_LQOSEN11_Pos             _U_(14)                                              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 11 Position */
#define MATRIX_PRBS8_LQOSEN11_Msk             (_U_(0x1) << MATRIX_PRBS8_LQOSEN11_Pos)              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 11 Mask */
#define MATRIX_PRBS8_LQOSEN11(value)          (MATRIX_PRBS8_LQOSEN11_Msk & ((value) << MATRIX_PRBS8_LQOSEN11_Pos))
#define MATRIX_PRBS8_M12PR_Pos                _U_(16)                                              /**< (MATRIX_PRBS8) Master 12 Priority Position */
#define MATRIX_PRBS8_M12PR_Msk                (_U_(0x3) << MATRIX_PRBS8_M12PR_Pos)                 /**< (MATRIX_PRBS8) Master 12 Priority Mask */
#define MATRIX_PRBS8_M12PR(value)             (MATRIX_PRBS8_M12PR_Msk & ((value) << MATRIX_PRBS8_M12PR_Pos))
#define MATRIX_PRBS8_LQOSEN12_Pos             _U_(18)                                              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 12 Position */
#define MATRIX_PRBS8_LQOSEN12_Msk             (_U_(0x1) << MATRIX_PRBS8_LQOSEN12_Pos)              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 12 Mask */
#define MATRIX_PRBS8_LQOSEN12(value)          (MATRIX_PRBS8_LQOSEN12_Msk & ((value) << MATRIX_PRBS8_LQOSEN12_Pos))
#define MATRIX_PRBS8_M13PR_Pos                _U_(20)                                              /**< (MATRIX_PRBS8) Master 13 Priority Position */
#define MATRIX_PRBS8_M13PR_Msk                (_U_(0x3) << MATRIX_PRBS8_M13PR_Pos)                 /**< (MATRIX_PRBS8) Master 13 Priority Mask */
#define MATRIX_PRBS8_M13PR(value)             (MATRIX_PRBS8_M13PR_Msk & ((value) << MATRIX_PRBS8_M13PR_Pos))
#define MATRIX_PRBS8_LQOSEN13_Pos             _U_(22)                                              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 13 Position */
#define MATRIX_PRBS8_LQOSEN13_Msk             (_U_(0x1) << MATRIX_PRBS8_LQOSEN13_Pos)              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 13 Mask */
#define MATRIX_PRBS8_LQOSEN13(value)          (MATRIX_PRBS8_LQOSEN13_Msk & ((value) << MATRIX_PRBS8_LQOSEN13_Pos))
#define MATRIX_PRBS8_M14PR_Pos                _U_(24)                                              /**< (MATRIX_PRBS8) Master 14 Priority Position */
#define MATRIX_PRBS8_M14PR_Msk                (_U_(0x3) << MATRIX_PRBS8_M14PR_Pos)                 /**< (MATRIX_PRBS8) Master 14 Priority Mask */
#define MATRIX_PRBS8_M14PR(value)             (MATRIX_PRBS8_M14PR_Msk & ((value) << MATRIX_PRBS8_M14PR_Pos))
#define MATRIX_PRBS8_LQOSEN14_Pos             _U_(26)                                              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 14 Position */
#define MATRIX_PRBS8_LQOSEN14_Msk             (_U_(0x1) << MATRIX_PRBS8_LQOSEN14_Pos)              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 14 Mask */
#define MATRIX_PRBS8_LQOSEN14(value)          (MATRIX_PRBS8_LQOSEN14_Msk & ((value) << MATRIX_PRBS8_LQOSEN14_Pos))
#define MATRIX_PRBS8_M15PR_Pos                _U_(28)                                              /**< (MATRIX_PRBS8) Master 15 Priority Position */
#define MATRIX_PRBS8_M15PR_Msk                (_U_(0x3) << MATRIX_PRBS8_M15PR_Pos)                 /**< (MATRIX_PRBS8) Master 15 Priority Mask */
#define MATRIX_PRBS8_M15PR(value)             (MATRIX_PRBS8_M15PR_Msk & ((value) << MATRIX_PRBS8_M15PR_Pos))
#define MATRIX_PRBS8_LQOSEN15_Pos             _U_(30)                                              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 15 Position */
#define MATRIX_PRBS8_LQOSEN15_Msk             (_U_(0x1) << MATRIX_PRBS8_LQOSEN15_Pos)              /**< (MATRIX_PRBS8) Latency Quality of Service Enable for Master 15 Mask */
#define MATRIX_PRBS8_LQOSEN15(value)          (MATRIX_PRBS8_LQOSEN15_Msk & ((value) << MATRIX_PRBS8_LQOSEN15_Pos))
#define MATRIX_PRBS8_Msk                      _U_(0x77777777)                                      /**< (MATRIX_PRBS8) Register Mask  */


/* -------- MATRIX_PRAS9 : (MATRIX Offset: 0xC8) (R/W 32) Priority Register A for Slave 9 -------- */
#define MATRIX_PRAS9_M0PR_Pos                 _U_(0)                                               /**< (MATRIX_PRAS9) Master 0 Priority Position */
#define MATRIX_PRAS9_M0PR_Msk                 (_U_(0x3) << MATRIX_PRAS9_M0PR_Pos)                  /**< (MATRIX_PRAS9) Master 0 Priority Mask */
#define MATRIX_PRAS9_M0PR(value)              (MATRIX_PRAS9_M0PR_Msk & ((value) << MATRIX_PRAS9_M0PR_Pos))
#define MATRIX_PRAS9_LQOSEN0_Pos              _U_(2)                                               /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 0 Position */
#define MATRIX_PRAS9_LQOSEN0_Msk              (_U_(0x1) << MATRIX_PRAS9_LQOSEN0_Pos)               /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 0 Mask */
#define MATRIX_PRAS9_LQOSEN0(value)           (MATRIX_PRAS9_LQOSEN0_Msk & ((value) << MATRIX_PRAS9_LQOSEN0_Pos))
#define MATRIX_PRAS9_M1PR_Pos                 _U_(4)                                               /**< (MATRIX_PRAS9) Master 1 Priority Position */
#define MATRIX_PRAS9_M1PR_Msk                 (_U_(0x3) << MATRIX_PRAS9_M1PR_Pos)                  /**< (MATRIX_PRAS9) Master 1 Priority Mask */
#define MATRIX_PRAS9_M1PR(value)              (MATRIX_PRAS9_M1PR_Msk & ((value) << MATRIX_PRAS9_M1PR_Pos))
#define MATRIX_PRAS9_LQOSEN1_Pos              _U_(6)                                               /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 1 Position */
#define MATRIX_PRAS9_LQOSEN1_Msk              (_U_(0x1) << MATRIX_PRAS9_LQOSEN1_Pos)               /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 1 Mask */
#define MATRIX_PRAS9_LQOSEN1(value)           (MATRIX_PRAS9_LQOSEN1_Msk & ((value) << MATRIX_PRAS9_LQOSEN1_Pos))
#define MATRIX_PRAS9_M2PR_Pos                 _U_(8)                                               /**< (MATRIX_PRAS9) Master 2 Priority Position */
#define MATRIX_PRAS9_M2PR_Msk                 (_U_(0x3) << MATRIX_PRAS9_M2PR_Pos)                  /**< (MATRIX_PRAS9) Master 2 Priority Mask */
#define MATRIX_PRAS9_M2PR(value)              (MATRIX_PRAS9_M2PR_Msk & ((value) << MATRIX_PRAS9_M2PR_Pos))
#define MATRIX_PRAS9_LQOSEN2_Pos              _U_(10)                                              /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 2 Position */
#define MATRIX_PRAS9_LQOSEN2_Msk              (_U_(0x1) << MATRIX_PRAS9_LQOSEN2_Pos)               /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 2 Mask */
#define MATRIX_PRAS9_LQOSEN2(value)           (MATRIX_PRAS9_LQOSEN2_Msk & ((value) << MATRIX_PRAS9_LQOSEN2_Pos))
#define MATRIX_PRAS9_M3PR_Pos                 _U_(12)                                              /**< (MATRIX_PRAS9) Master 3 Priority Position */
#define MATRIX_PRAS9_M3PR_Msk                 (_U_(0x3) << MATRIX_PRAS9_M3PR_Pos)                  /**< (MATRIX_PRAS9) Master 3 Priority Mask */
#define MATRIX_PRAS9_M3PR(value)              (MATRIX_PRAS9_M3PR_Msk & ((value) << MATRIX_PRAS9_M3PR_Pos))
#define MATRIX_PRAS9_LQOSEN3_Pos              _U_(14)                                              /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 3 Position */
#define MATRIX_PRAS9_LQOSEN3_Msk              (_U_(0x1) << MATRIX_PRAS9_LQOSEN3_Pos)               /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 3 Mask */
#define MATRIX_PRAS9_LQOSEN3(value)           (MATRIX_PRAS9_LQOSEN3_Msk & ((value) << MATRIX_PRAS9_LQOSEN3_Pos))
#define MATRIX_PRAS9_M4PR_Pos                 _U_(16)                                              /**< (MATRIX_PRAS9) Master 4 Priority Position */
#define MATRIX_PRAS9_M4PR_Msk                 (_U_(0x3) << MATRIX_PRAS9_M4PR_Pos)                  /**< (MATRIX_PRAS9) Master 4 Priority Mask */
#define MATRIX_PRAS9_M4PR(value)              (MATRIX_PRAS9_M4PR_Msk & ((value) << MATRIX_PRAS9_M4PR_Pos))
#define MATRIX_PRAS9_LQOSEN4_Pos              _U_(18)                                              /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 4 Position */
#define MATRIX_PRAS9_LQOSEN4_Msk              (_U_(0x1) << MATRIX_PRAS9_LQOSEN4_Pos)               /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 4 Mask */
#define MATRIX_PRAS9_LQOSEN4(value)           (MATRIX_PRAS9_LQOSEN4_Msk & ((value) << MATRIX_PRAS9_LQOSEN4_Pos))
#define MATRIX_PRAS9_M5PR_Pos                 _U_(20)                                              /**< (MATRIX_PRAS9) Master 5 Priority Position */
#define MATRIX_PRAS9_M5PR_Msk                 (_U_(0x3) << MATRIX_PRAS9_M5PR_Pos)                  /**< (MATRIX_PRAS9) Master 5 Priority Mask */
#define MATRIX_PRAS9_M5PR(value)              (MATRIX_PRAS9_M5PR_Msk & ((value) << MATRIX_PRAS9_M5PR_Pos))
#define MATRIX_PRAS9_LQOSEN5_Pos              _U_(22)                                              /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 5 Position */
#define MATRIX_PRAS9_LQOSEN5_Msk              (_U_(0x1) << MATRIX_PRAS9_LQOSEN5_Pos)               /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 5 Mask */
#define MATRIX_PRAS9_LQOSEN5(value)           (MATRIX_PRAS9_LQOSEN5_Msk & ((value) << MATRIX_PRAS9_LQOSEN5_Pos))
#define MATRIX_PRAS9_M6PR_Pos                 _U_(24)                                              /**< (MATRIX_PRAS9) Master 6 Priority Position */
#define MATRIX_PRAS9_M6PR_Msk                 (_U_(0x3) << MATRIX_PRAS9_M6PR_Pos)                  /**< (MATRIX_PRAS9) Master 6 Priority Mask */
#define MATRIX_PRAS9_M6PR(value)              (MATRIX_PRAS9_M6PR_Msk & ((value) << MATRIX_PRAS9_M6PR_Pos))
#define MATRIX_PRAS9_LQOSEN6_Pos              _U_(26)                                              /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 6 Position */
#define MATRIX_PRAS9_LQOSEN6_Msk              (_U_(0x1) << MATRIX_PRAS9_LQOSEN6_Pos)               /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 6 Mask */
#define MATRIX_PRAS9_LQOSEN6(value)           (MATRIX_PRAS9_LQOSEN6_Msk & ((value) << MATRIX_PRAS9_LQOSEN6_Pos))
#define MATRIX_PRAS9_M7PR_Pos                 _U_(28)                                              /**< (MATRIX_PRAS9) Master 7 Priority Position */
#define MATRIX_PRAS9_M7PR_Msk                 (_U_(0x3) << MATRIX_PRAS9_M7PR_Pos)                  /**< (MATRIX_PRAS9) Master 7 Priority Mask */
#define MATRIX_PRAS9_M7PR(value)              (MATRIX_PRAS9_M7PR_Msk & ((value) << MATRIX_PRAS9_M7PR_Pos))
#define MATRIX_PRAS9_LQOSEN7_Pos              _U_(30)                                              /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 7 Position */
#define MATRIX_PRAS9_LQOSEN7_Msk              (_U_(0x1) << MATRIX_PRAS9_LQOSEN7_Pos)               /**< (MATRIX_PRAS9) Latency Quality of Service Enable for Master 7 Mask */
#define MATRIX_PRAS9_LQOSEN7(value)           (MATRIX_PRAS9_LQOSEN7_Msk & ((value) << MATRIX_PRAS9_LQOSEN7_Pos))
#define MATRIX_PRAS9_Msk                      _U_(0x77777777)                                      /**< (MATRIX_PRAS9) Register Mask  */


/* -------- MATRIX_PRBS9 : (MATRIX Offset: 0xCC) (R/W 32) Priority Register B for Slave 9 -------- */
#define MATRIX_PRBS9_M8PR_Pos                 _U_(0)                                               /**< (MATRIX_PRBS9) Master 8 Priority Position */
#define MATRIX_PRBS9_M8PR_Msk                 (_U_(0x3) << MATRIX_PRBS9_M8PR_Pos)                  /**< (MATRIX_PRBS9) Master 8 Priority Mask */
#define MATRIX_PRBS9_M8PR(value)              (MATRIX_PRBS9_M8PR_Msk & ((value) << MATRIX_PRBS9_M8PR_Pos))
#define MATRIX_PRBS9_LQOSEN8_Pos              _U_(2)                                               /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 8 Position */
#define MATRIX_PRBS9_LQOSEN8_Msk              (_U_(0x1) << MATRIX_PRBS9_LQOSEN8_Pos)               /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 8 Mask */
#define MATRIX_PRBS9_LQOSEN8(value)           (MATRIX_PRBS9_LQOSEN8_Msk & ((value) << MATRIX_PRBS9_LQOSEN8_Pos))
#define MATRIX_PRBS9_M9PR_Pos                 _U_(4)                                               /**< (MATRIX_PRBS9) Master 9 Priority Position */
#define MATRIX_PRBS9_M9PR_Msk                 (_U_(0x3) << MATRIX_PRBS9_M9PR_Pos)                  /**< (MATRIX_PRBS9) Master 9 Priority Mask */
#define MATRIX_PRBS9_M9PR(value)              (MATRIX_PRBS9_M9PR_Msk & ((value) << MATRIX_PRBS9_M9PR_Pos))
#define MATRIX_PRBS9_LQOSEN9_Pos              _U_(6)                                               /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 9 Position */
#define MATRIX_PRBS9_LQOSEN9_Msk              (_U_(0x1) << MATRIX_PRBS9_LQOSEN9_Pos)               /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 9 Mask */
#define MATRIX_PRBS9_LQOSEN9(value)           (MATRIX_PRBS9_LQOSEN9_Msk & ((value) << MATRIX_PRBS9_LQOSEN9_Pos))
#define MATRIX_PRBS9_M10PR_Pos                _U_(8)                                               /**< (MATRIX_PRBS9) Master 10 Priority Position */
#define MATRIX_PRBS9_M10PR_Msk                (_U_(0x3) << MATRIX_PRBS9_M10PR_Pos)                 /**< (MATRIX_PRBS9) Master 10 Priority Mask */
#define MATRIX_PRBS9_M10PR(value)             (MATRIX_PRBS9_M10PR_Msk & ((value) << MATRIX_PRBS9_M10PR_Pos))
#define MATRIX_PRBS9_LQOSEN10_Pos             _U_(10)                                              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 10 Position */
#define MATRIX_PRBS9_LQOSEN10_Msk             (_U_(0x1) << MATRIX_PRBS9_LQOSEN10_Pos)              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 10 Mask */
#define MATRIX_PRBS9_LQOSEN10(value)          (MATRIX_PRBS9_LQOSEN10_Msk & ((value) << MATRIX_PRBS9_LQOSEN10_Pos))
#define MATRIX_PRBS9_M11PR_Pos                _U_(12)                                              /**< (MATRIX_PRBS9) Master 11 Priority Position */
#define MATRIX_PRBS9_M11PR_Msk                (_U_(0x3) << MATRIX_PRBS9_M11PR_Pos)                 /**< (MATRIX_PRBS9) Master 11 Priority Mask */
#define MATRIX_PRBS9_M11PR(value)             (MATRIX_PRBS9_M11PR_Msk & ((value) << MATRIX_PRBS9_M11PR_Pos))
#define MATRIX_PRBS9_LQOSEN11_Pos             _U_(14)                                              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 11 Position */
#define MATRIX_PRBS9_LQOSEN11_Msk             (_U_(0x1) << MATRIX_PRBS9_LQOSEN11_Pos)              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 11 Mask */
#define MATRIX_PRBS9_LQOSEN11(value)          (MATRIX_PRBS9_LQOSEN11_Msk & ((value) << MATRIX_PRBS9_LQOSEN11_Pos))
#define MATRIX_PRBS9_M12PR_Pos                _U_(16)                                              /**< (MATRIX_PRBS9) Master 12 Priority Position */
#define MATRIX_PRBS9_M12PR_Msk                (_U_(0x3) << MATRIX_PRBS9_M12PR_Pos)                 /**< (MATRIX_PRBS9) Master 12 Priority Mask */
#define MATRIX_PRBS9_M12PR(value)             (MATRIX_PRBS9_M12PR_Msk & ((value) << MATRIX_PRBS9_M12PR_Pos))
#define MATRIX_PRBS9_LQOSEN12_Pos             _U_(18)                                              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 12 Position */
#define MATRIX_PRBS9_LQOSEN12_Msk             (_U_(0x1) << MATRIX_PRBS9_LQOSEN12_Pos)              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 12 Mask */
#define MATRIX_PRBS9_LQOSEN12(value)          (MATRIX_PRBS9_LQOSEN12_Msk & ((value) << MATRIX_PRBS9_LQOSEN12_Pos))
#define MATRIX_PRBS9_M13PR_Pos                _U_(20)                                              /**< (MATRIX_PRBS9) Master 13 Priority Position */
#define MATRIX_PRBS9_M13PR_Msk                (_U_(0x3) << MATRIX_PRBS9_M13PR_Pos)                 /**< (MATRIX_PRBS9) Master 13 Priority Mask */
#define MATRIX_PRBS9_M13PR(value)             (MATRIX_PRBS9_M13PR_Msk & ((value) << MATRIX_PRBS9_M13PR_Pos))
#define MATRIX_PRBS9_LQOSEN13_Pos             _U_(22)                                              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 13 Position */
#define MATRIX_PRBS9_LQOSEN13_Msk             (_U_(0x1) << MATRIX_PRBS9_LQOSEN13_Pos)              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 13 Mask */
#define MATRIX_PRBS9_LQOSEN13(value)          (MATRIX_PRBS9_LQOSEN13_Msk & ((value) << MATRIX_PRBS9_LQOSEN13_Pos))
#define MATRIX_PRBS9_M14PR_Pos                _U_(24)                                              /**< (MATRIX_PRBS9) Master 14 Priority Position */
#define MATRIX_PRBS9_M14PR_Msk                (_U_(0x3) << MATRIX_PRBS9_M14PR_Pos)                 /**< (MATRIX_PRBS9) Master 14 Priority Mask */
#define MATRIX_PRBS9_M14PR(value)             (MATRIX_PRBS9_M14PR_Msk & ((value) << MATRIX_PRBS9_M14PR_Pos))
#define MATRIX_PRBS9_LQOSEN14_Pos             _U_(26)                                              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 14 Position */
#define MATRIX_PRBS9_LQOSEN14_Msk             (_U_(0x1) << MATRIX_PRBS9_LQOSEN14_Pos)              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 14 Mask */
#define MATRIX_PRBS9_LQOSEN14(value)          (MATRIX_PRBS9_LQOSEN14_Msk & ((value) << MATRIX_PRBS9_LQOSEN14_Pos))
#define MATRIX_PRBS9_M15PR_Pos                _U_(28)                                              /**< (MATRIX_PRBS9) Master 15 Priority Position */
#define MATRIX_PRBS9_M15PR_Msk                (_U_(0x3) << MATRIX_PRBS9_M15PR_Pos)                 /**< (MATRIX_PRBS9) Master 15 Priority Mask */
#define MATRIX_PRBS9_M15PR(value)             (MATRIX_PRBS9_M15PR_Msk & ((value) << MATRIX_PRBS9_M15PR_Pos))
#define MATRIX_PRBS9_LQOSEN15_Pos             _U_(30)                                              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 15 Position */
#define MATRIX_PRBS9_LQOSEN15_Msk             (_U_(0x1) << MATRIX_PRBS9_LQOSEN15_Pos)              /**< (MATRIX_PRBS9) Latency Quality of Service Enable for Master 15 Mask */
#define MATRIX_PRBS9_LQOSEN15(value)          (MATRIX_PRBS9_LQOSEN15_Msk & ((value) << MATRIX_PRBS9_LQOSEN15_Pos))
#define MATRIX_PRBS9_Msk                      _U_(0x77777777)                                      /**< (MATRIX_PRBS9) Register Mask  */


