Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_PRBS15 : (MATRIX Offset: 0xFC) (R/W 32) Priority Register B for Slave 15 -------- */
#define MATRIX_PRBS15_M8PR_Pos                _U_(0)                                               /**< (MATRIX_PRBS15) Master 8 Priority Position */
#define MATRIX_PRBS15_M8PR_Msk                (_U_(0x3) << MATRIX_PRBS15_M8PR_Pos)                 /**< (MATRIX_PRBS15) Master 8 Priority Mask */
#define MATRIX_PRBS15_M8PR(value)             (MATRIX_PRBS15_M8PR_Msk & ((value) << MATRIX_PRBS15_M8PR_Pos))
#define MATRIX_PRBS15_LQOSEN8_Pos             _U_(2)                                               /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 8 Position */
#define MATRIX_PRBS15_LQOSEN8_Msk             (_U_(0x1) << MATRIX_PRBS15_LQOSEN8_Pos)              /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 8 Mask */
#define MATRIX_PRBS15_LQOSEN8(value)          (MATRIX_PRBS15_LQOSEN8_Msk & ((value) << MATRIX_PRBS15_LQOSEN8_Pos))
#define MATRIX_PRBS15_M9PR_Pos                _U_(4)                                               /**< (MATRIX_PRBS15) Master 9 Priority Position */
#define MATRIX_PRBS15_M9PR_Msk                (_U_(0x3) << MATRIX_PRBS15_M9PR_Pos)                 /**< (MATRIX_PRBS15) Master 9 Priority Mask */
#define MATRIX_PRBS15_M9PR(value)             (MATRIX_PRBS15_M9PR_Msk & ((value) << MATRIX_PRBS15_M9PR_Pos))
#define MATRIX_PRBS15_LQOSEN9_Pos             _U_(6)                                               /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 9 Position */
#define MATRIX_PRBS15_LQOSEN9_Msk             (_U_(0x1) << MATRIX_PRBS15_LQOSEN9_Pos)              /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 9 Mask */
#define MATRIX_PRBS15_LQOSEN9(value)          (MATRIX_PRBS15_LQOSEN9_Msk & ((value) << MATRIX_PRBS15_LQOSEN9_Pos))
#define MATRIX_PRBS15_M10PR_Pos               _U_(8)                                               /**< (MATRIX_PRBS15) Master 10 Priority Position */
#define MATRIX_PRBS15_M10PR_Msk               (_U_(0x3) << MATRIX_PRBS15_M10PR_Pos)                /**< (MATRIX_PRBS15) Master 10 Priority Mask */
#define MATRIX_PRBS15_M10PR(value)            (MATRIX_PRBS15_M10PR_Msk & ((value) << MATRIX_PRBS15_M10PR_Pos))
#define MATRIX_PRBS15_LQOSEN10_Pos            _U_(10)                                              /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 10 Position */
#define MATRIX_PRBS15_LQOSEN10_Msk            (_U_(0x1) << MATRIX_PRBS15_LQOSEN10_Pos)             /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 10 Mask */
#define MATRIX_PRBS15_LQOSEN10(value)         (MATRIX_PRBS15_LQOSEN10_Msk & ((value) << MATRIX_PRBS15_LQOSEN10_Pos))
#define MATRIX_PRBS15_M11PR_Pos               _U_(12)                                              /**< (MATRIX_PRBS15) Master 11 Priority Position */
#define MATRIX_PRBS15_M11PR_Msk               (_U_(0x3) << MATRIX_PRBS15_M11PR_Pos)                /**< (MATRIX_PRBS15) Master 11 Priority Mask */
#define MATRIX_PRBS15_M11PR(value)            (MATRIX_PRBS15_M11PR_Msk & ((value) << MATRIX_PRBS15_M11PR_Pos))
#define MATRIX_PRBS15_LQOSEN11_Pos            _U_(14)                                              /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 11 Position */
#define MATRIX_PRBS15_LQOSEN11_Msk            (_U_(0x1) << MATRIX_PRBS15_LQOSEN11_Pos)             /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 11 Mask */
#define MATRIX_PRBS15_LQOSEN11(value)         (MATRIX_PRBS15_LQOSEN11_Msk & ((value) << MATRIX_PRBS15_LQOSEN11_Pos))
#define MATRIX_PRBS15_M12PR_Pos               _U_(16)                                              /**< (MATRIX_PRBS15) Master 12 Priority Position */
#define MATRIX_PRBS15_M12PR_Msk               (_U_(0x3) << MATRIX_PRBS15_M12PR_Pos)                /**< (MATRIX_PRBS15) Master 12 Priority Mask */
#define MATRIX_PRBS15_M12PR(value)            (MATRIX_PRBS15_M12PR_Msk & ((value) << MATRIX_PRBS15_M12PR_Pos))
#define MATRIX_PRBS15_LQOSEN12_Pos            _U_(18)                                              /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 12 Position */
#define MATRIX_PRBS15_LQOSEN12_Msk            (_U_(0x1) << MATRIX_PRBS15_LQOSEN12_Pos)             /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 12 Mask */
#define MATRIX_PRBS15_LQOSEN12(value)         (MATRIX_PRBS15_LQOSEN12_Msk & ((value) << MATRIX_PRBS15_LQOSEN12_Pos))
#define MATRIX_PRBS15_M13PR_Pos               _U_(20)                                              /**< (MATRIX_PRBS15) Master 13 Priority Position */
#define MATRIX_PRBS15_M13PR_Msk               (_U_(0x3) << MATRIX_PRBS15_M13PR_Pos)                /**< (MATRIX_PRBS15) Master 13 Priority Mask */
#define MATRIX_PRBS15_M13PR(value)            (MATRIX_PRBS15_M13PR_Msk & ((value) << MATRIX_PRBS15_M13PR_Pos))
#define MATRIX_PRBS15_LQOSEN13_Pos            _U_(22)                                              /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 13 Position */
#define MATRIX_PRBS15_LQOSEN13_Msk            (_U_(0x1) << MATRIX_PRBS15_LQOSEN13_Pos)             /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 13 Mask */
#define MATRIX_PRBS15_LQOSEN13(value)         (MATRIX_PRBS15_LQOSEN13_Msk & ((value) << MATRIX_PRBS15_LQOSEN13_Pos))
#define MATRIX_PRBS15_M14PR_Pos               _U_(24)                                              /**< (MATRIX_PRBS15) Master 14 Priority Position */
#define MATRIX_PRBS15_M14PR_Msk               (_U_(0x3) << MATRIX_PRBS15_M14PR_Pos)                /**< (MATRIX_PRBS15) Master 14 Priority Mask */
#define MATRIX_PRBS15_M14PR(value)            (MATRIX_PRBS15_M14PR_Msk & ((value) << MATRIX_PRBS15_M14PR_Pos))
#define MATRIX_PRBS15_LQOSEN14_Pos            _U_(26)                                              /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 14 Position */
#define MATRIX_PRBS15_LQOSEN14_Msk            (_U_(0x1) << MATRIX_PRBS15_LQOSEN14_Pos)             /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 14 Mask */
#define MATRIX_PRBS15_LQOSEN14(value)         (MATRIX_PRBS15_LQOSEN14_Msk & ((value) << MATRIX_PRBS15_LQOSEN14_Pos))
#define MATRIX_PRBS15_M15PR_Pos               _U_(28)                                              /**< (MATRIX_PRBS15) Master 15 Priority Position */
#define MATRIX_PRBS15_M15PR_Msk               (_U_(0x3) << MATRIX_PRBS15_M15PR_Pos)                /**< (MATRIX_PRBS15) Master 15 Priority Mask */
#define MATRIX_PRBS15_M15PR(value)            (MATRIX_PRBS15_M15PR_Msk & ((value) << MATRIX_PRBS15_M15PR_Pos))
#define MATRIX_PRBS15_LQOSEN15_Pos            _U_(30)                                              /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 15 Position */
#define MATRIX_PRBS15_LQOSEN15_Msk            (_U_(0x1) << MATRIX_PRBS15_LQOSEN15_Pos)             /**< (MATRIX_PRBS15) Latency Quality of Service Enable for Master 15 Mask */
#define MATRIX_PRBS15_LQOSEN15(value)         (MATRIX_PRBS15_LQOSEN15_Msk & ((value) << MATRIX_PRBS15_LQOSEN15_Pos))
#define MATRIX_PRBS15_Msk                     _U_(0x77777777)                                      /**< (MATRIX_PRBS15) Register Mask  */


/* -------- MATRIX_MRCR : (MATRIX Offset: 0x100) (R/W 32) Master Remap Control Register -------- */
#define MATRIX_MRCR_RCB0_Pos                  _U_(0)                                               /**< (MATRIX_MRCR) Remap Command Bit for Master 0 Position */
#define MATRIX_MRCR_RCB0_Msk                  (_U_(0x1) << MATRIX_MRCR_RCB0_Pos)                   /**< (MATRIX_MRCR) Remap Command Bit for Master 0 Mask */
#define MATRIX_MRCR_RCB0(value)               (MATRIX_MRCR_RCB0_Msk & ((value) << MATRIX_MRCR_RCB0_Pos))
#define MATRIX_MRCR_RCB1_Pos                  _U_(1)                                               /**< (MATRIX_MRCR) Remap Command Bit for Master 1 Position */
#define MATRIX_MRCR_RCB1_Msk                  (_U_(0x1) << MATRIX_MRCR_RCB1_Pos)                   /**< (MATRIX_MRCR) Remap Command Bit for Master 1 Mask */
#define MATRIX_MRCR_RCB1(value)               (MATRIX_MRCR_RCB1_Msk & ((value) << MATRIX_MRCR_RCB1_Pos))
#define MATRIX_MRCR_RCB2_Pos                  _U_(2)                                               /**< (MATRIX_MRCR) Remap Command Bit for Master 2 Position */
#define MATRIX_MRCR_RCB2_Msk                  (_U_(0x1) << MATRIX_MRCR_RCB2_Pos)                   /**< (MATRIX_MRCR) Remap Command Bit for Master 2 Mask */
#define MATRIX_MRCR_RCB2(value)               (MATRIX_MRCR_RCB2_Msk & ((value) << MATRIX_MRCR_RCB2_Pos))
#define MATRIX_MRCR_RCB3_Pos                  _U_(3)                                               /**< (MATRIX_MRCR) Remap Command Bit for Master 3 Position */
#define MATRIX_MRCR_RCB3_Msk                  (_U_(0x1) << MATRIX_MRCR_RCB3_Pos)                   /**< (MATRIX_MRCR) Remap Command Bit for Master 3 Mask */
#define MATRIX_MRCR_RCB3(value)               (MATRIX_MRCR_RCB3_Msk & ((value) << MATRIX_MRCR_RCB3_Pos))
#define MATRIX_MRCR_RCB4_Pos                  _U_(4)                                               /**< (MATRIX_MRCR) Remap Command Bit for Master 4 Position */
#define MATRIX_MRCR_RCB4_Msk                  (_U_(0x1) << MATRIX_MRCR_RCB4_Pos)                   /**< (MATRIX_MRCR) Remap Command Bit for Master 4 Mask */
#define MATRIX_MRCR_RCB4(value)               (MATRIX_MRCR_RCB4_Msk & ((value) << MATRIX_MRCR_RCB4_Pos))
#define MATRIX_MRCR_RCB5_Pos                  _U_(5)                                               /**< (MATRIX_MRCR) Remap Command Bit for Master 5 Position */
#define MATRIX_MRCR_RCB5_Msk                  (_U_(0x1) << MATRIX_MRCR_RCB5_Pos)                   /**< (MATRIX_MRCR) Remap Command Bit for Master 5 Mask */
#define MATRIX_MRCR_RCB5(value)               (MATRIX_MRCR_RCB5_Msk & ((value) << MATRIX_MRCR_RCB5_Pos))
#define MATRIX_MRCR_RCB6_Pos                  _U_(6)                                               /**< (MATRIX_MRCR) Remap Command Bit for Master 6 Position */
#define MATRIX_MRCR_RCB6_Msk                  (_U_(0x1) << MATRIX_MRCR_RCB6_Pos)                   /**< (MATRIX_MRCR) Remap Command Bit for Master 6 Mask */
#define MATRIX_MRCR_RCB6(value)               (MATRIX_MRCR_RCB6_Msk & ((value) << MATRIX_MRCR_RCB6_Pos))
#define MATRIX_MRCR_RCB7_Pos                  _U_(7)                                               /**< (MATRIX_MRCR) Remap Command Bit for Master 7 Position */
#define MATRIX_MRCR_RCB7_Msk                  (_U_(0x1) << MATRIX_MRCR_RCB7_Pos)                   /**< (MATRIX_MRCR) Remap Command Bit for Master 7 Mask */
#define MATRIX_MRCR_RCB7(value)               (MATRIX_MRCR_RCB7_Msk & ((value) << MATRIX_MRCR_RCB7_Pos))
#define MATRIX_MRCR_RCB8_Pos                  _U_(8)                                               /**< (MATRIX_MRCR) Remap Command Bit for Master 8 Position */
#define MATRIX_MRCR_RCB8_Msk                  (_U_(0x1) << MATRIX_MRCR_RCB8_Pos)                   /**< (MATRIX_MRCR) Remap Command Bit for Master 8 Mask */
#define MATRIX_MRCR_RCB8(value)               (MATRIX_MRCR_RCB8_Msk & ((value) << MATRIX_MRCR_RCB8_Pos))
#define MATRIX_MRCR_RCB9_Pos                  _U_(9)                                               /**< (MATRIX_MRCR) Remap Command Bit for Master 9 Position */
#define MATRIX_MRCR_RCB9_Msk                  (_U_(0x1) << MATRIX_MRCR_RCB9_Pos)                   /**< (MATRIX_MRCR) Remap Command Bit for Master 9 Mask */
#define MATRIX_MRCR_RCB9(value)               (MATRIX_MRCR_RCB9_Msk & ((value) << MATRIX_MRCR_RCB9_Pos))
#define MATRIX_MRCR_RCB10_Pos                 _U_(10)                                              /**< (MATRIX_MRCR) Remap Command Bit for Master 10 Position */
#define MATRIX_MRCR_RCB10_Msk                 (_U_(0x1) << MATRIX_MRCR_RCB10_Pos)                  /**< (MATRIX_MRCR) Remap Command Bit for Master 10 Mask */
#define MATRIX_MRCR_RCB10(value)              (MATRIX_MRCR_RCB10_Msk & ((value) << MATRIX_MRCR_RCB10_Pos))
#define MATRIX_MRCR_RCB11_Pos                 _U_(11)                                              /**< (MATRIX_MRCR) Remap Command Bit for Master 11 Position */
#define MATRIX_MRCR_RCB11_Msk                 (_U_(0x1) << MATRIX_MRCR_RCB11_Pos)                  /**< (MATRIX_MRCR) Remap Command Bit for Master 11 Mask */
#define MATRIX_MRCR_RCB11(value)              (MATRIX_MRCR_RCB11_Msk & ((value) << MATRIX_MRCR_RCB11_Pos))
#define MATRIX_MRCR_RCB12_Pos                 _U_(12)                                              /**< (MATRIX_MRCR) Remap Command Bit for Master 12 Position */
#define MATRIX_MRCR_RCB12_Msk                 (_U_(0x1) << MATRIX_MRCR_RCB12_Pos)                  /**< (MATRIX_MRCR) Remap Command Bit for Master 12 Mask */
#define MATRIX_MRCR_RCB12(value)              (MATRIX_MRCR_RCB12_Msk & ((value) << MATRIX_MRCR_RCB12_Pos))
#define MATRIX_MRCR_RCB13_Pos                 _U_(13)                                              /**< (MATRIX_MRCR) Remap Command Bit for Master 13 Position */
#define MATRIX_MRCR_RCB13_Msk                 (_U_(0x1) << MATRIX_MRCR_RCB13_Pos)                  /**< (MATRIX_MRCR) Remap Command Bit for Master 13 Mask */
#define MATRIX_MRCR_RCB13(value)              (MATRIX_MRCR_RCB13_Msk & ((value) << MATRIX_MRCR_RCB13_Pos))
#define MATRIX_MRCR_RCB14_Pos                 _U_(14)                                              /**< (MATRIX_MRCR) Remap Command Bit for Master 14 Position */
#define MATRIX_MRCR_RCB14_Msk                 (_U_(0x1) << MATRIX_MRCR_RCB14_Pos)                  /**< (MATRIX_MRCR) Remap Command Bit for Master 14 Mask */
#define MATRIX_MRCR_RCB14(value)              (MATRIX_MRCR_RCB14_Msk & ((value) << MATRIX_MRCR_RCB14_Pos))
#define MATRIX_MRCR_RCB15_Pos                 _U_(15)                                              /**< (MATRIX_MRCR) Remap Command Bit for Master 15 Position */
#define MATRIX_MRCR_RCB15_Msk                 (_U_(0x1) << MATRIX_MRCR_RCB15_Pos)                  /**< (MATRIX_MRCR) Remap Command Bit for Master 15 Mask */
#define MATRIX_MRCR_RCB15(value)              (MATRIX_MRCR_RCB15_Msk & ((value) << MATRIX_MRCR_RCB15_Pos))
#define MATRIX_MRCR_Msk                       _U_(0x0000FFFF)                                      /**< (MATRIX_MRCR) Register Mask  */

