Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
#define MATRIX_MRCR_RCB_Pos                   _U_(0)                                               /**< (MATRIX_MRCR Position) Remap Command Bit for Master x5 */
#define MATRIX_MRCR_RCB_Msk                   (_U_(0xFFFF) << MATRIX_MRCR_RCB_Pos)                 /**< (MATRIX_MRCR Mask) RCB */
#define MATRIX_MRCR_RCB(value)                (MATRIX_MRCR_RCB_Msk & ((value) << MATRIX_MRCR_RCB_Pos)) 

/* -------- MATRIX_SFR0 : (MATRIX Offset: 0x110) (R/W 32) Special Function Register 0 -------- */
#define MATRIX_SFR0_SFR_Pos                   _U_(0)                                               /**< (MATRIX_SFR0) Special Function Register Fields Position */
#define MATRIX_SFR0_SFR_Msk                   (_U_(0xFFFFFFFF) << MATRIX_SFR0_SFR_Pos)             /**< (MATRIX_SFR0) Special Function Register Fields Mask */
#define MATRIX_SFR0_SFR(value)                (MATRIX_SFR0_SFR_Msk & ((value) << MATRIX_SFR0_SFR_Pos))
#define MATRIX_SFR0_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR0) Register Mask  */


/* -------- MATRIX_SFR1 : (MATRIX Offset: 0x114) (R/W 32) Special Function Register 1 -------- */
#define MATRIX_SFR1_SFR_Pos                   _U_(0)                                               /**< (MATRIX_SFR1) Special Function Register Fields Position */
#define MATRIX_SFR1_SFR_Msk                   (_U_(0xFFFFFFFF) << MATRIX_SFR1_SFR_Pos)             /**< (MATRIX_SFR1) Special Function Register Fields Mask */
#define MATRIX_SFR1_SFR(value)                (MATRIX_SFR1_SFR_Msk & ((value) << MATRIX_SFR1_SFR_Pos))
#define MATRIX_SFR1_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR1) Register Mask  */


/* -------- MATRIX_SFR2 : (MATRIX Offset: 0x118) (R/W 32) Special Function Register 2 -------- */
#define MATRIX_SFR2_SFR_Pos                   _U_(0)                                               /**< (MATRIX_SFR2) Special Function Register Fields Position */
#define MATRIX_SFR2_SFR_Msk                   (_U_(0xFFFFFFFF) << MATRIX_SFR2_SFR_Pos)             /**< (MATRIX_SFR2) Special Function Register Fields Mask */
#define MATRIX_SFR2_SFR(value)                (MATRIX_SFR2_SFR_Msk & ((value) << MATRIX_SFR2_SFR_Pos))
#define MATRIX_SFR2_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR2) Register Mask  */


/* -------- MATRIX_SFR3 : (MATRIX Offset: 0x11C) (R/W 32) Special Function Register 3 -------- */
#define MATRIX_SFR3_SFR_Pos                   _U_(0)                                               /**< (MATRIX_SFR3) Special Function Register Fields Position */
#define MATRIX_SFR3_SFR_Msk                   (_U_(0xFFFFFFFF) << MATRIX_SFR3_SFR_Pos)             /**< (MATRIX_SFR3) Special Function Register Fields Mask */
#define MATRIX_SFR3_SFR(value)                (MATRIX_SFR3_SFR_Msk & ((value) << MATRIX_SFR3_SFR_Pos))
#define MATRIX_SFR3_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR3) Register Mask  */


/* -------- MATRIX_SFR4 : (MATRIX Offset: 0x120) (R/W 32) Special Function Register 4 -------- */
#define MATRIX_SFR4_SFR_Pos                   _U_(0)                                               /**< (MATRIX_SFR4) Special Function Register Fields Position */
#define MATRIX_SFR4_SFR_Msk                   (_U_(0xFFFFFFFF) << MATRIX_SFR4_SFR_Pos)             /**< (MATRIX_SFR4) Special Function Register Fields Mask */
#define MATRIX_SFR4_SFR(value)                (MATRIX_SFR4_SFR_Msk & ((value) << MATRIX_SFR4_SFR_Pos))
#define MATRIX_SFR4_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR4) Register Mask  */


/* -------- MATRIX_SFR5 : (MATRIX Offset: 0x124) (R/W 32) Special Function Register 5 -------- */
#define MATRIX_SFR5_SFR_Pos                   _U_(0)                                               /**< (MATRIX_SFR5) Special Function Register Fields Position */
#define MATRIX_SFR5_SFR_Msk                   (_U_(0xFFFFFFFF) << MATRIX_SFR5_SFR_Pos)             /**< (MATRIX_SFR5) Special Function Register Fields Mask */
#define MATRIX_SFR5_SFR(value)                (MATRIX_SFR5_SFR_Msk & ((value) << MATRIX_SFR5_SFR_Pos))
#define MATRIX_SFR5_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR5) Register Mask  */


/* -------- MATRIX_SFR6 : (MATRIX Offset: 0x128) (R/W 32) Special Function Register 6 -------- */
#define MATRIX_SFR6_SFR_Pos                   _U_(0)                                               /**< (MATRIX_SFR6) Special Function Register Fields Position */
#define MATRIX_SFR6_SFR_Msk                   (_U_(0xFFFFFFFF) << MATRIX_SFR6_SFR_Pos)             /**< (MATRIX_SFR6) Special Function Register Fields Mask */
#define MATRIX_SFR6_SFR(value)                (MATRIX_SFR6_SFR_Msk & ((value) << MATRIX_SFR6_SFR_Pos))
#define MATRIX_SFR6_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR6) Register Mask  */


/* -------- MATRIX_SFR7 : (MATRIX Offset: 0x12C) (R/W 32) Special Function Register 7 -------- */
#define MATRIX_SFR7_SFR_Pos                   _U_(0)                                               /**< (MATRIX_SFR7) Special Function Register Fields Position */
#define MATRIX_SFR7_SFR_Msk                   (_U_(0xFFFFFFFF) << MATRIX_SFR7_SFR_Pos)             /**< (MATRIX_SFR7) Special Function Register Fields Mask */
#define MATRIX_SFR7_SFR(value)                (MATRIX_SFR7_SFR_Msk & ((value) << MATRIX_SFR7_SFR_Pos))
#define MATRIX_SFR7_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR7) Register Mask  */


/* -------- MATRIX_SFR8 : (MATRIX Offset: 0x130) (R/W 32) Special Function Register 8 -------- */
#define MATRIX_SFR8_SFR_Pos                   _U_(0)                                               /**< (MATRIX_SFR8) Special Function Register Fields Position */
#define MATRIX_SFR8_SFR_Msk                   (_U_(0xFFFFFFFF) << MATRIX_SFR8_SFR_Pos)             /**< (MATRIX_SFR8) Special Function Register Fields Mask */
#define MATRIX_SFR8_SFR(value)                (MATRIX_SFR8_SFR_Msk & ((value) << MATRIX_SFR8_SFR_Pos))
#define MATRIX_SFR8_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR8) Register Mask  */


/* -------- MATRIX_SFR9 : (MATRIX Offset: 0x134) (R/W 32) Special Function Register 9 -------- */
#define MATRIX_SFR9_SFR_Pos                   _U_(0)                                               /**< (MATRIX_SFR9) Special Function Register Fields Position */
#define MATRIX_SFR9_SFR_Msk                   (_U_(0xFFFFFFFF) << MATRIX_SFR9_SFR_Pos)             /**< (MATRIX_SFR9) Special Function Register Fields Mask */
#define MATRIX_SFR9_SFR(value)                (MATRIX_SFR9_SFR_Msk & ((value) << MATRIX_SFR9_SFR_Pos))
#define MATRIX_SFR9_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR9) Register Mask  */


