Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_SFR10 : (MATRIX Offset: 0x138) (R/W 32) Special Function Register 10 -------- */
#define MATRIX_SFR10_SFR_Pos                  _U_(0)                                               /**< (MATRIX_SFR10) Special Function Register Fields Position */
#define MATRIX_SFR10_SFR_Msk                  (_U_(0xFFFFFFFF) << MATRIX_SFR10_SFR_Pos)            /**< (MATRIX_SFR10) Special Function Register Fields Mask */
#define MATRIX_SFR10_SFR(value)               (MATRIX_SFR10_SFR_Msk & ((value) << MATRIX_SFR10_SFR_Pos))
#define MATRIX_SFR10_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR10) Register Mask  */


/* -------- MATRIX_SFR11 : (MATRIX Offset: 0x13C) (R/W 32) Special Function Register 11 -------- */
#define MATRIX_SFR11_SFR_Pos                  _U_(0)                                               /**< (MATRIX_SFR11) Special Function Register Fields Position */
#define MATRIX_SFR11_SFR_Msk                  (_U_(0xFFFFFFFF) << MATRIX_SFR11_SFR_Pos)            /**< (MATRIX_SFR11) Special Function Register Fields Mask */
#define MATRIX_SFR11_SFR(value)               (MATRIX_SFR11_SFR_Msk & ((value) << MATRIX_SFR11_SFR_Pos))
#define MATRIX_SFR11_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR11) Register Mask  */


/* -------- MATRIX_SFR12 : (MATRIX Offset: 0x140) (R/W 32) Special Function Register 12 -------- */
#define MATRIX_SFR12_SFR_Pos                  _U_(0)                                               /**< (MATRIX_SFR12) Special Function Register Fields Position */
#define MATRIX_SFR12_SFR_Msk                  (_U_(0xFFFFFFFF) << MATRIX_SFR12_SFR_Pos)            /**< (MATRIX_SFR12) Special Function Register Fields Mask */
#define MATRIX_SFR12_SFR(value)               (MATRIX_SFR12_SFR_Msk & ((value) << MATRIX_SFR12_SFR_Pos))
#define MATRIX_SFR12_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR12) Register Mask  */


/* -------- MATRIX_SFR13 : (MATRIX Offset: 0x144) (R/W 32) Special Function Register 13 -------- */
#define MATRIX_SFR13_SFR_Pos                  _U_(0)                                               /**< (MATRIX_SFR13) Special Function Register Fields Position */
#define MATRIX_SFR13_SFR_Msk                  (_U_(0xFFFFFFFF) << MATRIX_SFR13_SFR_Pos)            /**< (MATRIX_SFR13) Special Function Register Fields Mask */
#define MATRIX_SFR13_SFR(value)               (MATRIX_SFR13_SFR_Msk & ((value) << MATRIX_SFR13_SFR_Pos))
#define MATRIX_SFR13_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR13) Register Mask  */


/* -------- MATRIX_SFR14 : (MATRIX Offset: 0x148) (R/W 32) Special Function Register 14 -------- */
#define MATRIX_SFR14_SFR_Pos                  _U_(0)                                               /**< (MATRIX_SFR14) Special Function Register Fields Position */
#define MATRIX_SFR14_SFR_Msk                  (_U_(0xFFFFFFFF) << MATRIX_SFR14_SFR_Pos)            /**< (MATRIX_SFR14) Special Function Register Fields Mask */
#define MATRIX_SFR14_SFR(value)               (MATRIX_SFR14_SFR_Msk & ((value) << MATRIX_SFR14_SFR_Pos))
#define MATRIX_SFR14_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR14) Register Mask  */


/* -------- MATRIX_SFR15 : (MATRIX Offset: 0x14C) (R/W 32) Special Function Register 15 -------- */
#define MATRIX_SFR15_SFR_Pos                  _U_(0)                                               /**< (MATRIX_SFR15) Special Function Register Fields Position */
#define MATRIX_SFR15_SFR_Msk                  (_U_(0xFFFFFFFF) << MATRIX_SFR15_SFR_Pos)            /**< (MATRIX_SFR15) Special Function Register Fields Mask */
#define MATRIX_SFR15_SFR(value)               (MATRIX_SFR15_SFR_Msk & ((value) << MATRIX_SFR15_SFR_Pos))
#define MATRIX_SFR15_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_SFR15) Register Mask  */


/* -------- MATRIX_MEIER : (MATRIX Offset: 0x150) ( /W 32) Master Error Interrupt Enable Register -------- */
#define MATRIX_MEIER_MERR0_Pos                _U_(0)                                               /**< (MATRIX_MEIER) Master 0 Access Error Position */
#define MATRIX_MEIER_MERR0_Msk                (_U_(0x1) << MATRIX_MEIER_MERR0_Pos)                 /**< (MATRIX_MEIER) Master 0 Access Error Mask */
#define MATRIX_MEIER_MERR0(value)             (MATRIX_MEIER_MERR0_Msk & ((value) << MATRIX_MEIER_MERR0_Pos))
#define MATRIX_MEIER_MERR1_Pos                _U_(1)                                               /**< (MATRIX_MEIER) Master 1 Access Error Position */
#define MATRIX_MEIER_MERR1_Msk                (_U_(0x1) << MATRIX_MEIER_MERR1_Pos)                 /**< (MATRIX_MEIER) Master 1 Access Error Mask */
#define MATRIX_MEIER_MERR1(value)             (MATRIX_MEIER_MERR1_Msk & ((value) << MATRIX_MEIER_MERR1_Pos))
#define MATRIX_MEIER_MERR2_Pos                _U_(2)                                               /**< (MATRIX_MEIER) Master 2 Access Error Position */
#define MATRIX_MEIER_MERR2_Msk                (_U_(0x1) << MATRIX_MEIER_MERR2_Pos)                 /**< (MATRIX_MEIER) Master 2 Access Error Mask */
#define MATRIX_MEIER_MERR2(value)             (MATRIX_MEIER_MERR2_Msk & ((value) << MATRIX_MEIER_MERR2_Pos))
#define MATRIX_MEIER_MERR3_Pos                _U_(3)                                               /**< (MATRIX_MEIER) Master 3 Access Error Position */
#define MATRIX_MEIER_MERR3_Msk                (_U_(0x1) << MATRIX_MEIER_MERR3_Pos)                 /**< (MATRIX_MEIER) Master 3 Access Error Mask */
#define MATRIX_MEIER_MERR3(value)             (MATRIX_MEIER_MERR3_Msk & ((value) << MATRIX_MEIER_MERR3_Pos))
#define MATRIX_MEIER_MERR4_Pos                _U_(4)                                               /**< (MATRIX_MEIER) Master 4 Access Error Position */
#define MATRIX_MEIER_MERR4_Msk                (_U_(0x1) << MATRIX_MEIER_MERR4_Pos)                 /**< (MATRIX_MEIER) Master 4 Access Error Mask */
#define MATRIX_MEIER_MERR4(value)             (MATRIX_MEIER_MERR4_Msk & ((value) << MATRIX_MEIER_MERR4_Pos))
#define MATRIX_MEIER_MERR5_Pos                _U_(5)                                               /**< (MATRIX_MEIER) Master 5 Access Error Position */
#define MATRIX_MEIER_MERR5_Msk                (_U_(0x1) << MATRIX_MEIER_MERR5_Pos)                 /**< (MATRIX_MEIER) Master 5 Access Error Mask */
#define MATRIX_MEIER_MERR5(value)             (MATRIX_MEIER_MERR5_Msk & ((value) << MATRIX_MEIER_MERR5_Pos))
#define MATRIX_MEIER_MERR6_Pos                _U_(6)                                               /**< (MATRIX_MEIER) Master 6 Access Error Position */
#define MATRIX_MEIER_MERR6_Msk                (_U_(0x1) << MATRIX_MEIER_MERR6_Pos)                 /**< (MATRIX_MEIER) Master 6 Access Error Mask */
#define MATRIX_MEIER_MERR6(value)             (MATRIX_MEIER_MERR6_Msk & ((value) << MATRIX_MEIER_MERR6_Pos))
#define MATRIX_MEIER_MERR7_Pos                _U_(7)                                               /**< (MATRIX_MEIER) Master 7 Access Error Position */
#define MATRIX_MEIER_MERR7_Msk                (_U_(0x1) << MATRIX_MEIER_MERR7_Pos)                 /**< (MATRIX_MEIER) Master 7 Access Error Mask */
#define MATRIX_MEIER_MERR7(value)             (MATRIX_MEIER_MERR7_Msk & ((value) << MATRIX_MEIER_MERR7_Pos))
#define MATRIX_MEIER_MERR8_Pos                _U_(8)                                               /**< (MATRIX_MEIER) Master 8 Access Error Position */
#define MATRIX_MEIER_MERR8_Msk                (_U_(0x1) << MATRIX_MEIER_MERR8_Pos)                 /**< (MATRIX_MEIER) Master 8 Access Error Mask */
#define MATRIX_MEIER_MERR8(value)             (MATRIX_MEIER_MERR8_Msk & ((value) << MATRIX_MEIER_MERR8_Pos))
#define MATRIX_MEIER_MERR9_Pos                _U_(9)                                               /**< (MATRIX_MEIER) Master 9 Access Error Position */
#define MATRIX_MEIER_MERR9_Msk                (_U_(0x1) << MATRIX_MEIER_MERR9_Pos)                 /**< (MATRIX_MEIER) Master 9 Access Error Mask */
#define MATRIX_MEIER_MERR9(value)             (MATRIX_MEIER_MERR9_Msk & ((value) << MATRIX_MEIER_MERR9_Pos))
#define MATRIX_MEIER_MERR10_Pos               _U_(10)                                              /**< (MATRIX_MEIER) Master 10 Access Error Position */
#define MATRIX_MEIER_MERR10_Msk               (_U_(0x1) << MATRIX_MEIER_MERR10_Pos)                /**< (MATRIX_MEIER) Master 10 Access Error Mask */
#define MATRIX_MEIER_MERR10(value)            (MATRIX_MEIER_MERR10_Msk & ((value) << MATRIX_MEIER_MERR10_Pos))
#define MATRIX_MEIER_MERR11_Pos               _U_(11)                                              /**< (MATRIX_MEIER) Master 11 Access Error Position */
#define MATRIX_MEIER_MERR11_Msk               (_U_(0x1) << MATRIX_MEIER_MERR11_Pos)                /**< (MATRIX_MEIER) Master 11 Access Error Mask */
#define MATRIX_MEIER_MERR11(value)            (MATRIX_MEIER_MERR11_Msk & ((value) << MATRIX_MEIER_MERR11_Pos))
#define MATRIX_MEIER_MERR12_Pos               _U_(12)                                              /**< (MATRIX_MEIER) Master 12 Access Error Position */
#define MATRIX_MEIER_MERR12_Msk               (_U_(0x1) << MATRIX_MEIER_MERR12_Pos)                /**< (MATRIX_MEIER) Master 12 Access Error Mask */
#define MATRIX_MEIER_MERR12(value)            (MATRIX_MEIER_MERR12_Msk & ((value) << MATRIX_MEIER_MERR12_Pos))
#define MATRIX_MEIER_MERR13_Pos               _U_(13)                                              /**< (MATRIX_MEIER) Master 13 Access Error Position */
#define MATRIX_MEIER_MERR13_Msk               (_U_(0x1) << MATRIX_MEIER_MERR13_Pos)                /**< (MATRIX_MEIER) Master 13 Access Error Mask */
#define MATRIX_MEIER_MERR13(value)            (MATRIX_MEIER_MERR13_Msk & ((value) << MATRIX_MEIER_MERR13_Pos))
#define MATRIX_MEIER_MERR14_Pos               _U_(14)                                              /**< (MATRIX_MEIER) Master 14 Access Error Position */
#define MATRIX_MEIER_MERR14_Msk               (_U_(0x1) << MATRIX_MEIER_MERR14_Pos)                /**< (MATRIX_MEIER) Master 14 Access Error Mask */
#define MATRIX_MEIER_MERR14(value)            (MATRIX_MEIER_MERR14_Msk & ((value) << MATRIX_MEIER_MERR14_Pos))
#define MATRIX_MEIER_MERR15_Pos               _U_(15)                                              /**< (MATRIX_MEIER) Master 15 Access Error Position */
#define MATRIX_MEIER_MERR15_Msk               (_U_(0x1) << MATRIX_MEIER_MERR15_Pos)                /**< (MATRIX_MEIER) Master 15 Access Error Mask */
#define MATRIX_MEIER_MERR15(value)            (MATRIX_MEIER_MERR15_Msk & ((value) << MATRIX_MEIER_MERR15_Pos))
#define MATRIX_MEIER_Msk                      _U_(0x0000FFFF)                                      /**< (MATRIX_MEIER) Register Mask  */

