Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_MEAR1 : (MATRIX Offset: 0x164) ( R/ 32) Master 0 Error Address Register 1 -------- */
#define MATRIX_MEAR1_ERRADD_Pos               _U_(0)                                               /**< (MATRIX_MEAR1) Master Error Address Position */
#define MATRIX_MEAR1_ERRADD_Msk               (_U_(0xFFFFFFFF) << MATRIX_MEAR1_ERRADD_Pos)         /**< (MATRIX_MEAR1) Master Error Address Mask */
#define MATRIX_MEAR1_ERRADD(value)            (MATRIX_MEAR1_ERRADD_Msk & ((value) << MATRIX_MEAR1_ERRADD_Pos))
#define MATRIX_MEAR1_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR1) Register Mask  */


/* -------- MATRIX_MEAR2 : (MATRIX Offset: 0x168) ( R/ 32) Master 0 Error Address Register 2 -------- */
#define MATRIX_MEAR2_ERRADD_Pos               _U_(0)                                               /**< (MATRIX_MEAR2) Master Error Address Position */
#define MATRIX_MEAR2_ERRADD_Msk               (_U_(0xFFFFFFFF) << MATRIX_MEAR2_ERRADD_Pos)         /**< (MATRIX_MEAR2) Master Error Address Mask */
#define MATRIX_MEAR2_ERRADD(value)            (MATRIX_MEAR2_ERRADD_Msk & ((value) << MATRIX_MEAR2_ERRADD_Pos))
#define MATRIX_MEAR2_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR2) Register Mask  */


/* -------- MATRIX_MEAR3 : (MATRIX Offset: 0x16C) ( R/ 32) Master 0 Error Address Register 3 -------- */
#define MATRIX_MEAR3_ERRADD_Pos               _U_(0)                                               /**< (MATRIX_MEAR3) Master Error Address Position */
#define MATRIX_MEAR3_ERRADD_Msk               (_U_(0xFFFFFFFF) << MATRIX_MEAR3_ERRADD_Pos)         /**< (MATRIX_MEAR3) Master Error Address Mask */
#define MATRIX_MEAR3_ERRADD(value)            (MATRIX_MEAR3_ERRADD_Msk & ((value) << MATRIX_MEAR3_ERRADD_Pos))
#define MATRIX_MEAR3_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR3) Register Mask  */


/* -------- MATRIX_MEAR4 : (MATRIX Offset: 0x170) ( R/ 32) Master 0 Error Address Register 4 -------- */
#define MATRIX_MEAR4_ERRADD_Pos               _U_(0)                                               /**< (MATRIX_MEAR4) Master Error Address Position */
#define MATRIX_MEAR4_ERRADD_Msk               (_U_(0xFFFFFFFF) << MATRIX_MEAR4_ERRADD_Pos)         /**< (MATRIX_MEAR4) Master Error Address Mask */
#define MATRIX_MEAR4_ERRADD(value)            (MATRIX_MEAR4_ERRADD_Msk & ((value) << MATRIX_MEAR4_ERRADD_Pos))
#define MATRIX_MEAR4_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR4) Register Mask  */


/* -------- MATRIX_MEAR5 : (MATRIX Offset: 0x174) ( R/ 32) Master 0 Error Address Register 5 -------- */
#define MATRIX_MEAR5_ERRADD_Pos               _U_(0)                                               /**< (MATRIX_MEAR5) Master Error Address Position */
#define MATRIX_MEAR5_ERRADD_Msk               (_U_(0xFFFFFFFF) << MATRIX_MEAR5_ERRADD_Pos)         /**< (MATRIX_MEAR5) Master Error Address Mask */
#define MATRIX_MEAR5_ERRADD(value)            (MATRIX_MEAR5_ERRADD_Msk & ((value) << MATRIX_MEAR5_ERRADD_Pos))
#define MATRIX_MEAR5_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR5) Register Mask  */


/* -------- MATRIX_MEAR6 : (MATRIX Offset: 0x178) ( R/ 32) Master 0 Error Address Register 6 -------- */
#define MATRIX_MEAR6_ERRADD_Pos               _U_(0)                                               /**< (MATRIX_MEAR6) Master Error Address Position */
#define MATRIX_MEAR6_ERRADD_Msk               (_U_(0xFFFFFFFF) << MATRIX_MEAR6_ERRADD_Pos)         /**< (MATRIX_MEAR6) Master Error Address Mask */
#define MATRIX_MEAR6_ERRADD(value)            (MATRIX_MEAR6_ERRADD_Msk & ((value) << MATRIX_MEAR6_ERRADD_Pos))
#define MATRIX_MEAR6_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR6) Register Mask  */


/* -------- MATRIX_MEAR7 : (MATRIX Offset: 0x17C) ( R/ 32) Master 0 Error Address Register 7 -------- */
#define MATRIX_MEAR7_ERRADD_Pos               _U_(0)                                               /**< (MATRIX_MEAR7) Master Error Address Position */
#define MATRIX_MEAR7_ERRADD_Msk               (_U_(0xFFFFFFFF) << MATRIX_MEAR7_ERRADD_Pos)         /**< (MATRIX_MEAR7) Master Error Address Mask */
#define MATRIX_MEAR7_ERRADD(value)            (MATRIX_MEAR7_ERRADD_Msk & ((value) << MATRIX_MEAR7_ERRADD_Pos))
#define MATRIX_MEAR7_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR7) Register Mask  */


/* -------- MATRIX_MEAR8 : (MATRIX Offset: 0x180) ( R/ 32) Master 0 Error Address Register 8 -------- */
#define MATRIX_MEAR8_ERRADD_Pos               _U_(0)                                               /**< (MATRIX_MEAR8) Master Error Address Position */
#define MATRIX_MEAR8_ERRADD_Msk               (_U_(0xFFFFFFFF) << MATRIX_MEAR8_ERRADD_Pos)         /**< (MATRIX_MEAR8) Master Error Address Mask */
#define MATRIX_MEAR8_ERRADD(value)            (MATRIX_MEAR8_ERRADD_Msk & ((value) << MATRIX_MEAR8_ERRADD_Pos))
#define MATRIX_MEAR8_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR8) Register Mask  */


/* -------- MATRIX_MEAR9 : (MATRIX Offset: 0x184) ( R/ 32) Master 0 Error Address Register 9 -------- */
#define MATRIX_MEAR9_ERRADD_Pos               _U_(0)                                               /**< (MATRIX_MEAR9) Master Error Address Position */
#define MATRIX_MEAR9_ERRADD_Msk               (_U_(0xFFFFFFFF) << MATRIX_MEAR9_ERRADD_Pos)         /**< (MATRIX_MEAR9) Master Error Address Mask */
#define MATRIX_MEAR9_ERRADD(value)            (MATRIX_MEAR9_ERRADD_Msk & ((value) << MATRIX_MEAR9_ERRADD_Pos))
#define MATRIX_MEAR9_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR9) Register Mask  */


/* -------- MATRIX_MEAR10 : (MATRIX Offset: 0x188) ( R/ 32) Master 0 Error Address Register 10 -------- */
#define MATRIX_MEAR10_ERRADD_Pos              _U_(0)                                               /**< (MATRIX_MEAR10) Master Error Address Position */
#define MATRIX_MEAR10_ERRADD_Msk              (_U_(0xFFFFFFFF) << MATRIX_MEAR10_ERRADD_Pos)        /**< (MATRIX_MEAR10) Master Error Address Mask */
#define MATRIX_MEAR10_ERRADD(value)           (MATRIX_MEAR10_ERRADD_Msk & ((value) << MATRIX_MEAR10_ERRADD_Pos))
#define MATRIX_MEAR10_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR10) Register Mask  */


/* -------- MATRIX_MEAR11 : (MATRIX Offset: 0x18C) ( R/ 32) Master 0 Error Address Register 11 -------- */
#define MATRIX_MEAR11_ERRADD_Pos              _U_(0)                                               /**< (MATRIX_MEAR11) Master Error Address Position */
#define MATRIX_MEAR11_ERRADD_Msk              (_U_(0xFFFFFFFF) << MATRIX_MEAR11_ERRADD_Pos)        /**< (MATRIX_MEAR11) Master Error Address Mask */
#define MATRIX_MEAR11_ERRADD(value)           (MATRIX_MEAR11_ERRADD_Msk & ((value) << MATRIX_MEAR11_ERRADD_Pos))
#define MATRIX_MEAR11_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR11) Register Mask  */


/* -------- MATRIX_MEAR12 : (MATRIX Offset: 0x190) ( R/ 32) Master 0 Error Address Register 12 -------- */
#define MATRIX_MEAR12_ERRADD_Pos              _U_(0)                                               /**< (MATRIX_MEAR12) Master Error Address Position */
#define MATRIX_MEAR12_ERRADD_Msk              (_U_(0xFFFFFFFF) << MATRIX_MEAR12_ERRADD_Pos)        /**< (MATRIX_MEAR12) Master Error Address Mask */
#define MATRIX_MEAR12_ERRADD(value)           (MATRIX_MEAR12_ERRADD_Msk & ((value) << MATRIX_MEAR12_ERRADD_Pos))
#define MATRIX_MEAR12_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR12) Register Mask  */


/* -------- MATRIX_MEAR13 : (MATRIX Offset: 0x194) ( R/ 32) Master 0 Error Address Register 13 -------- */
#define MATRIX_MEAR13_ERRADD_Pos              _U_(0)                                               /**< (MATRIX_MEAR13) Master Error Address Position */
#define MATRIX_MEAR13_ERRADD_Msk              (_U_(0xFFFFFFFF) << MATRIX_MEAR13_ERRADD_Pos)        /**< (MATRIX_MEAR13) Master Error Address Mask */
#define MATRIX_MEAR13_ERRADD(value)           (MATRIX_MEAR13_ERRADD_Msk & ((value) << MATRIX_MEAR13_ERRADD_Pos))
#define MATRIX_MEAR13_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR13) Register Mask  */


/* -------- MATRIX_MEAR14 : (MATRIX Offset: 0x198) ( R/ 32) Master 0 Error Address Register 14 -------- */
#define MATRIX_MEAR14_ERRADD_Pos              _U_(0)                                               /**< (MATRIX_MEAR14) Master Error Address Position */
#define MATRIX_MEAR14_ERRADD_Msk              (_U_(0xFFFFFFFF) << MATRIX_MEAR14_ERRADD_Pos)        /**< (MATRIX_MEAR14) Master Error Address Mask */
#define MATRIX_MEAR14_ERRADD(value)           (MATRIX_MEAR14_ERRADD_Msk & ((value) << MATRIX_MEAR14_ERRADD_Pos))
#define MATRIX_MEAR14_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR14) Register Mask  */


