Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_PSR12 : (MATRIX Offset: 0x230) (R/W 32) Protection Slave 0 Register 12 -------- */
#define MATRIX_PSR12_LAUSERH0_Pos             _U_(0)                                               /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR12_LAUSERH0_Msk             (_U_(0x1) << MATRIX_PSR12_LAUSERH0_Pos)              /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR12_LAUSERH0(value)          (MATRIX_PSR12_LAUSERH0_Msk & ((value) << MATRIX_PSR12_LAUSERH0_Pos))
#define MATRIX_PSR12_LAUSERH1_Pos             _U_(1)                                               /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR12_LAUSERH1_Msk             (_U_(0x1) << MATRIX_PSR12_LAUSERH1_Pos)              /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR12_LAUSERH1(value)          (MATRIX_PSR12_LAUSERH1_Msk & ((value) << MATRIX_PSR12_LAUSERH1_Pos))
#define MATRIX_PSR12_LAUSERH2_Pos             _U_(2)                                               /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR12_LAUSERH2_Msk             (_U_(0x1) << MATRIX_PSR12_LAUSERH2_Pos)              /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR12_LAUSERH2(value)          (MATRIX_PSR12_LAUSERH2_Msk & ((value) << MATRIX_PSR12_LAUSERH2_Pos))
#define MATRIX_PSR12_LAUSERH3_Pos             _U_(3)                                               /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR12_LAUSERH3_Msk             (_U_(0x1) << MATRIX_PSR12_LAUSERH3_Pos)              /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR12_LAUSERH3(value)          (MATRIX_PSR12_LAUSERH3_Msk & ((value) << MATRIX_PSR12_LAUSERH3_Pos))
#define MATRIX_PSR12_LAUSERH4_Pos             _U_(4)                                               /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR12_LAUSERH4_Msk             (_U_(0x1) << MATRIX_PSR12_LAUSERH4_Pos)              /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR12_LAUSERH4(value)          (MATRIX_PSR12_LAUSERH4_Msk & ((value) << MATRIX_PSR12_LAUSERH4_Pos))
#define MATRIX_PSR12_LAUSERH5_Pos             _U_(5)                                               /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR12_LAUSERH5_Msk             (_U_(0x1) << MATRIX_PSR12_LAUSERH5_Pos)              /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR12_LAUSERH5(value)          (MATRIX_PSR12_LAUSERH5_Msk & ((value) << MATRIX_PSR12_LAUSERH5_Pos))
#define MATRIX_PSR12_LAUSERH6_Pos             _U_(6)                                               /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR12_LAUSERH6_Msk             (_U_(0x1) << MATRIX_PSR12_LAUSERH6_Pos)              /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR12_LAUSERH6(value)          (MATRIX_PSR12_LAUSERH6_Msk & ((value) << MATRIX_PSR12_LAUSERH6_Pos))
#define MATRIX_PSR12_LAUSERH7_Pos             _U_(7)                                               /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR12_LAUSERH7_Msk             (_U_(0x1) << MATRIX_PSR12_LAUSERH7_Pos)              /**< (MATRIX_PSR12) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR12_LAUSERH7(value)          (MATRIX_PSR12_LAUSERH7_Msk & ((value) << MATRIX_PSR12_LAUSERH7_Pos))
#define MATRIX_PSR12_RDUSERH0_Pos             _U_(8)                                               /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR12_RDUSERH0_Msk             (_U_(0x1) << MATRIX_PSR12_RDUSERH0_Pos)              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_RDUSERH0(value)          (MATRIX_PSR12_RDUSERH0_Msk & ((value) << MATRIX_PSR12_RDUSERH0_Pos))
#define MATRIX_PSR12_RDUSERH1_Pos             _U_(9)                                               /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR12_RDUSERH1_Msk             (_U_(0x1) << MATRIX_PSR12_RDUSERH1_Pos)              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_RDUSERH1(value)          (MATRIX_PSR12_RDUSERH1_Msk & ((value) << MATRIX_PSR12_RDUSERH1_Pos))
#define MATRIX_PSR12_RDUSERH2_Pos             _U_(10)                                              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR12_RDUSERH2_Msk             (_U_(0x1) << MATRIX_PSR12_RDUSERH2_Pos)              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_RDUSERH2(value)          (MATRIX_PSR12_RDUSERH2_Msk & ((value) << MATRIX_PSR12_RDUSERH2_Pos))
#define MATRIX_PSR12_RDUSERH3_Pos             _U_(11)                                              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR12_RDUSERH3_Msk             (_U_(0x1) << MATRIX_PSR12_RDUSERH3_Pos)              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_RDUSERH3(value)          (MATRIX_PSR12_RDUSERH3_Msk & ((value) << MATRIX_PSR12_RDUSERH3_Pos))
#define MATRIX_PSR12_RDUSERH4_Pos             _U_(12)                                              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR12_RDUSERH4_Msk             (_U_(0x1) << MATRIX_PSR12_RDUSERH4_Pos)              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_RDUSERH4(value)          (MATRIX_PSR12_RDUSERH4_Msk & ((value) << MATRIX_PSR12_RDUSERH4_Pos))
#define MATRIX_PSR12_RDUSERH5_Pos             _U_(13)                                              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR12_RDUSERH5_Msk             (_U_(0x1) << MATRIX_PSR12_RDUSERH5_Pos)              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_RDUSERH5(value)          (MATRIX_PSR12_RDUSERH5_Msk & ((value) << MATRIX_PSR12_RDUSERH5_Pos))
#define MATRIX_PSR12_RDUSERH6_Pos             _U_(14)                                              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR12_RDUSERH6_Msk             (_U_(0x1) << MATRIX_PSR12_RDUSERH6_Pos)              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_RDUSERH6(value)          (MATRIX_PSR12_RDUSERH6_Msk & ((value) << MATRIX_PSR12_RDUSERH6_Pos))
#define MATRIX_PSR12_RDUSERH7_Pos             _U_(15)                                              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR12_RDUSERH7_Msk             (_U_(0x1) << MATRIX_PSR12_RDUSERH7_Pos)              /**< (MATRIX_PSR12) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_RDUSERH7(value)          (MATRIX_PSR12_RDUSERH7_Msk & ((value) << MATRIX_PSR12_RDUSERH7_Pos))
#define MATRIX_PSR12_WRUSERH0_Pos             _U_(16)                                              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR12_WRUSERH0_Msk             (_U_(0x1) << MATRIX_PSR12_WRUSERH0_Pos)              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_WRUSERH0(value)          (MATRIX_PSR12_WRUSERH0_Msk & ((value) << MATRIX_PSR12_WRUSERH0_Pos))
#define MATRIX_PSR12_WRUSERH1_Pos             _U_(17)                                              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR12_WRUSERH1_Msk             (_U_(0x1) << MATRIX_PSR12_WRUSERH1_Pos)              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_WRUSERH1(value)          (MATRIX_PSR12_WRUSERH1_Msk & ((value) << MATRIX_PSR12_WRUSERH1_Pos))
#define MATRIX_PSR12_WRUSERH2_Pos             _U_(18)                                              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR12_WRUSERH2_Msk             (_U_(0x1) << MATRIX_PSR12_WRUSERH2_Pos)              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_WRUSERH2(value)          (MATRIX_PSR12_WRUSERH2_Msk & ((value) << MATRIX_PSR12_WRUSERH2_Pos))
#define MATRIX_PSR12_WRUSERH3_Pos             _U_(19)                                              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR12_WRUSERH3_Msk             (_U_(0x1) << MATRIX_PSR12_WRUSERH3_Pos)              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_WRUSERH3(value)          (MATRIX_PSR12_WRUSERH3_Msk & ((value) << MATRIX_PSR12_WRUSERH3_Pos))
#define MATRIX_PSR12_WRUSERH4_Pos             _U_(20)                                              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR12_WRUSERH4_Msk             (_U_(0x1) << MATRIX_PSR12_WRUSERH4_Pos)              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_WRUSERH4(value)          (MATRIX_PSR12_WRUSERH4_Msk & ((value) << MATRIX_PSR12_WRUSERH4_Pos))
#define MATRIX_PSR12_WRUSERH5_Pos             _U_(21)                                              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR12_WRUSERH5_Msk             (_U_(0x1) << MATRIX_PSR12_WRUSERH5_Pos)              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_WRUSERH5(value)          (MATRIX_PSR12_WRUSERH5_Msk & ((value) << MATRIX_PSR12_WRUSERH5_Pos))
#define MATRIX_PSR12_WRUSERH6_Pos             _U_(22)                                              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR12_WRUSERH6_Msk             (_U_(0x1) << MATRIX_PSR12_WRUSERH6_Pos)              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_WRUSERH6(value)          (MATRIX_PSR12_WRUSERH6_Msk & ((value) << MATRIX_PSR12_WRUSERH6_Pos))
#define MATRIX_PSR12_WRUSERH7_Pos             _U_(23)                                              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR12_WRUSERH7_Msk             (_U_(0x1) << MATRIX_PSR12_WRUSERH7_Pos)              /**< (MATRIX_PSR12) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR12_WRUSERH7(value)          (MATRIX_PSR12_WRUSERH7_Msk & ((value) << MATRIX_PSR12_WRUSERH7_Pos))
#define MATRIX_PSR12_DPSOA0_Pos               _U_(24)                                              /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR12_DPSOA0_Msk               (_U_(0x1) << MATRIX_PSR12_DPSOA0_Pos)                /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR12_DPSOA0(value)            (MATRIX_PSR12_DPSOA0_Msk & ((value) << MATRIX_PSR12_DPSOA0_Pos))
#define MATRIX_PSR12_DPSOA1_Pos               _U_(25)                                              /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR12_DPSOA1_Msk               (_U_(0x1) << MATRIX_PSR12_DPSOA1_Pos)                /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR12_DPSOA1(value)            (MATRIX_PSR12_DPSOA1_Msk & ((value) << MATRIX_PSR12_DPSOA1_Pos))
#define MATRIX_PSR12_DPSOA2_Pos               _U_(26)                                              /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR12_DPSOA2_Msk               (_U_(0x1) << MATRIX_PSR12_DPSOA2_Pos)                /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR12_DPSOA2(value)            (MATRIX_PSR12_DPSOA2_Msk & ((value) << MATRIX_PSR12_DPSOA2_Pos))
#define MATRIX_PSR12_DPSOA3_Pos               _U_(27)                                              /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR12_DPSOA3_Msk               (_U_(0x1) << MATRIX_PSR12_DPSOA3_Pos)                /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR12_DPSOA3(value)            (MATRIX_PSR12_DPSOA3_Msk & ((value) << MATRIX_PSR12_DPSOA3_Pos))
#define MATRIX_PSR12_DPSOA4_Pos               _U_(28)                                              /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR12_DPSOA4_Msk               (_U_(0x1) << MATRIX_PSR12_DPSOA4_Pos)                /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR12_DPSOA4(value)            (MATRIX_PSR12_DPSOA4_Msk & ((value) << MATRIX_PSR12_DPSOA4_Pos))
#define MATRIX_PSR12_DPSOA5_Pos               _U_(29)                                              /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR12_DPSOA5_Msk               (_U_(0x1) << MATRIX_PSR12_DPSOA5_Pos)                /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR12_DPSOA5(value)            (MATRIX_PSR12_DPSOA5_Msk & ((value) << MATRIX_PSR12_DPSOA5_Pos))
#define MATRIX_PSR12_DPSOA6_Pos               _U_(30)                                              /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR12_DPSOA6_Msk               (_U_(0x1) << MATRIX_PSR12_DPSOA6_Pos)                /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR12_DPSOA6(value)            (MATRIX_PSR12_DPSOA6_Msk & ((value) << MATRIX_PSR12_DPSOA6_Pos))
#define MATRIX_PSR12_DPSOA7_Pos               _U_(31)                                              /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR12_DPSOA7_Msk               (_U_(0x1) << MATRIX_PSR12_DPSOA7_Pos)                /**< (MATRIX_PSR12) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR12_DPSOA7(value)            (MATRIX_PSR12_DPSOA7_Msk & ((value) << MATRIX_PSR12_DPSOA7_Pos))
#define MATRIX_PSR12_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_PSR12) Register Mask  */

