Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_PASSR4 : (MATRIX Offset: 0x250) (R/W 32) Protected Areas Split Slave 0 Register 4 -------- */
#define MATRIX_PASSR4_PASPLIT0_Pos            _U_(0)                                               /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR4_PASPLIT0_Msk            (_U_(0xF) << MATRIX_PASSR4_PASPLIT0_Pos)             /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR4_PASPLIT0(value)         (MATRIX_PASSR4_PASPLIT0_Msk & ((value) << MATRIX_PASSR4_PASPLIT0_Pos))
#define MATRIX_PASSR4_PASPLIT1_Pos            _U_(4)                                               /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR4_PASPLIT1_Msk            (_U_(0xF) << MATRIX_PASSR4_PASPLIT1_Pos)             /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR4_PASPLIT1(value)         (MATRIX_PASSR4_PASPLIT1_Msk & ((value) << MATRIX_PASSR4_PASPLIT1_Pos))
#define MATRIX_PASSR4_PASPLIT2_Pos            _U_(8)                                               /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR4_PASPLIT2_Msk            (_U_(0xF) << MATRIX_PASSR4_PASPLIT2_Pos)             /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR4_PASPLIT2(value)         (MATRIX_PASSR4_PASPLIT2_Msk & ((value) << MATRIX_PASSR4_PASPLIT2_Pos))
#define MATRIX_PASSR4_PASPLIT3_Pos            _U_(12)                                              /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR4_PASPLIT3_Msk            (_U_(0xF) << MATRIX_PASSR4_PASPLIT3_Pos)             /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR4_PASPLIT3(value)         (MATRIX_PASSR4_PASPLIT3_Msk & ((value) << MATRIX_PASSR4_PASPLIT3_Pos))
#define MATRIX_PASSR4_PASPLIT4_Pos            _U_(16)                                              /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR4_PASPLIT4_Msk            (_U_(0xF) << MATRIX_PASSR4_PASPLIT4_Pos)             /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR4_PASPLIT4(value)         (MATRIX_PASSR4_PASPLIT4_Msk & ((value) << MATRIX_PASSR4_PASPLIT4_Pos))
#define MATRIX_PASSR4_PASPLIT5_Pos            _U_(20)                                              /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR4_PASPLIT5_Msk            (_U_(0xF) << MATRIX_PASSR4_PASPLIT5_Pos)             /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR4_PASPLIT5(value)         (MATRIX_PASSR4_PASPLIT5_Msk & ((value) << MATRIX_PASSR4_PASPLIT5_Pos))
#define MATRIX_PASSR4_PASPLIT6_Pos            _U_(24)                                              /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR4_PASPLIT6_Msk            (_U_(0xF) << MATRIX_PASSR4_PASPLIT6_Pos)             /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR4_PASPLIT6(value)         (MATRIX_PASSR4_PASPLIT6_Msk & ((value) << MATRIX_PASSR4_PASPLIT6_Pos))
#define MATRIX_PASSR4_PASPLIT7_Pos            _U_(28)                                              /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR4_PASPLIT7_Msk            (_U_(0xF) << MATRIX_PASSR4_PASPLIT7_Pos)             /**< (MATRIX_PASSR4) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR4_PASPLIT7(value)         (MATRIX_PASSR4_PASPLIT7_Msk & ((value) << MATRIX_PASSR4_PASPLIT7_Pos))
#define MATRIX_PASSR4_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR4) Register Mask  */


/* -------- MATRIX_PASSR5 : (MATRIX Offset: 0x254) (R/W 32) Protected Areas Split Slave 0 Register 5 -------- */
#define MATRIX_PASSR5_PASPLIT0_Pos            _U_(0)                                               /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR5_PASPLIT0_Msk            (_U_(0xF) << MATRIX_PASSR5_PASPLIT0_Pos)             /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR5_PASPLIT0(value)         (MATRIX_PASSR5_PASPLIT0_Msk & ((value) << MATRIX_PASSR5_PASPLIT0_Pos))
#define MATRIX_PASSR5_PASPLIT1_Pos            _U_(4)                                               /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR5_PASPLIT1_Msk            (_U_(0xF) << MATRIX_PASSR5_PASPLIT1_Pos)             /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR5_PASPLIT1(value)         (MATRIX_PASSR5_PASPLIT1_Msk & ((value) << MATRIX_PASSR5_PASPLIT1_Pos))
#define MATRIX_PASSR5_PASPLIT2_Pos            _U_(8)                                               /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR5_PASPLIT2_Msk            (_U_(0xF) << MATRIX_PASSR5_PASPLIT2_Pos)             /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR5_PASPLIT2(value)         (MATRIX_PASSR5_PASPLIT2_Msk & ((value) << MATRIX_PASSR5_PASPLIT2_Pos))
#define MATRIX_PASSR5_PASPLIT3_Pos            _U_(12)                                              /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR5_PASPLIT3_Msk            (_U_(0xF) << MATRIX_PASSR5_PASPLIT3_Pos)             /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR5_PASPLIT3(value)         (MATRIX_PASSR5_PASPLIT3_Msk & ((value) << MATRIX_PASSR5_PASPLIT3_Pos))
#define MATRIX_PASSR5_PASPLIT4_Pos            _U_(16)                                              /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR5_PASPLIT4_Msk            (_U_(0xF) << MATRIX_PASSR5_PASPLIT4_Pos)             /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR5_PASPLIT4(value)         (MATRIX_PASSR5_PASPLIT4_Msk & ((value) << MATRIX_PASSR5_PASPLIT4_Pos))
#define MATRIX_PASSR5_PASPLIT5_Pos            _U_(20)                                              /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR5_PASPLIT5_Msk            (_U_(0xF) << MATRIX_PASSR5_PASPLIT5_Pos)             /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR5_PASPLIT5(value)         (MATRIX_PASSR5_PASPLIT5_Msk & ((value) << MATRIX_PASSR5_PASPLIT5_Pos))
#define MATRIX_PASSR5_PASPLIT6_Pos            _U_(24)                                              /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR5_PASPLIT6_Msk            (_U_(0xF) << MATRIX_PASSR5_PASPLIT6_Pos)             /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR5_PASPLIT6(value)         (MATRIX_PASSR5_PASPLIT6_Msk & ((value) << MATRIX_PASSR5_PASPLIT6_Pos))
#define MATRIX_PASSR5_PASPLIT7_Pos            _U_(28)                                              /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR5_PASPLIT7_Msk            (_U_(0xF) << MATRIX_PASSR5_PASPLIT7_Pos)             /**< (MATRIX_PASSR5) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR5_PASPLIT7(value)         (MATRIX_PASSR5_PASPLIT7_Msk & ((value) << MATRIX_PASSR5_PASPLIT7_Pos))
#define MATRIX_PASSR5_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR5) Register Mask  */


/* -------- MATRIX_PASSR6 : (MATRIX Offset: 0x258) (R/W 32) Protected Areas Split Slave 0 Register 6 -------- */
#define MATRIX_PASSR6_PASPLIT0_Pos            _U_(0)                                               /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR6_PASPLIT0_Msk            (_U_(0xF) << MATRIX_PASSR6_PASPLIT0_Pos)             /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR6_PASPLIT0(value)         (MATRIX_PASSR6_PASPLIT0_Msk & ((value) << MATRIX_PASSR6_PASPLIT0_Pos))
#define MATRIX_PASSR6_PASPLIT1_Pos            _U_(4)                                               /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR6_PASPLIT1_Msk            (_U_(0xF) << MATRIX_PASSR6_PASPLIT1_Pos)             /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR6_PASPLIT1(value)         (MATRIX_PASSR6_PASPLIT1_Msk & ((value) << MATRIX_PASSR6_PASPLIT1_Pos))
#define MATRIX_PASSR6_PASPLIT2_Pos            _U_(8)                                               /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR6_PASPLIT2_Msk            (_U_(0xF) << MATRIX_PASSR6_PASPLIT2_Pos)             /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR6_PASPLIT2(value)         (MATRIX_PASSR6_PASPLIT2_Msk & ((value) << MATRIX_PASSR6_PASPLIT2_Pos))
#define MATRIX_PASSR6_PASPLIT3_Pos            _U_(12)                                              /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR6_PASPLIT3_Msk            (_U_(0xF) << MATRIX_PASSR6_PASPLIT3_Pos)             /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR6_PASPLIT3(value)         (MATRIX_PASSR6_PASPLIT3_Msk & ((value) << MATRIX_PASSR6_PASPLIT3_Pos))
#define MATRIX_PASSR6_PASPLIT4_Pos            _U_(16)                                              /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR6_PASPLIT4_Msk            (_U_(0xF) << MATRIX_PASSR6_PASPLIT4_Pos)             /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR6_PASPLIT4(value)         (MATRIX_PASSR6_PASPLIT4_Msk & ((value) << MATRIX_PASSR6_PASPLIT4_Pos))
#define MATRIX_PASSR6_PASPLIT5_Pos            _U_(20)                                              /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR6_PASPLIT5_Msk            (_U_(0xF) << MATRIX_PASSR6_PASPLIT5_Pos)             /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR6_PASPLIT5(value)         (MATRIX_PASSR6_PASPLIT5_Msk & ((value) << MATRIX_PASSR6_PASPLIT5_Pos))
#define MATRIX_PASSR6_PASPLIT6_Pos            _U_(24)                                              /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR6_PASPLIT6_Msk            (_U_(0xF) << MATRIX_PASSR6_PASPLIT6_Pos)             /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR6_PASPLIT6(value)         (MATRIX_PASSR6_PASPLIT6_Msk & ((value) << MATRIX_PASSR6_PASPLIT6_Pos))
#define MATRIX_PASSR6_PASPLIT7_Pos            _U_(28)                                              /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR6_PASPLIT7_Msk            (_U_(0xF) << MATRIX_PASSR6_PASPLIT7_Pos)             /**< (MATRIX_PASSR6) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR6_PASPLIT7(value)         (MATRIX_PASSR6_PASPLIT7_Msk & ((value) << MATRIX_PASSR6_PASPLIT7_Pos))
#define MATRIX_PASSR6_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR6) Register Mask  */


/* -------- MATRIX_PASSR7 : (MATRIX Offset: 0x25C) (R/W 32) Protected Areas Split Slave 0 Register 7 -------- */
#define MATRIX_PASSR7_PASPLIT0_Pos            _U_(0)                                               /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR7_PASPLIT0_Msk            (_U_(0xF) << MATRIX_PASSR7_PASPLIT0_Pos)             /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR7_PASPLIT0(value)         (MATRIX_PASSR7_PASPLIT0_Msk & ((value) << MATRIX_PASSR7_PASPLIT0_Pos))
#define MATRIX_PASSR7_PASPLIT1_Pos            _U_(4)                                               /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR7_PASPLIT1_Msk            (_U_(0xF) << MATRIX_PASSR7_PASPLIT1_Pos)             /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR7_PASPLIT1(value)         (MATRIX_PASSR7_PASPLIT1_Msk & ((value) << MATRIX_PASSR7_PASPLIT1_Pos))
#define MATRIX_PASSR7_PASPLIT2_Pos            _U_(8)                                               /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR7_PASPLIT2_Msk            (_U_(0xF) << MATRIX_PASSR7_PASPLIT2_Pos)             /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR7_PASPLIT2(value)         (MATRIX_PASSR7_PASPLIT2_Msk & ((value) << MATRIX_PASSR7_PASPLIT2_Pos))
#define MATRIX_PASSR7_PASPLIT3_Pos            _U_(12)                                              /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR7_PASPLIT3_Msk            (_U_(0xF) << MATRIX_PASSR7_PASPLIT3_Pos)             /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR7_PASPLIT3(value)         (MATRIX_PASSR7_PASPLIT3_Msk & ((value) << MATRIX_PASSR7_PASPLIT3_Pos))
#define MATRIX_PASSR7_PASPLIT4_Pos            _U_(16)                                              /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR7_PASPLIT4_Msk            (_U_(0xF) << MATRIX_PASSR7_PASPLIT4_Pos)             /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR7_PASPLIT4(value)         (MATRIX_PASSR7_PASPLIT4_Msk & ((value) << MATRIX_PASSR7_PASPLIT4_Pos))
#define MATRIX_PASSR7_PASPLIT5_Pos            _U_(20)                                              /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR7_PASPLIT5_Msk            (_U_(0xF) << MATRIX_PASSR7_PASPLIT5_Pos)             /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR7_PASPLIT5(value)         (MATRIX_PASSR7_PASPLIT5_Msk & ((value) << MATRIX_PASSR7_PASPLIT5_Pos))
#define MATRIX_PASSR7_PASPLIT6_Pos            _U_(24)                                              /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR7_PASPLIT6_Msk            (_U_(0xF) << MATRIX_PASSR7_PASPLIT6_Pos)             /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR7_PASPLIT6(value)         (MATRIX_PASSR7_PASPLIT6_Msk & ((value) << MATRIX_PASSR7_PASPLIT6_Pos))
#define MATRIX_PASSR7_PASPLIT7_Pos            _U_(28)                                              /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR7_PASPLIT7_Msk            (_U_(0xF) << MATRIX_PASSR7_PASPLIT7_Pos)             /**< (MATRIX_PASSR7) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR7_PASPLIT7(value)         (MATRIX_PASSR7_PASPLIT7_Msk & ((value) << MATRIX_PASSR7_PASPLIT7_Pos))
#define MATRIX_PASSR7_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR7) Register Mask  */


/* -------- MATRIX_PASSR8 : (MATRIX Offset: 0x260) (R/W 32) Protected Areas Split Slave 0 Register 8 -------- */
#define MATRIX_PASSR8_PASPLIT0_Pos            _U_(0)                                               /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR8_PASPLIT0_Msk            (_U_(0xF) << MATRIX_PASSR8_PASPLIT0_Pos)             /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR8_PASPLIT0(value)         (MATRIX_PASSR8_PASPLIT0_Msk & ((value) << MATRIX_PASSR8_PASPLIT0_Pos))
#define MATRIX_PASSR8_PASPLIT1_Pos            _U_(4)                                               /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR8_PASPLIT1_Msk            (_U_(0xF) << MATRIX_PASSR8_PASPLIT1_Pos)             /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR8_PASPLIT1(value)         (MATRIX_PASSR8_PASPLIT1_Msk & ((value) << MATRIX_PASSR8_PASPLIT1_Pos))
#define MATRIX_PASSR8_PASPLIT2_Pos            _U_(8)                                               /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR8_PASPLIT2_Msk            (_U_(0xF) << MATRIX_PASSR8_PASPLIT2_Pos)             /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR8_PASPLIT2(value)         (MATRIX_PASSR8_PASPLIT2_Msk & ((value) << MATRIX_PASSR8_PASPLIT2_Pos))
#define MATRIX_PASSR8_PASPLIT3_Pos            _U_(12)                                              /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR8_PASPLIT3_Msk            (_U_(0xF) << MATRIX_PASSR8_PASPLIT3_Pos)             /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR8_PASPLIT3(value)         (MATRIX_PASSR8_PASPLIT3_Msk & ((value) << MATRIX_PASSR8_PASPLIT3_Pos))
#define MATRIX_PASSR8_PASPLIT4_Pos            _U_(16)                                              /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR8_PASPLIT4_Msk            (_U_(0xF) << MATRIX_PASSR8_PASPLIT4_Pos)             /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR8_PASPLIT4(value)         (MATRIX_PASSR8_PASPLIT4_Msk & ((value) << MATRIX_PASSR8_PASPLIT4_Pos))
#define MATRIX_PASSR8_PASPLIT5_Pos            _U_(20)                                              /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR8_PASPLIT5_Msk            (_U_(0xF) << MATRIX_PASSR8_PASPLIT5_Pos)             /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR8_PASPLIT5(value)         (MATRIX_PASSR8_PASPLIT5_Msk & ((value) << MATRIX_PASSR8_PASPLIT5_Pos))
#define MATRIX_PASSR8_PASPLIT6_Pos            _U_(24)                                              /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR8_PASPLIT6_Msk            (_U_(0xF) << MATRIX_PASSR8_PASPLIT6_Pos)             /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR8_PASPLIT6(value)         (MATRIX_PASSR8_PASPLIT6_Msk & ((value) << MATRIX_PASSR8_PASPLIT6_Pos))
#define MATRIX_PASSR8_PASPLIT7_Pos            _U_(28)                                              /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR8_PASPLIT7_Msk            (_U_(0xF) << MATRIX_PASSR8_PASPLIT7_Pos)             /**< (MATRIX_PASSR8) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR8_PASPLIT7(value)         (MATRIX_PASSR8_PASPLIT7_Msk & ((value) << MATRIX_PASSR8_PASPLIT7_Pos))
#define MATRIX_PASSR8_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR8) Register Mask  */


