Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_PASSR9 : (MATRIX Offset: 0x264) (R/W 32) Protected Areas Split Slave 0 Register 9 -------- */
#define MATRIX_PASSR9_PASPLIT0_Pos            _U_(0)                                               /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR9_PASPLIT0_Msk            (_U_(0xF) << MATRIX_PASSR9_PASPLIT0_Pos)             /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR9_PASPLIT0(value)         (MATRIX_PASSR9_PASPLIT0_Msk & ((value) << MATRIX_PASSR9_PASPLIT0_Pos))
#define MATRIX_PASSR9_PASPLIT1_Pos            _U_(4)                                               /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR9_PASPLIT1_Msk            (_U_(0xF) << MATRIX_PASSR9_PASPLIT1_Pos)             /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR9_PASPLIT1(value)         (MATRIX_PASSR9_PASPLIT1_Msk & ((value) << MATRIX_PASSR9_PASPLIT1_Pos))
#define MATRIX_PASSR9_PASPLIT2_Pos            _U_(8)                                               /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR9_PASPLIT2_Msk            (_U_(0xF) << MATRIX_PASSR9_PASPLIT2_Pos)             /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR9_PASPLIT2(value)         (MATRIX_PASSR9_PASPLIT2_Msk & ((value) << MATRIX_PASSR9_PASPLIT2_Pos))
#define MATRIX_PASSR9_PASPLIT3_Pos            _U_(12)                                              /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR9_PASPLIT3_Msk            (_U_(0xF) << MATRIX_PASSR9_PASPLIT3_Pos)             /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR9_PASPLIT3(value)         (MATRIX_PASSR9_PASPLIT3_Msk & ((value) << MATRIX_PASSR9_PASPLIT3_Pos))
#define MATRIX_PASSR9_PASPLIT4_Pos            _U_(16)                                              /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR9_PASPLIT4_Msk            (_U_(0xF) << MATRIX_PASSR9_PASPLIT4_Pos)             /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR9_PASPLIT4(value)         (MATRIX_PASSR9_PASPLIT4_Msk & ((value) << MATRIX_PASSR9_PASPLIT4_Pos))
#define MATRIX_PASSR9_PASPLIT5_Pos            _U_(20)                                              /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR9_PASPLIT5_Msk            (_U_(0xF) << MATRIX_PASSR9_PASPLIT5_Pos)             /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR9_PASPLIT5(value)         (MATRIX_PASSR9_PASPLIT5_Msk & ((value) << MATRIX_PASSR9_PASPLIT5_Pos))
#define MATRIX_PASSR9_PASPLIT6_Pos            _U_(24)                                              /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR9_PASPLIT6_Msk            (_U_(0xF) << MATRIX_PASSR9_PASPLIT6_Pos)             /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR9_PASPLIT6(value)         (MATRIX_PASSR9_PASPLIT6_Msk & ((value) << MATRIX_PASSR9_PASPLIT6_Pos))
#define MATRIX_PASSR9_PASPLIT7_Pos            _U_(28)                                              /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR9_PASPLIT7_Msk            (_U_(0xF) << MATRIX_PASSR9_PASPLIT7_Pos)             /**< (MATRIX_PASSR9) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR9_PASPLIT7(value)         (MATRIX_PASSR9_PASPLIT7_Msk & ((value) << MATRIX_PASSR9_PASPLIT7_Pos))
#define MATRIX_PASSR9_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR9) Register Mask  */


/* -------- MATRIX_PASSR10 : (MATRIX Offset: 0x268) (R/W 32) Protected Areas Split Slave 0 Register 10 -------- */
#define MATRIX_PASSR10_PASPLIT0_Pos           _U_(0)                                               /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR10_PASPLIT0_Msk           (_U_(0xF) << MATRIX_PASSR10_PASPLIT0_Pos)            /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR10_PASPLIT0(value)        (MATRIX_PASSR10_PASPLIT0_Msk & ((value) << MATRIX_PASSR10_PASPLIT0_Pos))
#define MATRIX_PASSR10_PASPLIT1_Pos           _U_(4)                                               /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR10_PASPLIT1_Msk           (_U_(0xF) << MATRIX_PASSR10_PASPLIT1_Pos)            /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR10_PASPLIT1(value)        (MATRIX_PASSR10_PASPLIT1_Msk & ((value) << MATRIX_PASSR10_PASPLIT1_Pos))
#define MATRIX_PASSR10_PASPLIT2_Pos           _U_(8)                                               /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR10_PASPLIT2_Msk           (_U_(0xF) << MATRIX_PASSR10_PASPLIT2_Pos)            /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR10_PASPLIT2(value)        (MATRIX_PASSR10_PASPLIT2_Msk & ((value) << MATRIX_PASSR10_PASPLIT2_Pos))
#define MATRIX_PASSR10_PASPLIT3_Pos           _U_(12)                                              /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR10_PASPLIT3_Msk           (_U_(0xF) << MATRIX_PASSR10_PASPLIT3_Pos)            /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR10_PASPLIT3(value)        (MATRIX_PASSR10_PASPLIT3_Msk & ((value) << MATRIX_PASSR10_PASPLIT3_Pos))
#define MATRIX_PASSR10_PASPLIT4_Pos           _U_(16)                                              /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR10_PASPLIT4_Msk           (_U_(0xF) << MATRIX_PASSR10_PASPLIT4_Pos)            /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR10_PASPLIT4(value)        (MATRIX_PASSR10_PASPLIT4_Msk & ((value) << MATRIX_PASSR10_PASPLIT4_Pos))
#define MATRIX_PASSR10_PASPLIT5_Pos           _U_(20)                                              /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR10_PASPLIT5_Msk           (_U_(0xF) << MATRIX_PASSR10_PASPLIT5_Pos)            /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR10_PASPLIT5(value)        (MATRIX_PASSR10_PASPLIT5_Msk & ((value) << MATRIX_PASSR10_PASPLIT5_Pos))
#define MATRIX_PASSR10_PASPLIT6_Pos           _U_(24)                                              /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR10_PASPLIT6_Msk           (_U_(0xF) << MATRIX_PASSR10_PASPLIT6_Pos)            /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR10_PASPLIT6(value)        (MATRIX_PASSR10_PASPLIT6_Msk & ((value) << MATRIX_PASSR10_PASPLIT6_Pos))
#define MATRIX_PASSR10_PASPLIT7_Pos           _U_(28)                                              /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR10_PASPLIT7_Msk           (_U_(0xF) << MATRIX_PASSR10_PASPLIT7_Pos)            /**< (MATRIX_PASSR10) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR10_PASPLIT7(value)        (MATRIX_PASSR10_PASPLIT7_Msk & ((value) << MATRIX_PASSR10_PASPLIT7_Pos))
#define MATRIX_PASSR10_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR10) Register Mask  */


