Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_PASSR11 : (MATRIX Offset: 0x26C) (R/W 32) Protected Areas Split Slave 0 Register 11 -------- */
#define MATRIX_PASSR11_PASPLIT0_Pos           _U_(0)                                               /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR11_PASPLIT0_Msk           (_U_(0xF) << MATRIX_PASSR11_PASPLIT0_Pos)            /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR11_PASPLIT0(value)        (MATRIX_PASSR11_PASPLIT0_Msk & ((value) << MATRIX_PASSR11_PASPLIT0_Pos))
#define MATRIX_PASSR11_PASPLIT1_Pos           _U_(4)                                               /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR11_PASPLIT1_Msk           (_U_(0xF) << MATRIX_PASSR11_PASPLIT1_Pos)            /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR11_PASPLIT1(value)        (MATRIX_PASSR11_PASPLIT1_Msk & ((value) << MATRIX_PASSR11_PASPLIT1_Pos))
#define MATRIX_PASSR11_PASPLIT2_Pos           _U_(8)                                               /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR11_PASPLIT2_Msk           (_U_(0xF) << MATRIX_PASSR11_PASPLIT2_Pos)            /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR11_PASPLIT2(value)        (MATRIX_PASSR11_PASPLIT2_Msk & ((value) << MATRIX_PASSR11_PASPLIT2_Pos))
#define MATRIX_PASSR11_PASPLIT3_Pos           _U_(12)                                              /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR11_PASPLIT3_Msk           (_U_(0xF) << MATRIX_PASSR11_PASPLIT3_Pos)            /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR11_PASPLIT3(value)        (MATRIX_PASSR11_PASPLIT3_Msk & ((value) << MATRIX_PASSR11_PASPLIT3_Pos))
#define MATRIX_PASSR11_PASPLIT4_Pos           _U_(16)                                              /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR11_PASPLIT4_Msk           (_U_(0xF) << MATRIX_PASSR11_PASPLIT4_Pos)            /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR11_PASPLIT4(value)        (MATRIX_PASSR11_PASPLIT4_Msk & ((value) << MATRIX_PASSR11_PASPLIT4_Pos))
#define MATRIX_PASSR11_PASPLIT5_Pos           _U_(20)                                              /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR11_PASPLIT5_Msk           (_U_(0xF) << MATRIX_PASSR11_PASPLIT5_Pos)            /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR11_PASPLIT5(value)        (MATRIX_PASSR11_PASPLIT5_Msk & ((value) << MATRIX_PASSR11_PASPLIT5_Pos))
#define MATRIX_PASSR11_PASPLIT6_Pos           _U_(24)                                              /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR11_PASPLIT6_Msk           (_U_(0xF) << MATRIX_PASSR11_PASPLIT6_Pos)            /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR11_PASPLIT6(value)        (MATRIX_PASSR11_PASPLIT6_Msk & ((value) << MATRIX_PASSR11_PASPLIT6_Pos))
#define MATRIX_PASSR11_PASPLIT7_Pos           _U_(28)                                              /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR11_PASPLIT7_Msk           (_U_(0xF) << MATRIX_PASSR11_PASPLIT7_Pos)            /**< (MATRIX_PASSR11) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR11_PASPLIT7(value)        (MATRIX_PASSR11_PASPLIT7_Msk & ((value) << MATRIX_PASSR11_PASPLIT7_Pos))
#define MATRIX_PASSR11_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR11) Register Mask  */


/* -------- MATRIX_PASSR12 : (MATRIX Offset: 0x270) (R/W 32) Protected Areas Split Slave 0 Register 12 -------- */
#define MATRIX_PASSR12_PASPLIT0_Pos           _U_(0)                                               /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR12_PASPLIT0_Msk           (_U_(0xF) << MATRIX_PASSR12_PASPLIT0_Pos)            /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR12_PASPLIT0(value)        (MATRIX_PASSR12_PASPLIT0_Msk & ((value) << MATRIX_PASSR12_PASPLIT0_Pos))
#define MATRIX_PASSR12_PASPLIT1_Pos           _U_(4)                                               /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR12_PASPLIT1_Msk           (_U_(0xF) << MATRIX_PASSR12_PASPLIT1_Pos)            /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR12_PASPLIT1(value)        (MATRIX_PASSR12_PASPLIT1_Msk & ((value) << MATRIX_PASSR12_PASPLIT1_Pos))
#define MATRIX_PASSR12_PASPLIT2_Pos           _U_(8)                                               /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR12_PASPLIT2_Msk           (_U_(0xF) << MATRIX_PASSR12_PASPLIT2_Pos)            /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR12_PASPLIT2(value)        (MATRIX_PASSR12_PASPLIT2_Msk & ((value) << MATRIX_PASSR12_PASPLIT2_Pos))
#define MATRIX_PASSR12_PASPLIT3_Pos           _U_(12)                                              /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR12_PASPLIT3_Msk           (_U_(0xF) << MATRIX_PASSR12_PASPLIT3_Pos)            /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR12_PASPLIT3(value)        (MATRIX_PASSR12_PASPLIT3_Msk & ((value) << MATRIX_PASSR12_PASPLIT3_Pos))
#define MATRIX_PASSR12_PASPLIT4_Pos           _U_(16)                                              /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR12_PASPLIT4_Msk           (_U_(0xF) << MATRIX_PASSR12_PASPLIT4_Pos)            /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR12_PASPLIT4(value)        (MATRIX_PASSR12_PASPLIT4_Msk & ((value) << MATRIX_PASSR12_PASPLIT4_Pos))
#define MATRIX_PASSR12_PASPLIT5_Pos           _U_(20)                                              /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR12_PASPLIT5_Msk           (_U_(0xF) << MATRIX_PASSR12_PASPLIT5_Pos)            /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR12_PASPLIT5(value)        (MATRIX_PASSR12_PASPLIT5_Msk & ((value) << MATRIX_PASSR12_PASPLIT5_Pos))
#define MATRIX_PASSR12_PASPLIT6_Pos           _U_(24)                                              /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR12_PASPLIT6_Msk           (_U_(0xF) << MATRIX_PASSR12_PASPLIT6_Pos)            /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR12_PASPLIT6(value)        (MATRIX_PASSR12_PASPLIT6_Msk & ((value) << MATRIX_PASSR12_PASPLIT6_Pos))
#define MATRIX_PASSR12_PASPLIT7_Pos           _U_(28)                                              /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR12_PASPLIT7_Msk           (_U_(0xF) << MATRIX_PASSR12_PASPLIT7_Pos)            /**< (MATRIX_PASSR12) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR12_PASPLIT7(value)        (MATRIX_PASSR12_PASPLIT7_Msk & ((value) << MATRIX_PASSR12_PASPLIT7_Pos))
#define MATRIX_PASSR12_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR12) Register Mask  */


/* -------- MATRIX_PASSR13 : (MATRIX Offset: 0x274) (R/W 32) Protected Areas Split Slave 0 Register 13 -------- */
#define MATRIX_PASSR13_PASPLIT0_Pos           _U_(0)                                               /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR13_PASPLIT0_Msk           (_U_(0xF) << MATRIX_PASSR13_PASPLIT0_Pos)            /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR13_PASPLIT0(value)        (MATRIX_PASSR13_PASPLIT0_Msk & ((value) << MATRIX_PASSR13_PASPLIT0_Pos))
#define MATRIX_PASSR13_PASPLIT1_Pos           _U_(4)                                               /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR13_PASPLIT1_Msk           (_U_(0xF) << MATRIX_PASSR13_PASPLIT1_Pos)            /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR13_PASPLIT1(value)        (MATRIX_PASSR13_PASPLIT1_Msk & ((value) << MATRIX_PASSR13_PASPLIT1_Pos))
#define MATRIX_PASSR13_PASPLIT2_Pos           _U_(8)                                               /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR13_PASPLIT2_Msk           (_U_(0xF) << MATRIX_PASSR13_PASPLIT2_Pos)            /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR13_PASPLIT2(value)        (MATRIX_PASSR13_PASPLIT2_Msk & ((value) << MATRIX_PASSR13_PASPLIT2_Pos))
#define MATRIX_PASSR13_PASPLIT3_Pos           _U_(12)                                              /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR13_PASPLIT3_Msk           (_U_(0xF) << MATRIX_PASSR13_PASPLIT3_Pos)            /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR13_PASPLIT3(value)        (MATRIX_PASSR13_PASPLIT3_Msk & ((value) << MATRIX_PASSR13_PASPLIT3_Pos))
#define MATRIX_PASSR13_PASPLIT4_Pos           _U_(16)                                              /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR13_PASPLIT4_Msk           (_U_(0xF) << MATRIX_PASSR13_PASPLIT4_Pos)            /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR13_PASPLIT4(value)        (MATRIX_PASSR13_PASPLIT4_Msk & ((value) << MATRIX_PASSR13_PASPLIT4_Pos))
#define MATRIX_PASSR13_PASPLIT5_Pos           _U_(20)                                              /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR13_PASPLIT5_Msk           (_U_(0xF) << MATRIX_PASSR13_PASPLIT5_Pos)            /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR13_PASPLIT5(value)        (MATRIX_PASSR13_PASPLIT5_Msk & ((value) << MATRIX_PASSR13_PASPLIT5_Pos))
#define MATRIX_PASSR13_PASPLIT6_Pos           _U_(24)                                              /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR13_PASPLIT6_Msk           (_U_(0xF) << MATRIX_PASSR13_PASPLIT6_Pos)            /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR13_PASPLIT6(value)        (MATRIX_PASSR13_PASPLIT6_Msk & ((value) << MATRIX_PASSR13_PASPLIT6_Pos))
#define MATRIX_PASSR13_PASPLIT7_Pos           _U_(28)                                              /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR13_PASPLIT7_Msk           (_U_(0xF) << MATRIX_PASSR13_PASPLIT7_Pos)            /**< (MATRIX_PASSR13) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR13_PASPLIT7(value)        (MATRIX_PASSR13_PASPLIT7_Msk & ((value) << MATRIX_PASSR13_PASPLIT7_Pos))
#define MATRIX_PASSR13_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR13) Register Mask  */


/* -------- MATRIX_PASSR14 : (MATRIX Offset: 0x278) (R/W 32) Protected Areas Split Slave 0 Register 14 -------- */
#define MATRIX_PASSR14_PASPLIT0_Pos           _U_(0)                                               /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR14_PASPLIT0_Msk           (_U_(0xF) << MATRIX_PASSR14_PASPLIT0_Pos)            /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR14_PASPLIT0(value)        (MATRIX_PASSR14_PASPLIT0_Msk & ((value) << MATRIX_PASSR14_PASPLIT0_Pos))
#define MATRIX_PASSR14_PASPLIT1_Pos           _U_(4)                                               /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR14_PASPLIT1_Msk           (_U_(0xF) << MATRIX_PASSR14_PASPLIT1_Pos)            /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR14_PASPLIT1(value)        (MATRIX_PASSR14_PASPLIT1_Msk & ((value) << MATRIX_PASSR14_PASPLIT1_Pos))
#define MATRIX_PASSR14_PASPLIT2_Pos           _U_(8)                                               /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR14_PASPLIT2_Msk           (_U_(0xF) << MATRIX_PASSR14_PASPLIT2_Pos)            /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR14_PASPLIT2(value)        (MATRIX_PASSR14_PASPLIT2_Msk & ((value) << MATRIX_PASSR14_PASPLIT2_Pos))
#define MATRIX_PASSR14_PASPLIT3_Pos           _U_(12)                                              /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR14_PASPLIT3_Msk           (_U_(0xF) << MATRIX_PASSR14_PASPLIT3_Pos)            /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR14_PASPLIT3(value)        (MATRIX_PASSR14_PASPLIT3_Msk & ((value) << MATRIX_PASSR14_PASPLIT3_Pos))
#define MATRIX_PASSR14_PASPLIT4_Pos           _U_(16)                                              /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR14_PASPLIT4_Msk           (_U_(0xF) << MATRIX_PASSR14_PASPLIT4_Pos)            /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR14_PASPLIT4(value)        (MATRIX_PASSR14_PASPLIT4_Msk & ((value) << MATRIX_PASSR14_PASPLIT4_Pos))
#define MATRIX_PASSR14_PASPLIT5_Pos           _U_(20)                                              /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR14_PASPLIT5_Msk           (_U_(0xF) << MATRIX_PASSR14_PASPLIT5_Pos)            /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR14_PASPLIT5(value)        (MATRIX_PASSR14_PASPLIT5_Msk & ((value) << MATRIX_PASSR14_PASPLIT5_Pos))
#define MATRIX_PASSR14_PASPLIT6_Pos           _U_(24)                                              /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR14_PASPLIT6_Msk           (_U_(0xF) << MATRIX_PASSR14_PASPLIT6_Pos)            /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR14_PASPLIT6(value)        (MATRIX_PASSR14_PASPLIT6_Msk & ((value) << MATRIX_PASSR14_PASPLIT6_Pos))
#define MATRIX_PASSR14_PASPLIT7_Pos           _U_(28)                                              /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR14_PASPLIT7_Msk           (_U_(0xF) << MATRIX_PASSR14_PASPLIT7_Pos)            /**< (MATRIX_PASSR14) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR14_PASPLIT7(value)        (MATRIX_PASSR14_PASPLIT7_Msk & ((value) << MATRIX_PASSR14_PASPLIT7_Pos))
#define MATRIX_PASSR14_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR14) Register Mask  */


