Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_PASSR15 : (MATRIX Offset: 0x27C) (R/W 32) Protected Areas Split Slave 0 Register 15 -------- */
#define MATRIX_PASSR15_PASPLIT0_Pos           _U_(0)                                               /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR15_PASPLIT0_Msk           (_U_(0xF) << MATRIX_PASSR15_PASPLIT0_Pos)            /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR15_PASPLIT0(value)        (MATRIX_PASSR15_PASPLIT0_Msk & ((value) << MATRIX_PASSR15_PASPLIT0_Pos))
#define MATRIX_PASSR15_PASPLIT1_Pos           _U_(4)                                               /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR15_PASPLIT1_Msk           (_U_(0xF) << MATRIX_PASSR15_PASPLIT1_Pos)            /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR15_PASPLIT1(value)        (MATRIX_PASSR15_PASPLIT1_Msk & ((value) << MATRIX_PASSR15_PASPLIT1_Pos))
#define MATRIX_PASSR15_PASPLIT2_Pos           _U_(8)                                               /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR15_PASPLIT2_Msk           (_U_(0xF) << MATRIX_PASSR15_PASPLIT2_Pos)            /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR15_PASPLIT2(value)        (MATRIX_PASSR15_PASPLIT2_Msk & ((value) << MATRIX_PASSR15_PASPLIT2_Pos))
#define MATRIX_PASSR15_PASPLIT3_Pos           _U_(12)                                              /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR15_PASPLIT3_Msk           (_U_(0xF) << MATRIX_PASSR15_PASPLIT3_Pos)            /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR15_PASPLIT3(value)        (MATRIX_PASSR15_PASPLIT3_Msk & ((value) << MATRIX_PASSR15_PASPLIT3_Pos))
#define MATRIX_PASSR15_PASPLIT4_Pos           _U_(16)                                              /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR15_PASPLIT4_Msk           (_U_(0xF) << MATRIX_PASSR15_PASPLIT4_Pos)            /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR15_PASPLIT4(value)        (MATRIX_PASSR15_PASPLIT4_Msk & ((value) << MATRIX_PASSR15_PASPLIT4_Pos))
#define MATRIX_PASSR15_PASPLIT5_Pos           _U_(20)                                              /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR15_PASPLIT5_Msk           (_U_(0xF) << MATRIX_PASSR15_PASPLIT5_Pos)            /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR15_PASPLIT5(value)        (MATRIX_PASSR15_PASPLIT5_Msk & ((value) << MATRIX_PASSR15_PASPLIT5_Pos))
#define MATRIX_PASSR15_PASPLIT6_Pos           _U_(24)                                              /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR15_PASPLIT6_Msk           (_U_(0xF) << MATRIX_PASSR15_PASPLIT6_Pos)            /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR15_PASPLIT6(value)        (MATRIX_PASSR15_PASPLIT6_Msk & ((value) << MATRIX_PASSR15_PASPLIT6_Pos))
#define MATRIX_PASSR15_PASPLIT7_Pos           _U_(28)                                              /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR15_PASPLIT7_Msk           (_U_(0xF) << MATRIX_PASSR15_PASPLIT7_Pos)            /**< (MATRIX_PASSR15) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR15_PASPLIT7(value)        (MATRIX_PASSR15_PASPLIT7_Msk & ((value) << MATRIX_PASSR15_PASPLIT7_Pos))
#define MATRIX_PASSR15_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR15) Register Mask  */


/* -------- MATRIX_PRTSR0 : (MATRIX Offset: 0x280) (R/W 32) Protected Region Top Slave 0 Register 0 -------- */
#define MATRIX_PRTSR0_PRTOP0_Pos              _U_(0)                                               /**< (MATRIX_PRTSR0) HSELx Protected Region Top Position */
#define MATRIX_PRTSR0_PRTOP0_Msk              (_U_(0xF) << MATRIX_PRTSR0_PRTOP0_Pos)               /**< (MATRIX_PRTSR0) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR0_PRTOP0(value)           (MATRIX_PRTSR0_PRTOP0_Msk & ((value) << MATRIX_PRTSR0_PRTOP0_Pos))
#define MATRIX_PRTSR0_PRTOP1_Pos              _U_(4)                                               /**< (MATRIX_PRTSR0) HSELx Protected Region Top Position */
#define MATRIX_PRTSR0_PRTOP1_Msk              (_U_(0xF) << MATRIX_PRTSR0_PRTOP1_Pos)               /**< (MATRIX_PRTSR0) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR0_PRTOP1(value)           (MATRIX_PRTSR0_PRTOP1_Msk & ((value) << MATRIX_PRTSR0_PRTOP1_Pos))
#define MATRIX_PRTSR0_PRTOP2_Pos              _U_(8)                                               /**< (MATRIX_PRTSR0) HSELx Protected Region Top Position */
#define MATRIX_PRTSR0_PRTOP2_Msk              (_U_(0xF) << MATRIX_PRTSR0_PRTOP2_Pos)               /**< (MATRIX_PRTSR0) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR0_PRTOP2(value)           (MATRIX_PRTSR0_PRTOP2_Msk & ((value) << MATRIX_PRTSR0_PRTOP2_Pos))
#define MATRIX_PRTSR0_PRTOP3_Pos              _U_(12)                                              /**< (MATRIX_PRTSR0) HSELx Protected Region Top Position */
#define MATRIX_PRTSR0_PRTOP3_Msk              (_U_(0xF) << MATRIX_PRTSR0_PRTOP3_Pos)               /**< (MATRIX_PRTSR0) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR0_PRTOP3(value)           (MATRIX_PRTSR0_PRTOP3_Msk & ((value) << MATRIX_PRTSR0_PRTOP3_Pos))
#define MATRIX_PRTSR0_PRTOP4_Pos              _U_(16)                                              /**< (MATRIX_PRTSR0) HSELx Protected Region Top Position */
#define MATRIX_PRTSR0_PRTOP4_Msk              (_U_(0xF) << MATRIX_PRTSR0_PRTOP4_Pos)               /**< (MATRIX_PRTSR0) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR0_PRTOP4(value)           (MATRIX_PRTSR0_PRTOP4_Msk & ((value) << MATRIX_PRTSR0_PRTOP4_Pos))
#define MATRIX_PRTSR0_PRTOP5_Pos              _U_(20)                                              /**< (MATRIX_PRTSR0) HSELx Protected Region Top Position */
#define MATRIX_PRTSR0_PRTOP5_Msk              (_U_(0xF) << MATRIX_PRTSR0_PRTOP5_Pos)               /**< (MATRIX_PRTSR0) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR0_PRTOP5(value)           (MATRIX_PRTSR0_PRTOP5_Msk & ((value) << MATRIX_PRTSR0_PRTOP5_Pos))
#define MATRIX_PRTSR0_PRTOP6_Pos              _U_(24)                                              /**< (MATRIX_PRTSR0) HSELx Protected Region Top Position */
#define MATRIX_PRTSR0_PRTOP6_Msk              (_U_(0xF) << MATRIX_PRTSR0_PRTOP6_Pos)               /**< (MATRIX_PRTSR0) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR0_PRTOP6(value)           (MATRIX_PRTSR0_PRTOP6_Msk & ((value) << MATRIX_PRTSR0_PRTOP6_Pos))
#define MATRIX_PRTSR0_PRTOP7_Pos              _U_(28)                                              /**< (MATRIX_PRTSR0) HSELx Protected Region Top Position */
#define MATRIX_PRTSR0_PRTOP7_Msk              (_U_(0xF) << MATRIX_PRTSR0_PRTOP7_Pos)               /**< (MATRIX_PRTSR0) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR0_PRTOP7(value)           (MATRIX_PRTSR0_PRTOP7_Msk & ((value) << MATRIX_PRTSR0_PRTOP7_Pos))
#define MATRIX_PRTSR0_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR0) Register Mask  */


