Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_PRTSR1 : (MATRIX Offset: 0x284) (R/W 32) Protected Region Top Slave 0 Register 1 -------- */
#define MATRIX_PRTSR1_PRTOP0_Pos              _U_(0)                                               /**< (MATRIX_PRTSR1) HSELx Protected Region Top Position */
#define MATRIX_PRTSR1_PRTOP0_Msk              (_U_(0xF) << MATRIX_PRTSR1_PRTOP0_Pos)               /**< (MATRIX_PRTSR1) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR1_PRTOP0(value)           (MATRIX_PRTSR1_PRTOP0_Msk & ((value) << MATRIX_PRTSR1_PRTOP0_Pos))
#define MATRIX_PRTSR1_PRTOP1_Pos              _U_(4)                                               /**< (MATRIX_PRTSR1) HSELx Protected Region Top Position */
#define MATRIX_PRTSR1_PRTOP1_Msk              (_U_(0xF) << MATRIX_PRTSR1_PRTOP1_Pos)               /**< (MATRIX_PRTSR1) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR1_PRTOP1(value)           (MATRIX_PRTSR1_PRTOP1_Msk & ((value) << MATRIX_PRTSR1_PRTOP1_Pos))
#define MATRIX_PRTSR1_PRTOP2_Pos              _U_(8)                                               /**< (MATRIX_PRTSR1) HSELx Protected Region Top Position */
#define MATRIX_PRTSR1_PRTOP2_Msk              (_U_(0xF) << MATRIX_PRTSR1_PRTOP2_Pos)               /**< (MATRIX_PRTSR1) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR1_PRTOP2(value)           (MATRIX_PRTSR1_PRTOP2_Msk & ((value) << MATRIX_PRTSR1_PRTOP2_Pos))
#define MATRIX_PRTSR1_PRTOP3_Pos              _U_(12)                                              /**< (MATRIX_PRTSR1) HSELx Protected Region Top Position */
#define MATRIX_PRTSR1_PRTOP3_Msk              (_U_(0xF) << MATRIX_PRTSR1_PRTOP3_Pos)               /**< (MATRIX_PRTSR1) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR1_PRTOP3(value)           (MATRIX_PRTSR1_PRTOP3_Msk & ((value) << MATRIX_PRTSR1_PRTOP3_Pos))
#define MATRIX_PRTSR1_PRTOP4_Pos              _U_(16)                                              /**< (MATRIX_PRTSR1) HSELx Protected Region Top Position */
#define MATRIX_PRTSR1_PRTOP4_Msk              (_U_(0xF) << MATRIX_PRTSR1_PRTOP4_Pos)               /**< (MATRIX_PRTSR1) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR1_PRTOP4(value)           (MATRIX_PRTSR1_PRTOP4_Msk & ((value) << MATRIX_PRTSR1_PRTOP4_Pos))
#define MATRIX_PRTSR1_PRTOP5_Pos              _U_(20)                                              /**< (MATRIX_PRTSR1) HSELx Protected Region Top Position */
#define MATRIX_PRTSR1_PRTOP5_Msk              (_U_(0xF) << MATRIX_PRTSR1_PRTOP5_Pos)               /**< (MATRIX_PRTSR1) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR1_PRTOP5(value)           (MATRIX_PRTSR1_PRTOP5_Msk & ((value) << MATRIX_PRTSR1_PRTOP5_Pos))
#define MATRIX_PRTSR1_PRTOP6_Pos              _U_(24)                                              /**< (MATRIX_PRTSR1) HSELx Protected Region Top Position */
#define MATRIX_PRTSR1_PRTOP6_Msk              (_U_(0xF) << MATRIX_PRTSR1_PRTOP6_Pos)               /**< (MATRIX_PRTSR1) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR1_PRTOP6(value)           (MATRIX_PRTSR1_PRTOP6_Msk & ((value) << MATRIX_PRTSR1_PRTOP6_Pos))
#define MATRIX_PRTSR1_PRTOP7_Pos              _U_(28)                                              /**< (MATRIX_PRTSR1) HSELx Protected Region Top Position */
#define MATRIX_PRTSR1_PRTOP7_Msk              (_U_(0xF) << MATRIX_PRTSR1_PRTOP7_Pos)               /**< (MATRIX_PRTSR1) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR1_PRTOP7(value)           (MATRIX_PRTSR1_PRTOP7_Msk & ((value) << MATRIX_PRTSR1_PRTOP7_Pos))
#define MATRIX_PRTSR1_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR1) Register Mask  */


/* -------- MATRIX_PRTSR2 : (MATRIX Offset: 0x288) (R/W 32) Protected Region Top Slave 0 Register 2 -------- */
#define MATRIX_PRTSR2_PRTOP0_Pos              _U_(0)                                               /**< (MATRIX_PRTSR2) HSELx Protected Region Top Position */
#define MATRIX_PRTSR2_PRTOP0_Msk              (_U_(0xF) << MATRIX_PRTSR2_PRTOP0_Pos)               /**< (MATRIX_PRTSR2) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR2_PRTOP0(value)           (MATRIX_PRTSR2_PRTOP0_Msk & ((value) << MATRIX_PRTSR2_PRTOP0_Pos))
#define MATRIX_PRTSR2_PRTOP1_Pos              _U_(4)                                               /**< (MATRIX_PRTSR2) HSELx Protected Region Top Position */
#define MATRIX_PRTSR2_PRTOP1_Msk              (_U_(0xF) << MATRIX_PRTSR2_PRTOP1_Pos)               /**< (MATRIX_PRTSR2) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR2_PRTOP1(value)           (MATRIX_PRTSR2_PRTOP1_Msk & ((value) << MATRIX_PRTSR2_PRTOP1_Pos))
#define MATRIX_PRTSR2_PRTOP2_Pos              _U_(8)                                               /**< (MATRIX_PRTSR2) HSELx Protected Region Top Position */
#define MATRIX_PRTSR2_PRTOP2_Msk              (_U_(0xF) << MATRIX_PRTSR2_PRTOP2_Pos)               /**< (MATRIX_PRTSR2) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR2_PRTOP2(value)           (MATRIX_PRTSR2_PRTOP2_Msk & ((value) << MATRIX_PRTSR2_PRTOP2_Pos))
#define MATRIX_PRTSR2_PRTOP3_Pos              _U_(12)                                              /**< (MATRIX_PRTSR2) HSELx Protected Region Top Position */
#define MATRIX_PRTSR2_PRTOP3_Msk              (_U_(0xF) << MATRIX_PRTSR2_PRTOP3_Pos)               /**< (MATRIX_PRTSR2) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR2_PRTOP3(value)           (MATRIX_PRTSR2_PRTOP3_Msk & ((value) << MATRIX_PRTSR2_PRTOP3_Pos))
#define MATRIX_PRTSR2_PRTOP4_Pos              _U_(16)                                              /**< (MATRIX_PRTSR2) HSELx Protected Region Top Position */
#define MATRIX_PRTSR2_PRTOP4_Msk              (_U_(0xF) << MATRIX_PRTSR2_PRTOP4_Pos)               /**< (MATRIX_PRTSR2) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR2_PRTOP4(value)           (MATRIX_PRTSR2_PRTOP4_Msk & ((value) << MATRIX_PRTSR2_PRTOP4_Pos))
#define MATRIX_PRTSR2_PRTOP5_Pos              _U_(20)                                              /**< (MATRIX_PRTSR2) HSELx Protected Region Top Position */
#define MATRIX_PRTSR2_PRTOP5_Msk              (_U_(0xF) << MATRIX_PRTSR2_PRTOP5_Pos)               /**< (MATRIX_PRTSR2) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR2_PRTOP5(value)           (MATRIX_PRTSR2_PRTOP5_Msk & ((value) << MATRIX_PRTSR2_PRTOP5_Pos))
#define MATRIX_PRTSR2_PRTOP6_Pos              _U_(24)                                              /**< (MATRIX_PRTSR2) HSELx Protected Region Top Position */
#define MATRIX_PRTSR2_PRTOP6_Msk              (_U_(0xF) << MATRIX_PRTSR2_PRTOP6_Pos)               /**< (MATRIX_PRTSR2) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR2_PRTOP6(value)           (MATRIX_PRTSR2_PRTOP6_Msk & ((value) << MATRIX_PRTSR2_PRTOP6_Pos))
#define MATRIX_PRTSR2_PRTOP7_Pos              _U_(28)                                              /**< (MATRIX_PRTSR2) HSELx Protected Region Top Position */
#define MATRIX_PRTSR2_PRTOP7_Msk              (_U_(0xF) << MATRIX_PRTSR2_PRTOP7_Pos)               /**< (MATRIX_PRTSR2) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR2_PRTOP7(value)           (MATRIX_PRTSR2_PRTOP7_Msk & ((value) << MATRIX_PRTSR2_PRTOP7_Pos))
#define MATRIX_PRTSR2_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR2) Register Mask  */


/* -------- MATRIX_PRTSR3 : (MATRIX Offset: 0x28C) (R/W 32) Protected Region Top Slave 0 Register 3 -------- */
#define MATRIX_PRTSR3_PRTOP0_Pos              _U_(0)                                               /**< (MATRIX_PRTSR3) HSELx Protected Region Top Position */
#define MATRIX_PRTSR3_PRTOP0_Msk              (_U_(0xF) << MATRIX_PRTSR3_PRTOP0_Pos)               /**< (MATRIX_PRTSR3) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR3_PRTOP0(value)           (MATRIX_PRTSR3_PRTOP0_Msk & ((value) << MATRIX_PRTSR3_PRTOP0_Pos))
#define MATRIX_PRTSR3_PRTOP1_Pos              _U_(4)                                               /**< (MATRIX_PRTSR3) HSELx Protected Region Top Position */
#define MATRIX_PRTSR3_PRTOP1_Msk              (_U_(0xF) << MATRIX_PRTSR3_PRTOP1_Pos)               /**< (MATRIX_PRTSR3) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR3_PRTOP1(value)           (MATRIX_PRTSR3_PRTOP1_Msk & ((value) << MATRIX_PRTSR3_PRTOP1_Pos))
#define MATRIX_PRTSR3_PRTOP2_Pos              _U_(8)                                               /**< (MATRIX_PRTSR3) HSELx Protected Region Top Position */
#define MATRIX_PRTSR3_PRTOP2_Msk              (_U_(0xF) << MATRIX_PRTSR3_PRTOP2_Pos)               /**< (MATRIX_PRTSR3) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR3_PRTOP2(value)           (MATRIX_PRTSR3_PRTOP2_Msk & ((value) << MATRIX_PRTSR3_PRTOP2_Pos))
#define MATRIX_PRTSR3_PRTOP3_Pos              _U_(12)                                              /**< (MATRIX_PRTSR3) HSELx Protected Region Top Position */
#define MATRIX_PRTSR3_PRTOP3_Msk              (_U_(0xF) << MATRIX_PRTSR3_PRTOP3_Pos)               /**< (MATRIX_PRTSR3) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR3_PRTOP3(value)           (MATRIX_PRTSR3_PRTOP3_Msk & ((value) << MATRIX_PRTSR3_PRTOP3_Pos))
#define MATRIX_PRTSR3_PRTOP4_Pos              _U_(16)                                              /**< (MATRIX_PRTSR3) HSELx Protected Region Top Position */
#define MATRIX_PRTSR3_PRTOP4_Msk              (_U_(0xF) << MATRIX_PRTSR3_PRTOP4_Pos)               /**< (MATRIX_PRTSR3) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR3_PRTOP4(value)           (MATRIX_PRTSR3_PRTOP4_Msk & ((value) << MATRIX_PRTSR3_PRTOP4_Pos))
#define MATRIX_PRTSR3_PRTOP5_Pos              _U_(20)                                              /**< (MATRIX_PRTSR3) HSELx Protected Region Top Position */
#define MATRIX_PRTSR3_PRTOP5_Msk              (_U_(0xF) << MATRIX_PRTSR3_PRTOP5_Pos)               /**< (MATRIX_PRTSR3) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR3_PRTOP5(value)           (MATRIX_PRTSR3_PRTOP5_Msk & ((value) << MATRIX_PRTSR3_PRTOP5_Pos))
#define MATRIX_PRTSR3_PRTOP6_Pos              _U_(24)                                              /**< (MATRIX_PRTSR3) HSELx Protected Region Top Position */
#define MATRIX_PRTSR3_PRTOP6_Msk              (_U_(0xF) << MATRIX_PRTSR3_PRTOP6_Pos)               /**< (MATRIX_PRTSR3) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR3_PRTOP6(value)           (MATRIX_PRTSR3_PRTOP6_Msk & ((value) << MATRIX_PRTSR3_PRTOP6_Pos))
#define MATRIX_PRTSR3_PRTOP7_Pos              _U_(28)                                              /**< (MATRIX_PRTSR3) HSELx Protected Region Top Position */
#define MATRIX_PRTSR3_PRTOP7_Msk              (_U_(0xF) << MATRIX_PRTSR3_PRTOP7_Pos)               /**< (MATRIX_PRTSR3) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR3_PRTOP7(value)           (MATRIX_PRTSR3_PRTOP7_Msk & ((value) << MATRIX_PRTSR3_PRTOP7_Pos))
#define MATRIX_PRTSR3_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR3) Register Mask  */


