Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/* -------- MATRIX_PRTSR15 : (MATRIX Offset: 0x2BC) (R/W 32) Protected Region Top Slave 0 Register 15 -------- */
#define MATRIX_PRTSR15_PRTOP0_Pos             _U_(0)                                               /**< (MATRIX_PRTSR15) HSELx Protected Region Top Position */
#define MATRIX_PRTSR15_PRTOP0_Msk             (_U_(0xF) << MATRIX_PRTSR15_PRTOP0_Pos)              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR15_PRTOP0(value)          (MATRIX_PRTSR15_PRTOP0_Msk & ((value) << MATRIX_PRTSR15_PRTOP0_Pos))
#define MATRIX_PRTSR15_PRTOP1_Pos             _U_(4)                                               /**< (MATRIX_PRTSR15) HSELx Protected Region Top Position */
#define MATRIX_PRTSR15_PRTOP1_Msk             (_U_(0xF) << MATRIX_PRTSR15_PRTOP1_Pos)              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR15_PRTOP1(value)          (MATRIX_PRTSR15_PRTOP1_Msk & ((value) << MATRIX_PRTSR15_PRTOP1_Pos))
#define MATRIX_PRTSR15_PRTOP2_Pos             _U_(8)                                               /**< (MATRIX_PRTSR15) HSELx Protected Region Top Position */
#define MATRIX_PRTSR15_PRTOP2_Msk             (_U_(0xF) << MATRIX_PRTSR15_PRTOP2_Pos)              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR15_PRTOP2(value)          (MATRIX_PRTSR15_PRTOP2_Msk & ((value) << MATRIX_PRTSR15_PRTOP2_Pos))
#define MATRIX_PRTSR15_PRTOP3_Pos             _U_(12)                                              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Position */
#define MATRIX_PRTSR15_PRTOP3_Msk             (_U_(0xF) << MATRIX_PRTSR15_PRTOP3_Pos)              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR15_PRTOP3(value)          (MATRIX_PRTSR15_PRTOP3_Msk & ((value) << MATRIX_PRTSR15_PRTOP3_Pos))
#define MATRIX_PRTSR15_PRTOP4_Pos             _U_(16)                                              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Position */
#define MATRIX_PRTSR15_PRTOP4_Msk             (_U_(0xF) << MATRIX_PRTSR15_PRTOP4_Pos)              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR15_PRTOP4(value)          (MATRIX_PRTSR15_PRTOP4_Msk & ((value) << MATRIX_PRTSR15_PRTOP4_Pos))
#define MATRIX_PRTSR15_PRTOP5_Pos             _U_(20)                                              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Position */
#define MATRIX_PRTSR15_PRTOP5_Msk             (_U_(0xF) << MATRIX_PRTSR15_PRTOP5_Pos)              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR15_PRTOP5(value)          (MATRIX_PRTSR15_PRTOP5_Msk & ((value) << MATRIX_PRTSR15_PRTOP5_Pos))
#define MATRIX_PRTSR15_PRTOP6_Pos             _U_(24)                                              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Position */
#define MATRIX_PRTSR15_PRTOP6_Msk             (_U_(0xF) << MATRIX_PRTSR15_PRTOP6_Pos)              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR15_PRTOP6(value)          (MATRIX_PRTSR15_PRTOP6_Msk & ((value) << MATRIX_PRTSR15_PRTOP6_Pos))
#define MATRIX_PRTSR15_PRTOP7_Pos             _U_(28)                                              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Position */
#define MATRIX_PRTSR15_PRTOP7_Msk             (_U_(0xF) << MATRIX_PRTSR15_PRTOP7_Pos)              /**< (MATRIX_PRTSR15) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR15_PRTOP7(value)          (MATRIX_PRTSR15_PRTOP7_Msk & ((value) << MATRIX_PRTSR15_PRTOP7_Pos))
#define MATRIX_PRTSR15_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR15) Register Mask  */


/* -------- MATRIX_PPSELR0 : (MATRIX Offset: 0x2C0) (R/W 32) Protected Peripheral Select 1 Register 0 -------- */
#define MATRIX_PPSELR0_USERP0_Pos             _U_(0)                                               /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP0_Msk             (_U_(0x1) << MATRIX_PPSELR0_USERP0_Pos)              /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP0(value)          (MATRIX_PPSELR0_USERP0_Msk & ((value) << MATRIX_PPSELR0_USERP0_Pos))
#define MATRIX_PPSELR0_USERP1_Pos             _U_(1)                                               /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP1_Msk             (_U_(0x1) << MATRIX_PPSELR0_USERP1_Pos)              /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP1(value)          (MATRIX_PPSELR0_USERP1_Msk & ((value) << MATRIX_PPSELR0_USERP1_Pos))
#define MATRIX_PPSELR0_USERP2_Pos             _U_(2)                                               /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP2_Msk             (_U_(0x1) << MATRIX_PPSELR0_USERP2_Pos)              /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP2(value)          (MATRIX_PPSELR0_USERP2_Msk & ((value) << MATRIX_PPSELR0_USERP2_Pos))
#define MATRIX_PPSELR0_USERP3_Pos             _U_(3)                                               /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP3_Msk             (_U_(0x1) << MATRIX_PPSELR0_USERP3_Pos)              /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP3(value)          (MATRIX_PPSELR0_USERP3_Msk & ((value) << MATRIX_PPSELR0_USERP3_Pos))
#define MATRIX_PPSELR0_USERP4_Pos             _U_(4)                                               /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP4_Msk             (_U_(0x1) << MATRIX_PPSELR0_USERP4_Pos)              /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP4(value)          (MATRIX_PPSELR0_USERP4_Msk & ((value) << MATRIX_PPSELR0_USERP4_Pos))
#define MATRIX_PPSELR0_USERP5_Pos             _U_(5)                                               /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP5_Msk             (_U_(0x1) << MATRIX_PPSELR0_USERP5_Pos)              /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP5(value)          (MATRIX_PPSELR0_USERP5_Msk & ((value) << MATRIX_PPSELR0_USERP5_Pos))
#define MATRIX_PPSELR0_USERP6_Pos             _U_(6)                                               /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP6_Msk             (_U_(0x1) << MATRIX_PPSELR0_USERP6_Pos)              /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP6(value)          (MATRIX_PPSELR0_USERP6_Msk & ((value) << MATRIX_PPSELR0_USERP6_Pos))
#define MATRIX_PPSELR0_USERP7_Pos             _U_(7)                                               /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP7_Msk             (_U_(0x1) << MATRIX_PPSELR0_USERP7_Pos)              /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP7(value)          (MATRIX_PPSELR0_USERP7_Msk & ((value) << MATRIX_PPSELR0_USERP7_Pos))
#define MATRIX_PPSELR0_USERP8_Pos             _U_(8)                                               /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP8_Msk             (_U_(0x1) << MATRIX_PPSELR0_USERP8_Pos)              /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP8(value)          (MATRIX_PPSELR0_USERP8_Msk & ((value) << MATRIX_PPSELR0_USERP8_Pos))
#define MATRIX_PPSELR0_USERP9_Pos             _U_(9)                                               /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP9_Msk             (_U_(0x1) << MATRIX_PPSELR0_USERP9_Pos)              /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP9(value)          (MATRIX_PPSELR0_USERP9_Msk & ((value) << MATRIX_PPSELR0_USERP9_Pos))
#define MATRIX_PPSELR0_USERP10_Pos            _U_(10)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP10_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP10_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP10(value)         (MATRIX_PPSELR0_USERP10_Msk & ((value) << MATRIX_PPSELR0_USERP10_Pos))
#define MATRIX_PPSELR0_USERP11_Pos            _U_(11)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP11_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP11_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP11(value)         (MATRIX_PPSELR0_USERP11_Msk & ((value) << MATRIX_PPSELR0_USERP11_Pos))
#define MATRIX_PPSELR0_USERP12_Pos            _U_(12)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP12_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP12_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP12(value)         (MATRIX_PPSELR0_USERP12_Msk & ((value) << MATRIX_PPSELR0_USERP12_Pos))
#define MATRIX_PPSELR0_USERP13_Pos            _U_(13)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP13_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP13_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP13(value)         (MATRIX_PPSELR0_USERP13_Msk & ((value) << MATRIX_PPSELR0_USERP13_Pos))
#define MATRIX_PPSELR0_USERP14_Pos            _U_(14)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP14_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP14_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP14(value)         (MATRIX_PPSELR0_USERP14_Msk & ((value) << MATRIX_PPSELR0_USERP14_Pos))
#define MATRIX_PPSELR0_USERP15_Pos            _U_(15)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP15_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP15_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP15(value)         (MATRIX_PPSELR0_USERP15_Msk & ((value) << MATRIX_PPSELR0_USERP15_Pos))
#define MATRIX_PPSELR0_USERP16_Pos            _U_(16)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP16_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP16_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP16(value)         (MATRIX_PPSELR0_USERP16_Msk & ((value) << MATRIX_PPSELR0_USERP16_Pos))
#define MATRIX_PPSELR0_USERP17_Pos            _U_(17)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP17_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP17_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP17(value)         (MATRIX_PPSELR0_USERP17_Msk & ((value) << MATRIX_PPSELR0_USERP17_Pos))
#define MATRIX_PPSELR0_USERP18_Pos            _U_(18)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP18_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP18_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP18(value)         (MATRIX_PPSELR0_USERP18_Msk & ((value) << MATRIX_PPSELR0_USERP18_Pos))
#define MATRIX_PPSELR0_USERP19_Pos            _U_(19)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP19_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP19_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP19(value)         (MATRIX_PPSELR0_USERP19_Msk & ((value) << MATRIX_PPSELR0_USERP19_Pos))
#define MATRIX_PPSELR0_USERP20_Pos            _U_(20)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP20_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP20_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP20(value)         (MATRIX_PPSELR0_USERP20_Msk & ((value) << MATRIX_PPSELR0_USERP20_Pos))
#define MATRIX_PPSELR0_USERP21_Pos            _U_(21)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP21_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP21_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP21(value)         (MATRIX_PPSELR0_USERP21_Msk & ((value) << MATRIX_PPSELR0_USERP21_Pos))
#define MATRIX_PPSELR0_USERP22_Pos            _U_(22)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP22_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP22_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP22(value)         (MATRIX_PPSELR0_USERP22_Msk & ((value) << MATRIX_PPSELR0_USERP22_Pos))
#define MATRIX_PPSELR0_USERP23_Pos            _U_(23)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP23_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP23_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP23(value)         (MATRIX_PPSELR0_USERP23_Msk & ((value) << MATRIX_PPSELR0_USERP23_Pos))
#define MATRIX_PPSELR0_USERP24_Pos            _U_(24)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP24_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP24_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP24(value)         (MATRIX_PPSELR0_USERP24_Msk & ((value) << MATRIX_PPSELR0_USERP24_Pos))
#define MATRIX_PPSELR0_USERP25_Pos            _U_(25)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP25_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP25_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP25(value)         (MATRIX_PPSELR0_USERP25_Msk & ((value) << MATRIX_PPSELR0_USERP25_Pos))
#define MATRIX_PPSELR0_USERP26_Pos            _U_(26)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP26_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP26_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP26(value)         (MATRIX_PPSELR0_USERP26_Msk & ((value) << MATRIX_PPSELR0_USERP26_Pos))
#define MATRIX_PPSELR0_USERP27_Pos            _U_(27)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP27_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP27_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP27(value)         (MATRIX_PPSELR0_USERP27_Msk & ((value) << MATRIX_PPSELR0_USERP27_Pos))
#define MATRIX_PPSELR0_USERP28_Pos            _U_(28)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP28_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP28_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP28(value)         (MATRIX_PPSELR0_USERP28_Msk & ((value) << MATRIX_PPSELR0_USERP28_Pos))
#define MATRIX_PPSELR0_USERP29_Pos            _U_(29)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP29_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP29_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP29(value)         (MATRIX_PPSELR0_USERP29_Msk & ((value) << MATRIX_PPSELR0_USERP29_Pos))
#define MATRIX_PPSELR0_USERP30_Pos            _U_(30)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP30_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP30_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP30(value)         (MATRIX_PPSELR0_USERP30_Msk & ((value) << MATRIX_PPSELR0_USERP30_Pos))
#define MATRIX_PPSELR0_USERP31_Pos            _U_(31)                                              /**< (MATRIX_PPSELR0) User PSELy Peripheral Position */
#define MATRIX_PPSELR0_USERP31_Msk            (_U_(0x1) << MATRIX_PPSELR0_USERP31_Pos)             /**< (MATRIX_PPSELR0) User PSELy Peripheral Mask */
#define MATRIX_PPSELR0_USERP31(value)         (MATRIX_PPSELR0_USERP31_Msk & ((value) << MATRIX_PPSELR0_USERP31_Pos))
#define MATRIX_PPSELR0_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PPSELR0) Register Mask  */

#define MATRIX_PPSELR0_USERP_Pos              _U_(0)                                               /**< (MATRIX_PPSELR0 Position) User PSELy Peripheral */
#define MATRIX_PPSELR0_USERP_Msk              (_U_(0xFFFFFFFF) << MATRIX_PPSELR0_USERP_Pos)        /**< (MATRIX_PPSELR0 Mask) USERP */
#define MATRIX_PPSELR0_USERP(value)           (MATRIX_PPSELR0_USERP_Msk & ((value) << MATRIX_PPSELR0_USERP_Pos)) 

