Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/matrix.h
/** \brief MATRIX register offsets definitions */
#define MATRIX_MCFG0_REG_OFST          (0x00)              /**< (MATRIX_MCFG0) Master Configuration Register 0 Offset */
#define MATRIX_MCFG1_REG_OFST          (0x04)              /**< (MATRIX_MCFG1) Master Configuration Register 1 Offset */
#define MATRIX_MCFG2_REG_OFST          (0x08)              /**< (MATRIX_MCFG2) Master Configuration Register 2 Offset */
#define MATRIX_MCFG3_REG_OFST          (0x0C)              /**< (MATRIX_MCFG3) Master Configuration Register 3 Offset */
#define MATRIX_MCFG4_REG_OFST          (0x10)              /**< (MATRIX_MCFG4) Master Configuration Register 4 Offset */
#define MATRIX_MCFG5_REG_OFST          (0x14)              /**< (MATRIX_MCFG5) Master Configuration Register 5 Offset */
#define MATRIX_MCFG6_REG_OFST          (0x18)              /**< (MATRIX_MCFG6) Master Configuration Register 6 Offset */
#define MATRIX_MCFG7_REG_OFST          (0x1C)              /**< (MATRIX_MCFG7) Master Configuration Register 7 Offset */
#define MATRIX_MCFG8_REG_OFST          (0x20)              /**< (MATRIX_MCFG8) Master Configuration Register 8 Offset */
#define MATRIX_MCFG9_REG_OFST          (0x24)              /**< (MATRIX_MCFG9) Master Configuration Register 9 Offset */
#define MATRIX_MCFG10_REG_OFST         (0x28)              /**< (MATRIX_MCFG10) Master Configuration Register 10 Offset */
#define MATRIX_MCFG11_REG_OFST         (0x2C)              /**< (MATRIX_MCFG11) Master Configuration Register 11 Offset */
#define MATRIX_MCFG12_REG_OFST         (0x30)              /**< (MATRIX_MCFG12) Master Configuration Register 12 Offset */
#define MATRIX_MCFG13_REG_OFST         (0x34)              /**< (MATRIX_MCFG13) Master Configuration Register 13 Offset */
#define MATRIX_MCFG14_REG_OFST         (0x38)              /**< (MATRIX_MCFG14) Master Configuration Register 14 Offset */
#define MATRIX_MCFG15_REG_OFST         (0x3C)              /**< (MATRIX_MCFG15) Master Configuration Register 15 Offset */
#define MATRIX_SCFG0_REG_OFST          (0x40)              /**< (MATRIX_SCFG0) Slave Configuration Register 0 Offset */
#define MATRIX_SCFG1_REG_OFST          (0x44)              /**< (MATRIX_SCFG1) Slave Configuration Register 1 Offset */
#define MATRIX_SCFG2_REG_OFST          (0x48)              /**< (MATRIX_SCFG2) Slave Configuration Register 2 Offset */
#define MATRIX_SCFG3_REG_OFST          (0x4C)              /**< (MATRIX_SCFG3) Slave Configuration Register 3 Offset */
#define MATRIX_SCFG4_REG_OFST          (0x50)              /**< (MATRIX_SCFG4) Slave Configuration Register 4 Offset */
#define MATRIX_SCFG5_REG_OFST          (0x54)              /**< (MATRIX_SCFG5) Slave Configuration Register 5 Offset */
#define MATRIX_SCFG6_REG_OFST          (0x58)              /**< (MATRIX_SCFG6) Slave Configuration Register 6 Offset */
#define MATRIX_SCFG7_REG_OFST          (0x5C)              /**< (MATRIX_SCFG7) Slave Configuration Register 7 Offset */
#define MATRIX_SCFG8_REG_OFST          (0x60)              /**< (MATRIX_SCFG8) Slave Configuration Register 8 Offset */
#define MATRIX_SCFG9_REG_OFST          (0x64)              /**< (MATRIX_SCFG9) Slave Configuration Register 9 Offset */
#define MATRIX_SCFG10_REG_OFST         (0x68)              /**< (MATRIX_SCFG10) Slave Configuration Register 10 Offset */
#define MATRIX_SCFG11_REG_OFST         (0x6C)              /**< (MATRIX_SCFG11) Slave Configuration Register 11 Offset */
#define MATRIX_SCFG12_REG_OFST         (0x70)              /**< (MATRIX_SCFG12) Slave Configuration Register 12 Offset */
#define MATRIX_SCFG13_REG_OFST         (0x74)              /**< (MATRIX_SCFG13) Slave Configuration Register 13 Offset */
#define MATRIX_SCFG14_REG_OFST         (0x78)              /**< (MATRIX_SCFG14) Slave Configuration Register 14 Offset */
#define MATRIX_SCFG15_REG_OFST         (0x7C)              /**< (MATRIX_SCFG15) Slave Configuration Register 15 Offset */
#define MATRIX_PRAS0_REG_OFST          (0x80)              /**< (MATRIX_PRAS0) Priority Register A for Slave 0 Offset */
#define MATRIX_PRBS0_REG_OFST          (0x84)              /**< (MATRIX_PRBS0) Priority Register B for Slave 0 Offset */
#define MATRIX_PRAS1_REG_OFST          (0x88)              /**< (MATRIX_PRAS1) Priority Register A for Slave 1 Offset */
#define MATRIX_PRBS1_REG_OFST          (0x8C)              /**< (MATRIX_PRBS1) Priority Register B for Slave 1 Offset */
#define MATRIX_PRAS2_REG_OFST          (0x90)              /**< (MATRIX_PRAS2) Priority Register A for Slave 2 Offset */
#define MATRIX_PRBS2_REG_OFST          (0x94)              /**< (MATRIX_PRBS2) Priority Register B for Slave 2 Offset */
#define MATRIX_PRAS3_REG_OFST          (0x98)              /**< (MATRIX_PRAS3) Priority Register A for Slave 3 Offset */
#define MATRIX_PRBS3_REG_OFST          (0x9C)              /**< (MATRIX_PRBS3) Priority Register B for Slave 3 Offset */
#define MATRIX_PRAS4_REG_OFST          (0xA0)              /**< (MATRIX_PRAS4) Priority Register A for Slave 4 Offset */
#define MATRIX_PRBS4_REG_OFST          (0xA4)              /**< (MATRIX_PRBS4) Priority Register B for Slave 4 Offset */
#define MATRIX_PRAS5_REG_OFST          (0xA8)              /**< (MATRIX_PRAS5) Priority Register A for Slave 5 Offset */
#define MATRIX_PRBS5_REG_OFST          (0xAC)              /**< (MATRIX_PRBS5) Priority Register B for Slave 5 Offset */
#define MATRIX_PRAS6_REG_OFST          (0xB0)              /**< (MATRIX_PRAS6) Priority Register A for Slave 6 Offset */
#define MATRIX_PRBS6_REG_OFST          (0xB4)              /**< (MATRIX_PRBS6) Priority Register B for Slave 6 Offset */
#define MATRIX_PRAS7_REG_OFST          (0xB8)              /**< (MATRIX_PRAS7) Priority Register A for Slave 7 Offset */
#define MATRIX_PRBS7_REG_OFST          (0xBC)              /**< (MATRIX_PRBS7) Priority Register B for Slave 7 Offset */
#define MATRIX_PRAS8_REG_OFST          (0xC0)              /**< (MATRIX_PRAS8) Priority Register A for Slave 8 Offset */
#define MATRIX_PRBS8_REG_OFST          (0xC4)              /**< (MATRIX_PRBS8) Priority Register B for Slave 8 Offset */
#define MATRIX_PRAS9_REG_OFST          (0xC8)              /**< (MATRIX_PRAS9) Priority Register A for Slave 9 Offset */
#define MATRIX_PRBS9_REG_OFST          (0xCC)              /**< (MATRIX_PRBS9) Priority Register B for Slave 9 Offset */
#define MATRIX_PRAS10_REG_OFST         (0xD0)              /**< (MATRIX_PRAS10) Priority Register A for Slave 10 Offset */
#define MATRIX_PRBS10_REG_OFST         (0xD4)              /**< (MATRIX_PRBS10) Priority Register B for Slave 10 Offset */
#define MATRIX_PRAS11_REG_OFST         (0xD8)              /**< (MATRIX_PRAS11) Priority Register A for Slave 11 Offset */
#define MATRIX_PRBS11_REG_OFST         (0xDC)              /**< (MATRIX_PRBS11) Priority Register B for Slave 11 Offset */
#define MATRIX_PRAS12_REG_OFST         (0xE0)              /**< (MATRIX_PRAS12) Priority Register A for Slave 12 Offset */
#define MATRIX_PRBS12_REG_OFST         (0xE4)              /**< (MATRIX_PRBS12) Priority Register B for Slave 12 Offset */
#define MATRIX_PRAS13_REG_OFST         (0xE8)              /**< (MATRIX_PRAS13) Priority Register A for Slave 13 Offset */
#define MATRIX_PRBS13_REG_OFST         (0xEC)              /**< (MATRIX_PRBS13) Priority Register B for Slave 13 Offset */
#define MATRIX_PRAS14_REG_OFST         (0xF0)              /**< (MATRIX_PRAS14) Priority Register A for Slave 14 Offset */
#define MATRIX_PRBS14_REG_OFST         (0xF4)              /**< (MATRIX_PRBS14) Priority Register B for Slave 14 Offset */
#define MATRIX_PRAS15_REG_OFST         (0xF8)              /**< (MATRIX_PRAS15) Priority Register A for Slave 15 Offset */
#define MATRIX_PRBS15_REG_OFST         (0xFC)              /**< (MATRIX_PRBS15) Priority Register B for Slave 15 Offset */
#define MATRIX_MRCR_REG_OFST           (0x100)             /**< (MATRIX_MRCR) Master Remap Control Register Offset */
#define MATRIX_SFR0_REG_OFST           (0x110)             /**< (MATRIX_SFR0) Special Function Register 0 Offset */
#define MATRIX_SFR1_REG_OFST           (0x114)             /**< (MATRIX_SFR1) Special Function Register 1 Offset */
#define MATRIX_SFR2_REG_OFST           (0x118)             /**< (MATRIX_SFR2) Special Function Register 2 Offset */
#define MATRIX_SFR3_REG_OFST           (0x11C)             /**< (MATRIX_SFR3) Special Function Register 3 Offset */
#define MATRIX_SFR4_REG_OFST           (0x120)             /**< (MATRIX_SFR4) Special Function Register 4 Offset */
#define MATRIX_SFR5_REG_OFST           (0x124)             /**< (MATRIX_SFR5) Special Function Register 5 Offset */
#define MATRIX_SFR6_REG_OFST           (0x128)             /**< (MATRIX_SFR6) Special Function Register 6 Offset */
#define MATRIX_SFR7_REG_OFST           (0x12C)             /**< (MATRIX_SFR7) Special Function Register 7 Offset */
#define MATRIX_SFR8_REG_OFST           (0x130)             /**< (MATRIX_SFR8) Special Function Register 8 Offset */
#define MATRIX_SFR9_REG_OFST           (0x134)             /**< (MATRIX_SFR9) Special Function Register 9 Offset */
#define MATRIX_SFR10_REG_OFST          (0x138)             /**< (MATRIX_SFR10) Special Function Register 10 Offset */
#define MATRIX_SFR11_REG_OFST          (0x13C)             /**< (MATRIX_SFR11) Special Function Register 11 Offset */
#define MATRIX_SFR12_REG_OFST          (0x140)             /**< (MATRIX_SFR12) Special Function Register 12 Offset */
#define MATRIX_SFR13_REG_OFST          (0x144)             /**< (MATRIX_SFR13) Special Function Register 13 Offset */
#define MATRIX_SFR14_REG_OFST          (0x148)             /**< (MATRIX_SFR14) Special Function Register 14 Offset */
#define MATRIX_SFR15_REG_OFST          (0x14C)             /**< (MATRIX_SFR15) Special Function Register 15 Offset */
#define MATRIX_MEIER_REG_OFST          (0x150)             /**< (MATRIX_MEIER) Master Error Interrupt Enable Register Offset */
#define MATRIX_MEIDR_REG_OFST          (0x154)             /**< (MATRIX_MEIDR) Master Error Interrupt Disable Register Offset */
#define MATRIX_MEIMR_REG_OFST          (0x158)             /**< (MATRIX_MEIMR) Master Error Interrupt Mask Register Offset */
#define MATRIX_MESR_REG_OFST           (0x15C)             /**< (MATRIX_MESR) Master Error Status Register Offset */
#define MATRIX_MEAR0_REG_OFST          (0x160)             /**< (MATRIX_MEAR0) Master 0 Error Address Register 0 Offset */
#define MATRIX_MEAR1_REG_OFST          (0x164)             /**< (MATRIX_MEAR1) Master 0 Error Address Register 1 Offset */
#define MATRIX_MEAR2_REG_OFST          (0x168)             /**< (MATRIX_MEAR2) Master 0 Error Address Register 2 Offset */
#define MATRIX_MEAR3_REG_OFST          (0x16C)             /**< (MATRIX_MEAR3) Master 0 Error Address Register 3 Offset */
#define MATRIX_MEAR4_REG_OFST          (0x170)             /**< (MATRIX_MEAR4) Master 0 Error Address Register 4 Offset */
#define MATRIX_MEAR5_REG_OFST          (0x174)             /**< (MATRIX_MEAR5) Master 0 Error Address Register 5 Offset */
#define MATRIX_MEAR6_REG_OFST          (0x178)             /**< (MATRIX_MEAR6) Master 0 Error Address Register 6 Offset */
#define MATRIX_MEAR7_REG_OFST          (0x17C)             /**< (MATRIX_MEAR7) Master 0 Error Address Register 7 Offset */
#define MATRIX_MEAR8_REG_OFST          (0x180)             /**< (MATRIX_MEAR8) Master 0 Error Address Register 8 Offset */
#define MATRIX_MEAR9_REG_OFST          (0x184)             /**< (MATRIX_MEAR9) Master 0 Error Address Register 9 Offset */
#define MATRIX_MEAR10_REG_OFST         (0x188)             /**< (MATRIX_MEAR10) Master 0 Error Address Register 10 Offset */
#define MATRIX_MEAR11_REG_OFST         (0x18C)             /**< (MATRIX_MEAR11) Master 0 Error Address Register 11 Offset */
#define MATRIX_MEAR12_REG_OFST         (0x190)             /**< (MATRIX_MEAR12) Master 0 Error Address Register 12 Offset */
#define MATRIX_MEAR13_REG_OFST         (0x194)             /**< (MATRIX_MEAR13) Master 0 Error Address Register 13 Offset */
#define MATRIX_MEAR14_REG_OFST         (0x198)             /**< (MATRIX_MEAR14) Master 0 Error Address Register 14 Offset */
#define MATRIX_MEAR15_REG_OFST         (0x19C)             /**< (MATRIX_MEAR15) Master 0 Error Address Register 15 Offset */
#define MATRIX_WPMR_REG_OFST           (0x1E4)             /**< (MATRIX_WPMR) Write Protect Mode Register Offset */
#define MATRIX_WPSR_REG_OFST           (0x1E8)             /**< (MATRIX_WPSR) Write Protect Status Register Offset */
#define MATRIX_PSR0_REG_OFST           (0x200)             /**< (MATRIX_PSR0) Protection Slave 0 Register 0 Offset */
#define MATRIX_PSR1_REG_OFST           (0x204)             /**< (MATRIX_PSR1) Protection Slave 0 Register 1 Offset */
#define MATRIX_PSR2_REG_OFST           (0x208)             /**< (MATRIX_PSR2) Protection Slave 0 Register 2 Offset */
#define MATRIX_PSR3_REG_OFST           (0x20C)             /**< (MATRIX_PSR3) Protection Slave 0 Register 3 Offset */
#define MATRIX_PSR4_REG_OFST           (0x210)             /**< (MATRIX_PSR4) Protection Slave 0 Register 4 Offset */
#define MATRIX_PSR5_REG_OFST           (0x214)             /**< (MATRIX_PSR5) Protection Slave 0 Register 5 Offset */
#define MATRIX_PSR6_REG_OFST           (0x218)             /**< (MATRIX_PSR6) Protection Slave 0 Register 6 Offset */
#define MATRIX_PSR7_REG_OFST           (0x21C)             /**< (MATRIX_PSR7) Protection Slave 0 Register 7 Offset */
#define MATRIX_PSR8_REG_OFST           (0x220)             /**< (MATRIX_PSR8) Protection Slave 0 Register 8 Offset */
#define MATRIX_PSR9_REG_OFST           (0x224)             /**< (MATRIX_PSR9) Protection Slave 0 Register 9 Offset */
#define MATRIX_PSR10_REG_OFST          (0x228)             /**< (MATRIX_PSR10) Protection Slave 0 Register 10 Offset */
#define MATRIX_PSR11_REG_OFST          (0x22C)             /**< (MATRIX_PSR11) Protection Slave 0 Register 11 Offset */
#define MATRIX_PSR12_REG_OFST          (0x230)             /**< (MATRIX_PSR12) Protection Slave 0 Register 12 Offset */
#define MATRIX_PSR13_REG_OFST          (0x234)             /**< (MATRIX_PSR13) Protection Slave 0 Register 13 Offset */
#define MATRIX_PSR14_REG_OFST          (0x238)             /**< (MATRIX_PSR14) Protection Slave 0 Register 14 Offset */
#define MATRIX_PSR15_REG_OFST          (0x23C)             /**< (MATRIX_PSR15) Protection Slave 0 Register 15 Offset */
#define MATRIX_PASSR0_REG_OFST         (0x240)             /**< (MATRIX_PASSR0) Protected Areas Split Slave 0 Register 0 Offset */
#define MATRIX_PASSR1_REG_OFST         (0x244)             /**< (MATRIX_PASSR1) Protected Areas Split Slave 0 Register 1 Offset */
#define MATRIX_PASSR2_REG_OFST         (0x248)             /**< (MATRIX_PASSR2) Protected Areas Split Slave 0 Register 2 Offset */
#define MATRIX_PASSR3_REG_OFST         (0x24C)             /**< (MATRIX_PASSR3) Protected Areas Split Slave 0 Register 3 Offset */
#define MATRIX_PASSR4_REG_OFST         (0x250)             /**< (MATRIX_PASSR4) Protected Areas Split Slave 0 Register 4 Offset */
#define MATRIX_PASSR5_REG_OFST         (0x254)             /**< (MATRIX_PASSR5) Protected Areas Split Slave 0 Register 5 Offset */
#define MATRIX_PASSR6_REG_OFST         (0x258)             /**< (MATRIX_PASSR6) Protected Areas Split Slave 0 Register 6 Offset */
#define MATRIX_PASSR7_REG_OFST         (0x25C)             /**< (MATRIX_PASSR7) Protected Areas Split Slave 0 Register 7 Offset */
#define MATRIX_PASSR8_REG_OFST         (0x260)             /**< (MATRIX_PASSR8) Protected Areas Split Slave 0 Register 8 Offset */
#define MATRIX_PASSR9_REG_OFST         (0x264)             /**< (MATRIX_PASSR9) Protected Areas Split Slave 0 Register 9 Offset */
#define MATRIX_PASSR10_REG_OFST        (0x268)             /**< (MATRIX_PASSR10) Protected Areas Split Slave 0 Register 10 Offset */
#define MATRIX_PASSR11_REG_OFST        (0x26C)             /**< (MATRIX_PASSR11) Protected Areas Split Slave 0 Register 11 Offset */
#define MATRIX_PASSR12_REG_OFST        (0x270)             /**< (MATRIX_PASSR12) Protected Areas Split Slave 0 Register 12 Offset */
#define MATRIX_PASSR13_REG_OFST        (0x274)             /**< (MATRIX_PASSR13) Protected Areas Split Slave 0 Register 13 Offset */
#define MATRIX_PASSR14_REG_OFST        (0x278)             /**< (MATRIX_PASSR14) Protected Areas Split Slave 0 Register 14 Offset */
#define MATRIX_PASSR15_REG_OFST        (0x27C)             /**< (MATRIX_PASSR15) Protected Areas Split Slave 0 Register 15 Offset */
#define MATRIX_PRTSR0_REG_OFST         (0x280)             /**< (MATRIX_PRTSR0) Protected Region Top Slave 0 Register 0 Offset */
#define MATRIX_PRTSR1_REG_OFST         (0x284)             /**< (MATRIX_PRTSR1) Protected Region Top Slave 0 Register 1 Offset */
#define MATRIX_PRTSR2_REG_OFST         (0x288)             /**< (MATRIX_PRTSR2) Protected Region Top Slave 0 Register 2 Offset */
#define MATRIX_PRTSR3_REG_OFST         (0x28C)             /**< (MATRIX_PRTSR3) Protected Region Top Slave 0 Register 3 Offset */
#define MATRIX_PRTSR4_REG_OFST         (0x290)             /**< (MATRIX_PRTSR4) Protected Region Top Slave 0 Register 4 Offset */
#define MATRIX_PRTSR5_REG_OFST         (0x294)             /**< (MATRIX_PRTSR5) Protected Region Top Slave 0 Register 5 Offset */
#define MATRIX_PRTSR6_REG_OFST         (0x298)             /**< (MATRIX_PRTSR6) Protected Region Top Slave 0 Register 6 Offset */
#define MATRIX_PRTSR7_REG_OFST         (0x29C)             /**< (MATRIX_PRTSR7) Protected Region Top Slave 0 Register 7 Offset */
#define MATRIX_PRTSR8_REG_OFST         (0x2A0)             /**< (MATRIX_PRTSR8) Protected Region Top Slave 0 Register 8 Offset */
#define MATRIX_PRTSR9_REG_OFST         (0x2A4)             /**< (MATRIX_PRTSR9) Protected Region Top Slave 0 Register 9 Offset */
#define MATRIX_PRTSR10_REG_OFST        (0x2A8)             /**< (MATRIX_PRTSR10) Protected Region Top Slave 0 Register 10 Offset */
#define MATRIX_PRTSR11_REG_OFST        (0x2AC)             /**< (MATRIX_PRTSR11) Protected Region Top Slave 0 Register 11 Offset */
#define MATRIX_PRTSR12_REG_OFST        (0x2B0)             /**< (MATRIX_PRTSR12) Protected Region Top Slave 0 Register 12 Offset */
#define MATRIX_PRTSR13_REG_OFST        (0x2B4)             /**< (MATRIX_PRTSR13) Protected Region Top Slave 0 Register 13 Offset */
#define MATRIX_PRTSR14_REG_OFST        (0x2B8)             /**< (MATRIX_PRTSR14) Protected Region Top Slave 0 Register 14 Offset */
#define MATRIX_PRTSR15_REG_OFST        (0x2BC)             /**< (MATRIX_PRTSR15) Protected Region Top Slave 0 Register 15 Offset */
#define MATRIX_PPSELR0_REG_OFST        (0x2C0)             /**< (MATRIX_PPSELR0) Protected Peripheral Select 1 Register 0 Offset */
#define MATRIX_PPSELR1_REG_OFST        (0x2C4)             /**< (MATRIX_PPSELR1) Protected Peripheral Select 1 Register 1 Offset */
#define MATRIX_PPSELR2_REG_OFST        (0x2C8)             /**< (MATRIX_PPSELR2) Protected Peripheral Select 1 Register 2 Offset */

